----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\Travail\Dropbox\mining_conflict\Data_Code_BCRT_AER\results\Results_quantifications.log
  log type:  text
 opened on:  14 Dec 2016, 09:46:31

. 
. * ----------------------------------------------------------------------------------------------- *
. *  A - Naive Quantification: effect of a SD increase in prices on conflict incidence (cell-level) *
. * ----------------------------------------------------------------------------------------------- *
. 
. 
. // With col 2 of baseline
. 
. use "$Output_data\BCRT_baseline", clear

. drop if mainmineral == "diamond" | mainmineral == "tantalum"
(588 observations deleted)

. 
. /*column 2: mine open the entire period*/
. reghdfe acled  main_lprice_mines if sd_mines == 0, vce(cluster country_nb) absorb(cell it) /*spatial HAC correction does not matter for prediction*/
(dropped 14 singleton observations)
(converged in 3 iterations)

HDFE Linear regression                            Number of obs   =    142,282
Absorbing 2 HDFE groups                           F(   1,     50) =      11.01
Statistics robust to heteroskedasticity           Prob > F        =     0.0017
                                                  R-squared       =     0.4231
                                                  Adj R-squared   =     0.3754
                                                  Within R-sq.    =     0.0003
Number of clusters (country_nb) =         51      Root MSE        =     0.1786

                                 (Std. Err. adjusted for 51 clusters in country_nb)
-----------------------------------------------------------------------------------
                  |               Robust
            acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
main_lprice_mines |   .0716129   .0215795     3.32   0.002     .0282691    .1149567
-----------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------------------+
      Absorbed FE |  Num. Coefs.  =   Categories  -   Redundant     | 
------------------+-------------------------------------------------|
             cell |            0           10163          10163 *   | 
               it |            0             714            714 *   | 
--------------------------------------------------------------------+
* = fixed effect nested within cluster; treated as redundant for DoF computation

. 
. keep if e(sample)  
(1,820 observations deleted)

. 
. scalar coeff=_b[main_lprice_mines]

. keep if mines==1
(141,218 observations deleted)

. sum acled if mines==1, d

                 Conflict incidence (Acled)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               1,064
25%            0              0       Sum of Wgt.       1,064

50%            0                      Mean           .1691729
                        Largest       Std. Dev.      .3750809
75%            0              1
90%            1              1       Variance       .1406857
95%            1              1       Skewness        1.76486
99%            1              1       Kurtosis       4.114731

. scalar baseline_acled = r(mean)

. tsset cell year
       panel variable:  cell (strongly balanced)
        time variable:  year, 1997 to 2010
                delta:  1 unit

. sum main_lprice if mines==1, d

                  $\ln$ price main mineral
-------------------------------------------------------------
      Percentiles      Smallest
 1%      3.42751       3.411136
 5%     3.567414       3.411136
10%     3.869094       3.411136       Obs               1,064
25%     7.344193       3.411136       Sum of Wgt.       1,064

50%     9.800775                      Mean            11.3762
                        Largest       Std. Dev.       5.22701
75%     16.42157       17.64027
90%     16.99085       17.64027       Variance       27.32164
95%     17.17672       17.64027       Skewness      -.1733559
99%     17.46976       17.64027       Kurtosis       1.356569

. sum D.main_lprice if mines==1, d

                        D.main_lprice
                  $\ln$ price main mineral
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.6427803      -.9756451
 5%    -.2417498      -.9756451
10%    -.0985193      -.9756451       Obs                 988
25%    -.0087833      -.9756451       Sum of Wgt.         988

50%     .0589597                      Mean           .0834745
                        Largest       Std. Dev.      .2475157
75%     .1783161       1.508158
90%     .3481998       1.508158       Variance        .061264
95%     .4762659       1.508158       Skewness       .7602398
99%     .8418789       1.508158       Kurtosis         12.483

. gen demean_main_lprice=main_lprice-m_main_lprice

. sum demean_main_lprice, d

                     demean_main_lprice
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.5939121      -.8681374
 5%    -.5252676      -.8681374
10%    -.4465327      -.8681374       Obs               1,064
25%     -.206037      -.8681374       Sum of Wgt.       1,064

50%     .7688322                      Mean           .5927071
                        Largest       Std. Dev.      .7848254
75%     1.088149       2.313822
90%      1.65743       2.313822       Variance       .6159509
95%     1.850271       2.313822       Skewness       .1014354
99%     2.143309       2.313822       Kurtosis       1.969282

. scalar quant_naive=r(sd) * coeff

. di "a one SD increase in prices translates into an increase in probability of conflict of " quant_naive ///
> " percentage point from a baseline probability of conflict of " baseline_acled ""
a one SD increase in prices translates into an increase in probability of conflict of .05620364 percentage point from a baseline probability of conflict of .16917293

. 
. // With col 3 of baseline
. 
. use "$Output_data\BCRT_baseline", clear

. 
. /*condition for estimation with spatial lags of mines*/
. g condition_around = (mainmineral != "diamond" & mainmineral_around != "diamond" & mainmineral != "tantalum" & mainmineral_around != "tantalum")

. 
. reghdfe acled  main_lprice_mines main_lprice_a if sd_mines == 0  & sd_mines_a ==0  & condition_around==1, vce(cluster country_nb) absorb(cell it) /*spatial HAC correction does not matter for predictions*/
(dropped 14 singleton observations)
(converged in 3 iterations)

HDFE Linear regression                            Number of obs   =    127,960
Absorbing 2 HDFE groups                           F(   2,     49) =      11.28
Statistics robust to heteroskedasticity           Prob > F        =     0.0001
                                                  R-squared       =     0.4238
                                                  Adj R-squared   =     0.3757
                                                  Within R-sq.    =     0.0004
Number of clusters (country_nb) =         50      Root MSE        =     0.1773

                                 (Std. Err. adjusted for 50 clusters in country_nb)
-----------------------------------------------------------------------------------
                  |               Robust
            acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
main_lprice_mines |   .0600584    .023698     2.53   0.015     .0124355    .1076814
    main_lprice_a |   .0207079   .0093753     2.21   0.032     .0018674    .0395483
-----------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------------------+
      Absorbed FE |  Num. Coefs.  =   Categories  -   Redundant     | 
------------------+-------------------------------------------------|
             cell |            0            9140           9140 *   | 
               it |            0             700            700 *   | 
--------------------------------------------------------------------+
* = fixed effect nested within cluster; treated as redundant for DoF computation

. 
. keep if e(sample) 
(16,730 observations deleted)

. 
. scalar coeff1=_b[main_lprice_mines]

. scalar coeff2=_b[main_lprice_a]

. keep if mines==1
(127,134 observations deleted)

. sum acled if mines==1, d

                 Conflict incidence (Acled)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs                 826
25%            0              0       Sum of Wgt.         826

50%            0                      Mean           .1973366
                        Largest       Std. Dev.      .3982296
75%            0              1
90%            1              1       Variance       .1585868
95%            1              1       Skewness       1.520966
99%            1              1       Kurtosis       3.313337

. scalar baseline_acled = r(mean)

. tsset cell year
       panel variable:  cell (strongly balanced)
        time variable:  year, 1997 to 2010
                delta:  1 unit

. sum main_lprice if mines==1, d

                  $\ln$ price main mineral
-------------------------------------------------------------
      Percentiles      Smallest
 1%      3.42751       3.411136
 5%     3.567414       3.411136
10%     3.767415       3.411136       Obs                 826
25%     7.328105       3.411136       Sum of Wgt.         826

50%     9.275826                      Mean           11.06012
                        Largest       Std. Dev.      5.231208
75%     16.37724       17.58209
90%     16.99085       17.64027       Variance       27.36554
95%     17.16917       17.64027       Skewness       -.078027
99%     17.46976       17.64027       Kurtosis       1.357992

. sum D.main_lprice if mines==1, d

                        D.main_lprice
                  $\ln$ price main mineral
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.6427803      -.9756451
 5%     -.269165      -.9756451
10%    -.0985193      -.9756451       Obs                 767
25%    -.0180945      -.9756451       Sum of Wgt.         767

50%     .0543404                      Mean            .083267
                        Largest       Std. Dev.      .2604956
75%     .1783161       1.508158
90%     .3651772       1.508158       Variance        .067858
95%     .4762659       1.508158       Skewness        .818878
99%     .8418789       1.508158       Kurtosis       12.48503

. gen demean_main_lprice=main_lprice-m_main_lprice

. sum demean_main_lprice, d

                     demean_main_lprice
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.5939121      -.8681374
 5%    -.5254636      -.8681374
10%    -.4611163      -.8681374       Obs                 826
25%    -.2280483      -.8681374       Sum of Wgt.         826

50%     .7434158                      Mean           .5523643
                        Largest       Std. Dev.      .7861147
75%      1.06249       2.255642
90%      1.65743       2.313822       Variance       .6179763
95%     1.835746       2.313822       Skewness        .171939
99%     2.143309       2.313822       Kurtosis        1.97305

. scalar quant_naive1=r(sd) * coeff1

. gen demean_main_lprice_a=main_lprice_a-m_main_lprice_a

. sum demean_main_lprice_a, d

                    demean_main_lprice_a
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.6512012      -.8681374
 5%    -.5410683      -.8681374
10%    -.4611163      -.6598701       Obs                 826
25%    -.3594725      -.6598701       Sum of Wgt.         826

50%    -.0043917                      Mean           1.56e-07
                        Largest       Std. Dev.      .4179148
75%      .265223        1.06249
90%      .640934        1.59033       Variance       .1746527
95%     .7775345        1.59033       Skewness       .6875379
99%      .939817        1.59033       Kurtosis       2.971892

. scalar quant_naive2=r(sd) * coeff2

. di "a one SD increase in prices translates into an increase in probability of conflict of " quant_naive1 + quant_naive2 ///
> " percentage point from a baseline probability of conflict of " baseline_acled ""
a one SD increase in prices translates into an increase in probability of conflict of .05586693 percentage point from a baseline probability of conflict of .19733656

. 
. // With col 4 of baseline
. 
. use "$Output_data\BCRT_baseline", clear

. drop if mainmineral == "diamond" | mainmineral == "tantalum"
(588 observations deleted)

. 
. /*column 4: mine at some point over the period*/
. reghdfe acled   main_lprice_hist0 , vce(cluster country_nb) absorb(cell it) /*spatial HAC correction does not matter for predictions*/
(dropped 14 singleton observations)
(converged in 3 iterations)

HDFE Linear regression                            Number of obs   =    143,850
Absorbing 2 HDFE groups                           F(   1,     50) =      16.08
Statistics robust to heteroskedasticity           Prob > F        =     0.0002
                                                  R-squared       =     0.4235
                                                  Adj R-squared   =     0.3758
                                                  Within R-sq.    =     0.0002
Number of clusters (country_nb) =         51      Root MSE        =     0.1797

                                 (Std. Err. adjusted for 51 clusters in country_nb)
-----------------------------------------------------------------------------------
                  |               Robust
            acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
main_lprice_hist0 |   .0451219    .011251     4.01   0.000     .0225235    .0677202
-----------------------------------------------------------------------------------

Absorbed degrees of freedom:
--------------------------------------------------------------------+
      Absorbed FE |  Num. Coefs.  =   Categories  -   Redundant     | 
------------------+-------------------------------------------------|
             cell |            0           10275          10275 *   | 
               it |            0             714            714 *   | 
--------------------------------------------------------------------+
* = fixed effect nested within cluster; treated as redundant for DoF computation

. 
. keep if e(sample) 
(252 observations deleted)

. 
. scalar coeff=_b[main_lprice_hist0]

. keep if max_mine==1
(141,218 observations deleted)

. sum acled if max_mine==1, d

                 Conflict incidence (Acled)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               2,632
25%            0              0       Sum of Wgt.       2,632

50%            0                      Mean           .1420973
                        Largest       Std. Dev.      .3492162
75%            0              1
90%            1              1       Variance        .121952
95%            1              1       Skewness       2.050138
99%            1              1       Kurtosis       5.203066

. scalar baseline_acled = r(mean)

. tsset cell year
       panel variable:  cell (strongly balanced)
        time variable:  year, 1997 to 2010
                delta:  1 unit

. sum main_lprice if max_mine==1, d

                  $\ln$ price main mineral
-------------------------------------------------------------
      Percentiles      Smallest
 1%     3.283061       3.283061
 5%     3.429702       3.283061
10%       3.5667       3.283061       Obs               2,632
25%     4.634674       3.283061       Sum of Wgt.       2,632

50%     8.805529                      Mean           10.78447
                        Largest       Std. Dev.      5.582268
75%     16.37724       17.64027
90%     16.99085       17.64027       Variance       31.16172
95%     17.16917       17.64027       Skewness       -.060513
99%     17.46976       17.64027       Kurtosis        1.25495

. sum D.main_lprice if max_mine==1, d

                        D.main_lprice
                  $\ln$ price main mineral
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.5996275      -.9756451
 5%    -.2571583      -.9756451
10%    -.1271644      -.9756451       Obs               2,444
25%    -.0279226      -.9756451       Sum of Wgt.       2,444

50%     .0713987                      Mean           .0819314
                        Largest       Std. Dev.      .2333321
75%     .1783161       1.508158
90%     .3481998       1.508158       Variance       .0544439
95%     .5123115       1.508158       Skewness       .3108172
99%     .5812998       1.508158       Kurtosis       8.626577

. gen demean_main_lprice=main_lprice_hist0-m_main_lprice

. sum demean_main_lprice, d

                     demean_main_lprice
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.5939121      -.8681374
 5%    -.5196471      -.8681374
10%    -.4331532      -.8681374       Obs               2,632
25%     -.205838      -.8681374       Sum of Wgt.       2,632

50%     .7572823                      Mean           .5708882
                        Largest       Std. Dev.      .7717904
75%      1.06249       2.313822
90%      1.65743       2.313822       Variance       .5956605
95%     1.835746       2.313822       Skewness       .1619018
99%     2.143309       2.313822       Kurtosis       2.017977

. scalar quant_naive=r(sd) * coeff

. di "a one SD increase in prices translates into an increase in probability of conflict of " quant_naive ///
> " percentage point from a baseline probability of conflict of " baseline_acled ""
a one SD increase in prices translates into an increase in probability of conflict of .03482463 percentage point from a baseline probability of conflict of .14209726

. 
. 
. * ------------------------------------------------------------------------------------------------- *
.                 *  B - Figures 1a and A7: baseline country-level quantification, PPML estimator  *
. * ------------------------------------------------------------------------------------------------- *
. 
. // Specification used similar to column 5 of Panel B, Table 11, augmented with surrounding cells
. // PPML estimator
. 
. 
. /*get 97 mineral prices of the cell */
. use "$Output_data\BCRT_baseline", clear

. drop if main_lprice == . | main_lprice == 0
(141,470 observations deleted)

. keep if mines == 1
(780 observations deleted)

. collapse (mean) main_lprice, by(mainmineral year)

. keep if year == 1997
(180 observations deleted)

. rename main_lprice main_lprice97

. keep mainmineral main_lprice

. sort mainmineral

. save "$Output_data\tempzz", replace
(note: file Data_Code_BCRT_AER\Data\tempzz.dta not found)
file Data_Code_BCRT_AER\Data\tempzz.dta saved

. 
. /*get 97 mineral prices of the surrounding cells */
. use "$Output_data\BCRT_baseline", clear

. drop if main_lprice == . | main_lprice == 0
(141,470 observations deleted)

. keep if mines == 1
(780 observations deleted)

. collapse (mean) main_lprice, by(mainmineral year)

. keep if year == 1997
(180 observations deleted)

. rename main_lprice main_lprice_a97

. rename mainmineral mainmineral_a 

. keep mainmineral_a main_lprice_a97

. sort mainmineral_a

. save "$Output_data\tempyy", replace
(note: file Data_Code_BCRT_AER\Data\tempyy.dta not found)
file Data_Code_BCRT_AER\Data\tempyy.dta saved

. 
. /*start with baseline dataset*/
. use "$Output_data\BCRT_baseline", clear

. 
. /* trim top 5% of nb events */
. g nb_acled_pos          = nb_acled if nb_acled>0
(136,710 missing values generated)

. egen p95_nb_acled       = pctile(nb_acled_pos), p(95)

. keep if  nb_acled<p95_nb_acled
(415 observations deleted)

. 
. drop   main_lprice 

. rename main_lprice_hist0 main_lprice

. 
. g condition_around = (mainmineral != "diamond" & mainmineral_around != "diamond" & mainmineral != "tantalum" & mainmineral_around != "tantalum")

. 
. /*estimation*/
. xtpqml nb_acled  main_lprice main_lprice_a yeard* if condition_around == 1, i(cell) cluster(country_nb) 
note: 7474 groups (104633 obs) dropped because of all zero outcomes
note: yeard12 dropped because of collinearity

Iteration 0:   log likelihood = -27826.919  
Iteration 1:   log likelihood =  -27568.21  
Iteration 2:   log likelihood = -27567.061  
Iteration 3:   log likelihood = -27567.061  

Conditional fixed-effects Poisson regression    Number of obs     =     34,391
Group variable: cell                            Number of groups  =      2,482

                                                Obs per group:
                                                              min =          3
                                                              avg =       13.9
                                                              max =         14

                                                Wald chi2(15)     =     521.14
Log likelihood  = -27567.061                    Prob > chi2       =     0.0000

-------------------------------------------------------------------------------
     nb_acled |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
  main_lprice |   .3170504   .0644739     4.92   0.000     .1906838     .443417
main_lprice_a |   .1336063   .0374944     3.56   0.000     .0601186    .2070941
       yeard1 |  -.2651486   .0395412    -6.71   0.000     -.342648   -.1876493
       yeard2 |  -.0763504   .0377935    -2.02   0.043    -.1504244   -.0022765
       yeard3 |  -.0097584     .03737    -0.26   0.794    -.0830022    .0634854
       yeard4 |   .0799129   .0365053     2.19   0.029     .0083638     .151462
       yeard5 |  -.1141009   .0384087    -2.97   0.003    -.1893805   -.0388213
       yeard6 |   .1083946   .0363981     2.98   0.003     .0370557    .1797336
       yeard7 |  -.3213505   .0401024    -8.01   0.000    -.3999498   -.2427513
       yeard8 |  -.1555442   .0379924    -4.09   0.000    -.2300081   -.0810804
       yeard9 |   -.203656    .038223    -5.33   0.000    -.2785717   -.1287402
      yeard10 |  -.2367249   .0381158    -6.21   0.000    -.3114305   -.1620194
      yeard11 |  -.2853068   .0386656    -7.38   0.000      -.36109   -.2095236
      yeard13 |   .0670216   .0352569     1.90   0.057    -.0020806    .1361238
      yeard14 |   .1115271     .03465     3.22   0.001     .0436144    .1794398
-------------------------------------------------------------------------------
Calculating Robust Standard Errors...
-------------------------------------------------------------------------------
     nb_acled |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
nb_acled      |
  main_lprice |   .3170504    .110003     2.88   0.004     .1014485    .5326523
main_lprice_a |   .1336063   .2223432     0.60   0.548    -.3021783     .569391
       yeard1 |  -.2651486   .2663536    -1.00   0.320    -.7871921    .2568948
       yeard2 |  -.0763504     .27647    -0.28   0.782    -.6182216    .4655207
       yeard3 |  -.0097584   .3174673    -0.03   0.975    -.6319828     .612466
       yeard4 |   .0799129   .2100513     0.38   0.704    -.3317801    .4916059
       yeard5 |  -.1141009   .2226278    -0.51   0.608    -.5504433    .3222415
       yeard6 |   .1083946   .1690302     0.64   0.521    -.2228985    .4396877
       yeard7 |  -.3213505   .1782755    -1.80   0.071     -.670764    .0280629
       yeard8 |  -.1555442   .1537513    -1.01   0.312    -.4568914    .1458029
       yeard9 |   -.203656   .1939494    -1.05   0.294    -.5837898    .1764779
      yeard10 |  -.2367249   .1337543    -1.77   0.077    -.4988785    .0254286
      yeard11 |  -.2853068   .1200883    -2.38   0.018    -.5206755   -.0499381
      yeard13 |   .0670216   .1490476     0.45   0.653    -.2251064    .3591496
      yeard14 |   .1115271   .1423285     0.78   0.433    -.1674316    .3904857
-------------------------------------------------------------------------------
Wald chi2(15) =   133.92                                Prob > chi2 =   0.0000

. 
. keep if condition_around == 1 /* prediction only on minerals with reliable prices */
(5,020 observations deleted)

. *
. cap drop benchLPM_nb

. predict  benchLPM_nb 
(option xb assumed; linear prediction)
(231 missing values generated)

. sum benchLPM_nb, d

                      Linear prediction
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.3213505      -.3213505
 5%    -.3213505      -.3213505
10%    -.2853068      -.3213505       Obs             139,024
25%    -.2036559      -.3213505       Sum of Wgt.     139,024

50%    -.0097584                      Mean           .2224405
                        Largest       Std. Dev.      .9206452
75%     .1083946       8.061234
90%     1.288001       8.061234       Variance       .8475876
95%     2.079254       8.061234       Skewness       4.168372
99%     3.675096       8.061234       Kurtosis       26.70888

. *
. tsset cell year
       panel variable:  cell (unbalanced)
        time variable:  year, 1997 to 2010, but with gaps
                delta:  1 unit

. 
. /* counterfactual: put all prices to their 97 level */
. sort  mainmineral 

. merge mainmineral using  "$Output_data\tempzz", nokeep
(note: you are using old merge syntax; see [D] merge for new syntax)
variable mainmineral does not uniquely identify observations in the master data

. tab  _merge

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    137,123       98.47       98.47
          3 |      2,132        1.53      100.00
------------+-----------------------------------
      Total |    139,255      100.00

. drop _merge

. *
. rename mainmineral_around mainmineral_a

. sort  mainmineral_a

. merge mainmineral_a using "$Output_data\tempyy", nokeep
(note: you are using old merge syntax; see [D] merge for new syntax)
variable mainmineral_a does not uniquely identify observations in the master data

. tab  _merge

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    118,782       85.30       85.30
          3 |     20,473       14.70      100.00
------------+-----------------------------------
      Total |    139,255      100.00

. drop _merge

. *
. replace main_lprice         = main_lprice97   if main_lprice   != 0
(2,328 real changes made, 434 to missing)

. replace main_lprice_a       = main_lprice_a97 if main_lprice_a != 0
(21,559 real changes made, 2,554 to missing)

. *
. cap drop counterLPM_nb

. predict counterLPM_nb
(option xb assumed; linear prediction)
(2,873 missing values generated)

. sum counterLPM_nb, d

                      Linear prediction
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.3213505      -.3213505
 5%    -.3213505      -.3213505
10%    -.2853068      -.3213505       Obs             136,382
25%    -.2036559      -.3213505       Sum of Wgt.     136,382

50%    -.0097584                      Mean           .2029067
                        Largest       Std. Dev.      .8931725
75%     .1083946       7.492466
90%     1.144089       7.492466       Variance       .7977572
95%     2.088329       7.492466       Skewness       4.224046
99%      3.40128       7.492466       Kurtosis       27.36578

. 
. /* how many events did not happen? */
. g diff = benchLPM_nb-counterLPM_nb
(2,873 missing values generated)

. /* drop 1997 (no change by definition) */
. drop if year == 1997
(9,957 observations deleted)

. /* keep if comparison can be made */
. replace counterLPM_nb = . if benchLPM_nb   ==.
(0 real changes made)

. replace benchLPM_nb   = . if counterLPM_nb ==.
(2,453 real changes made, 2,453 to missing)

. replace nb_acled      = . if counterLPM_nb ==.
(2,667 real changes made, 2,667 to missing)

. drop if counterLPM_nb == . | benchLPM_nb  == . | nb_acled == .
(2,667 observations deleted)

. save "$Output_data\tempzz", replace
file Data_Code_BCRT_AER\Data\tempzz.dta saved

. 
. ********************************************
. * country level effect for map (Figure A7) *
. ********************************************
. 
. use "$Output_data\tempzz", clear

. /* sum events by year and country */
. collapse (sum) nb_acled diff counterLPM_nb benchLPM_nb, by(iso_1 year)

. /* sum events by country over the period */ 
. collapse (sum) nb_acled diff counterLPM_nb benchLPM_nb, by(iso_1)

. g share1 = diff/nb_acled 
(4 missing values generated)

. g share2 = diff/benchLPM_nb 

. 
. sum, d 

                          Iso code
-------------------------------------------------------------
no observations

                       (sum) nb_acled
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            8              0       Obs                  51
25%           41              0       Sum of Wgt.          51

50%          161                      Mean           361.0196
                        Largest       Std. Dev.      484.2297
75%          402           1402
90%         1097           1494       Variance       234478.4
95%         1494           1501       Skewness       1.854569
99%         2134           2134       Kurtosis       5.842144

                         (sum) diff
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs                  51
25%            0              0       Sum of Wgt.          51

50%     5.845402                      Mean           22.26466
                        Largest       Std. Dev.      29.73429
75%      38.1428       72.39435
90%      55.6692       72.65296       Variance       884.1278
95%     72.65296        119.195       Skewness        1.56061
99%     119.2353       119.2353       Kurtosis       5.270286

                     (sum) counterLPM_nb
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -625.7054      -625.7054
 5%    -350.6605      -445.2158
10%    -209.0408      -350.6605       Obs                  51
25%    -34.18589      -239.4766       Sum of Wgt.          51

50%     104.8417                      Mean           536.4801
                        Largest       Std. Dev.      946.7848
75%     1197.093       2197.661
90%      1611.75       2370.924       Variance       896401.4
95%     2370.924       3110.655       Skewness       1.671838
99%     3995.499       3995.499       Kurtosis       5.694968

                      (sum) benchLPM_nb
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -625.7054      -625.7054
 5%    -349.5516      -445.2158
10%    -209.0408      -349.5516       Obs                  51
25%    -34.18589      -239.4766       Sum of Wgt.          51

50%     110.6871                      Mean           558.7447
                        Largest       Std. Dev.      974.4464
75%     1245.136       2252.195
90%     1649.489       2424.422       Variance       949545.8
95%     2424.422        3229.85       Skewness       1.667846
99%     4114.734       4114.734       Kurtosis       5.686411

                           share1
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs                  47
25%            0              0       Sum of Wgt.          47

50%     .0340454                      Mean           .3012936
                        Largest       Std. Dev.      .9668102
75%      .156323       .6643803
90%     .6445599       .7257602       Variance       .9347219
95%     .7257602       1.929794       Skewness       5.616891
99%     6.403186       6.403186       Kurtosis       35.42903

                           share2
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -7.797082      -7.797082
 5%    -.0031722      -.0473689
10%            0      -.0031722       Obs                  51
25%            0              0       Sum of Wgt.          51

50%     .0228777                      Mean          -.1285851
                        Largest       Std. Dev.      1.095638
75%     .0413517       .0637033
90%     .0566611       .0691436       Variance       1.200423
95%     .0691436       .0920705       Skewness      -6.922575
99%     .1054552       .1054552       Kurtosis       48.95608

. 
. rename iso_1 ISO3

. sort ISO3

. keep ISO3 diff nb_acled share1

. save "$Output_data\Figure_A7", replace
(note: file Data_Code_BCRT_AER\Data\Figure_A7.dta not found)
file Data_Code_BCRT_AER\Data\Figure_A7.dta saved

. 
. use "$Output_data\BCRT_baseline", replace

. replace main_lprice = . if main_lprice == 0
(141,470 real changes made, 141,470 to missing)

. collapse (mean) main_lprice mines, by(iso_1)

. g noprice = (mines>0 & main_lprice == .)

. *
. rename iso_1 ISO3

. sort ISO3

. merge ISO3 using "$Output_data\Figure_A7", nokeep
(note: you are using old merge syntax; see [D] merge for new syntax)

. tab _merge

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          1        1.92        1.92
          3 |         51       98.08      100.00
------------+-----------------------------------
      Total |         52      100.00

. drop _merge

. *
. rename share1 share

. replace share = -1 if share == 0 & noprice == 1
(0 real changes made)

. drop noprice

. 
. g share_bin = . 
(52 missing values generated)

. replace share_bin = 1 if share >= 0.000 & share < 0.01 & share != .
(20 real changes made)

. replace share_bin = 2 if share >= 0.010 & share < 0.050 & share != .
(4 real changes made)

. replace share_bin = 3 if share >= 0.050 & share < 0.200 & share != .
(13 real changes made)

. replace share_bin = 4 if share >= 0.200 & share < 0.500 & share != .
(4 real changes made)

. replace share_bin = 5 if share >= 0.500 & share != . 
(6 real changes made)

. replace share_bin = 0 if mines == 0 | nb_acled == . | nb_acled == 0 /* no observation in estimation */
(23 real changes made)

. 
. sort ISO3

. save "$Output_data\Figure_A7", replace
file Data_Code_BCRT_AER\Data\Figure_A7.dta saved

. outsheet using "$Results\Figure_A7.csv", comma replace
(note: file Data_Code_BCRT_AER\results\Figure_A7.csv not found)

. 
. *************************
. * Bar chart (Figure 1A) *
. *************************
. 
. rename share increase

. drop if increase == 0 | increase == . | increase == -1
(19 observations deleted)

. replace increase = 1 if increase > 1
(2 real changes made)

. graph hbar (sum) increase, over(ISO3, sort(increase) label(labsize(small))) bar(1, color(black)) legend(off) bgcolor(white) graphregion(color(white)) intensity(40)   lintensity(100) ytitle(Share of events explained by increase in mineral prices)  

. graph export $Results\Figure_1A.eps, as(eps) replace
(note: file Data_Code_BCRT_AER\results\Figure_1A.eps not found)
(file Data_Code_BCRT_AER\results\Figure_1A.eps written in EPS format)

. 
. *****************************
. * Aggregate quantifications *
. *****************************
. 
. /*get total number of observed events */
. /*(to be able to drop countries with less than 50 events in total sample)*/
. 
. use "$Output_data\BCRT_baseline", replace

. drop if year == 1997
(10,335 observations deleted)

. collapse (sum) nb_acled, by(iso_1)

. sort iso_1

. save "$Output_data\tempzz.dta", replace
file Data_Code_BCRT_AER\Data\tempzz.dta saved

. 
. use "$Output_data\Figure_A7", clear

. drop if share == -1 | nb_acled == .
(1 observation deleted)

. g nomines = (diff == 0)

. collapse (sum) nb_acled diff, by(nomines)

. egen nb_acled_tot = sum(nb_acled)

. 
. * share of events across all Africa in countries with mines 
. g share_events1 = diff/nb_acled if nomines == 0
(1 missing value generated)

. 
. ///// AGGREGATE QUANTIFICATIONS /////
> 
. /* how many events saved in Africa? */ 
. sum share_events1 if nomines == 0, d

                        share_events1
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0775878       .0775878
 5%     .0775878              .
10%     .0775878              .       Obs                   1
25%     .0775878              .       Sum of Wgt.           1

50%     .0775878                      Mean           .0775878
                        Largest       Std. Dev.             .
75%     .0775878              .
90%     .0775878              .       Variance              .
95%     .0775878              .       Skewness              .
99%     .0775878       .0775878       Kurtosis              .

. 
. /* how many on average across countries?*/
. use "$Output_data\Figure_A7", clear

. drop nb_acled

. rename ISO3 iso_1

. sort  iso_1

. merge iso_1 using "$Output_data\tempzz.dta", nokeep
(note: you are using old merge syntax; see [D] merge for new syntax)

. tab  _merge

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          3 |         52      100.00      100.00
------------+-----------------------------------
      Total |         52      100.00

. drop _merge

. 
. drop if share == 0 | share == . | share == -1 
(19 observations deleted)

. replace share = 1 if share > 1
(2 real changes made)

. 
. /* how many on average across countries with mines? */
. egen mean = mean(share)

. di mean 
.23720668

. /* how many on average across countries with mines, excluding countries with <50 events ?*/
. drop mean 

. egen mean = mean(share) if nb_acled>=50
(4 missing values generated)

. di mean 
.17539015

. *
. /*clean*/
. erase  "$Output_data\tempzz.dta"

. erase  "$Output_data\tempyy.dta"

. erase  "$Output_data\Figure_A7.dta"

. 
. 
. * ------------------------------------------------------------------------------------------------- *
.                 *  C - Figures 1b and A8: baseline country-level quantification, LPM estimator  *
. * ------------------------------------------------------------------------------------------------- *
. 
. // Specification used similar to column 2 of Panel B, Table 11, augmented with surrounding cells
. // LPM estimator
. 
. /*get 97 mineral prices of the cell */
. use "$Output_data\BCRT_baseline", clear

. drop if main_lprice == . | main_lprice == 0
(141,470 observations deleted)

. keep if mines == 1
(780 observations deleted)

. collapse (mean) main_lprice, by(mainmineral year)

. keep if year == 1997
(180 observations deleted)

. rename main_lprice main_lprice97

. keep mainmineral main_lprice

. sort mainmineral

. save "$Output_data\tempzz", replace
(note: file Data_Code_BCRT_AER\Data\tempzz.dta not found)
file Data_Code_BCRT_AER\Data\tempzz.dta saved

. 
. /*get 97 mineral prices of the surrounding cells */
. use "$Output_data\BCRT_baseline", clear

. drop if main_lprice == . | main_lprice == 0
(141,470 observations deleted)

. keep if mines == 1
(780 observations deleted)

. collapse (mean) main_lprice, by(mainmineral year)

. keep if year == 1997
(180 observations deleted)

. rename main_lprice main_lprice_a97

. rename mainmineral mainmineral_a 

. keep mainmineral_a main_lprice_a97

. sort mainmineral_a

. save "$Output_data\tempyy", replace
(note: file Data_Code_BCRT_AER\Data\tempyy.dta not found)
file Data_Code_BCRT_AER\Data\tempyy.dta saved

. 
. /*start with baseline dataset*/
. use "$Output_data\BCRT_baseline", clear

. 
. /* trim top 5% of nb events */
. g nb_acled_pos          = nb_acled if nb_acled>0
(136,710 missing values generated)

. egen p95_nb_acled       = pctile(nb_acled_pos), p(95)

. keep if  nb_acled<p95_nb_acled
(415 observations deleted)

. 
. qui tab it, gen(itd)

. 
. drop    main_lprice 

. rename  main_lprice_hist0 main_lprice

. 
. g condition_around = (mainmineral != "diamond" & mainmineral_around != "diamond" & mainmineral != "tantalum" & mainmineral_around != "tantalum")

. 
. /*estimation*/
. xtreg nb_acled  main_lprice main_lprice_a itd*  if condition_around == 1, fe cluster(country_nb)
note: itd2 omitted because of collinearity
note: itd18 omitted because of collinearity
note: itd40 omitted because of collinearity
note: itd45 omitted because of collinearity
note: itd58 omitted because of collinearity
note: itd83 omitted because of collinearity
note: itd98 omitted because of collinearity
note: itd112 omitted because of collinearity
note: itd125 omitted because of collinearity
note: itd132 omitted because of collinearity
note: itd143 omitted because of collinearity
note: itd155 omitted because of collinearity
note: itd169 omitted because of collinearity
note: itd187 omitted because of collinearity
note: itd210 omitted because of collinearity
note: itd212 omitted because of collinearity
note: itd234 omitted because of collinearity
note: itd246 omitted because of collinearity
note: itd266 omitted because of collinearity
note: itd270 omitted because of collinearity
note: itd283 omitted because of collinearity
note: itd297 omitted because of collinearity
note: itd319 omitted because of collinearity
note: itd334 omitted because of collinearity
note: itd342 omitted because of collinearity
note: itd364 omitted because of collinearity
note: itd376 omitted because of collinearity
note: itd384 omitted because of collinearity
note: itd398 omitted because of collinearity
note: itd409 omitted because of collinearity
note: itd425 omitted because of collinearity
note: itd448 omitted because of collinearity
note: itd451 omitted because of collinearity
note: itd465 omitted because of collinearity
note: itd490 omitted because of collinearity
note: itd501 omitted because of collinearity
note: itd518 omitted because of collinearity
note: itd519 omitted because of collinearity
note: itd540 omitted because of collinearity
note: itd550 omitted because of collinearity
note: itd562 omitted because of collinearity
note: itd588 omitted because of collinearity
note: itd594 omitted because of collinearity
note: itd605 omitted because of collinearity
note: itd628 omitted because of collinearity
note: itd639 omitted because of collinearity
note: itd656 omitted because of collinearity
note: itd667 omitted because of collinearity
note: itd680 omitted because of collinearity
note: itd698 omitted because of collinearity
note: itd711 omitted because of collinearity
note: itd726 omitted because of collinearity

Fixed-effects (within) regression               Number of obs      =    139024
Group variable: cell                            Number of groups   =      9956

R-sq:  within  = 0.0683                         Obs per group: min =         3
       between = 0.0090                                        avg =      14.0
       overall = 0.0002                                        max =        14

                                                F(2,51)            =         .
corr(u_i, Xb)  = -0.6852                        Prob > F           =         .

                             (Std. Err. adjusted for 52 clusters in country_nb)
-------------------------------------------------------------------------------
              |               Robust
     nb_acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
  main_lprice |   .1960485   .0708092     2.77   0.008     .0538931    .3382039
main_lprice_a |    .055752   .0261445     2.13   0.038     .0032647    .1082393
         itd1 |  -.2069761   .0000398 -5196.03   0.000    -.2070561   -.2068962
         itd2 |          0  (omitted)
         itd3 |   .1170864   6.77e-06  1.7e+04   0.000     .1170728       .1171
         itd4 |  -.0781674   .0000203 -3841.80   0.000    -.0782083   -.0781266
         itd5 |  -.1932093   7.85e-06 -2.5e+04   0.000    -.1932251   -.1931935
         itd6 |  -.5767692   7.02e-06 -8.2e+04   0.000    -.5767833   -.5767551
         itd7 |  -.5987066   .0000162 -3.7e+04   0.000    -.5987392    -.598674
         itd8 |  -.6070488   .0000739 -8212.14   0.000    -.6071972   -.6069004
         itd9 |  -.6098559   .0001055 -5779.48   0.000    -.6100678   -.6096441
        itd10 |  -.6018143   .0001888 -3187.64   0.000    -.6021933   -.6014353
        itd11 |  -.5634571   .0001883 -2992.63   0.000    -.5638351   -.5630791
        itd12 |  -.6017831   .0001742 -3455.18   0.000    -.6021328   -.6014335
        itd13 |  -.5989725   .0001409 -4251.03   0.000    -.5992553   -.5986896
        itd14 |  -.6100377   .0001908 -3197.55   0.000    -.6104208   -.6096547
        itd15 |   .5372923   .0014346   374.53   0.000     .5344123    .5401723
        itd16 |  -1.116749   .0012629  -884.28   0.000    -1.119284   -1.114214
        itd17 |  -.8519159   .0015784  -539.74   0.000    -.8550847   -.8487472
        itd18 |          0  (omitted)
        itd19 |   1.625851   .0000928  1.8e+04   0.000     1.625665    1.626037
        itd20 |    4.55347   .0020721  2197.54   0.000      4.54931     4.55763
        itd21 |   .4391357   .0006585   666.89   0.000     .4378138    .4404577
        itd22 |  -3.444003   .0003205 -1.1e+04   0.000    -3.444646   -3.443359
        itd23 |  -4.044306   .0001784 -2.3e+04   0.000    -4.044664   -4.043947
        itd24 |  -1.445894   .0005664 -2552.56   0.000    -1.447031   -1.444757
        itd25 |  -5.346348   .0007793 -6860.55   0.000    -5.347912   -5.344783
        itd26 |  -2.647177   .0011679 -2266.71   0.000    -2.649521   -2.644832
        itd27 |  -.6481707    .001634  -396.67   0.000    -.6514512   -.6448902
        itd28 |  -.8492729   .0021509  -394.85   0.000     -.853591   -.8449548
        itd29 |   .0393609   .0072927     5.40   0.000     .0247202    .0540017
        itd30 |   .1338186   .0069268    19.32   0.000     .1199126    .1477247
        itd31 |   .0144127   .0067587     2.13   0.038      .000844    .0279814
        itd32 |   .0143057   .0067086     2.13   0.038     .0008377    .0277737
        itd33 |    .038073   .0066888     5.69   0.000     .0246448    .0515013
        itd34 |   .0144826   .0067915     2.13   0.038     .0008481    .0281171
        itd35 |   .0393137   .0072706     5.41   0.000     .0247174      .05391
        itd36 |   .0631122   .0072654     8.69   0.000     .0485263    .0776981
        itd37 |   .0155293   .0072824     2.13   0.038     .0009094    .0301493
        itd38 |   .0152924   .0071713     2.13   0.038     .0008955    .0296894
        itd39 |   .0596309   .0056329    10.59   0.000     .0483224    .0709393
        itd40 |          0  (omitted)
        itd41 |   .0077706    .003644     2.13   0.038      .000455    .0150862
        itd42 |   .1746063   .0037233    46.90   0.000     .1671316    .1820811
        itd43 |  -.1473889   .0020836   -70.74   0.000    -.1515719   -.1432059
        itd44 |  -.1317329   .0006488  -203.03   0.000    -.1330355   -.1304303
        itd45 |          0  (omitted)
        itd46 |  -.0826267   .0004234  -195.17   0.000    -.0834766   -.0817767
        itd47 |  -.1208986   .0008762  -137.98   0.000    -.1226576   -.1191396
        itd48 |  -.1180178   .0038467   -30.68   0.000    -.1257405   -.1102952
        itd49 |  -.1811194   .0057889   -31.29   0.000     -.192741   -.1694977
        itd50 |  -.1608473   .0067259   -23.91   0.000    -.1743502   -.1473445
        itd51 |  -.1411884   .0078745   -17.93   0.000    -.1569971   -.1253797
        itd52 |  -.1471514   .0138965   -10.59   0.000    -.1750497   -.1192531
        itd53 |  -.2096108   .0156172   -13.42   0.000    -.2409636   -.1782581
        itd54 |  -.0922805   .0187585    -4.92   0.000    -.1299397   -.0546213
        itd55 |  -.1836662   .0225275    -8.15   0.000    -.2288919   -.1384404
        itd56 |  -.1957791   .0267059    -7.33   0.000    -.2493935   -.1421648
        itd57 |   -.003306   .0009495    -3.48   0.001    -.0052123   -.0013998
        itd58 |          0  (omitted)
        itd59 |   .0054346   .0003212    16.92   0.000     .0047897    .0060795
        itd60 |   .0011734   .0016766     0.70   0.487    -.0021925    .0045394
        itd61 |   .0279407   .0017672    15.81   0.000     .0243929    .0314885
        itd62 |   .0151599   .0015541     9.75   0.000     .0120398    .0182799
        itd63 |  -.0075733   .0024668    -3.07   0.003    -.0125257    -.002621
        itd64 |  -.0134769   .0043379    -3.11   0.003    -.0221857   -.0047681
        itd65 |  -.0067048    .004228    -1.59   0.119    -.0151928    .0017832
        itd66 |  -.0186382    .005793    -3.22   0.002    -.0302683   -.0070082
        itd67 |   -.015519   .0069057    -2.25   0.029    -.0293828   -.0016552
        itd68 |  -.0153478   .0072144    -2.13   0.038    -.0298313   -.0008643
        itd69 |  -.0027778   .0052671    -0.53   0.600     -.013352    .0077964
        itd70 |     -.0218   .0071317    -3.06   0.004    -.0361176   -.0074825
        itd71 |  -.1331455   1.43e-12 -9.3e+10   0.000    -.1331455   -.1331455
        itd72 |   -.128195   1.43e-12 -9.0e+10   0.000     -.128195    -.128195
        itd73 |   -.147997   1.43e-12 -1.0e+11   0.000     -.147997    -.147997
        itd74 |  -.1529475   1.43e-12 -1.1e+11   0.000    -.1529475   -.1529475
        itd75 |   -.138096   1.43e-12 -9.6e+10   0.000     -.138096    -.138096
        itd76 |  -.0341356   1.32e-12 -2.6e+10   0.000    -.0341356   -.0341356
        itd77 |  -.0143336   1.44e-12 -1.0e+10   0.000    -.0143336   -.0143336
        itd78 |   -.108393   1.44e-12 -7.5e+10   0.000     -.108393    -.108393
        itd79 |  -.0935415   1.44e-12 -6.5e+10   0.000    -.0935415   -.0935415
        itd80 |   .0252703   1.44e-12  1.8e+10   0.000     .0252703    .0252703
        itd81 |   .0566616   1.22e-12  4.6e+10   0.000     .0566616    .0566616
        itd82 |   .0351713   1.43e-12  2.5e+10   0.000     .0351713    .0351713
        itd83 |          0  (omitted)
        itd84 |   .1935872   1.44e-12  1.3e+11   0.000     .1935872    .1935872
        itd85 |  -.4594578   .0204067   -22.52   0.000    -.5004259   -.4184896
        itd86 |  -.4469004   .0215605   -20.73   0.000     -.490185   -.4036159
        itd87 |  -.2070883   .0220881    -9.38   0.000    -.2514319   -.1627446
        itd88 |  -.1942046   .0216936    -8.95   0.000    -.2377564   -.1506528
        itd89 |  -.4186719   .0213193   -19.64   0.000    -.4614722   -.3758716
        itd90 |   .2948585   .0188876    15.61   0.000     .2569401    .3327769
        itd91 |  -.0569894   .0172343    -3.31   0.002    -.0915886   -.0223902
        itd92 |  -.1268339   .0165384    -7.67   0.000    -.1600361   -.0936317
        itd93 |  -.2820128   .0154798   -18.22   0.000    -.3130897   -.2509359
        itd94 |  -.4667136   .0105727   -44.14   0.000    -.4879392    -.445488
        itd95 |  -.5654469   .0090357   -62.58   0.000    -.5835869   -.5473069
        itd96 |  -.4215133   .0064304   -65.55   0.000    -.4344228   -.4086037
        itd97 |  -.5898831   .0034967  -168.70   0.000     -.596903   -.5828633
        itd98 |          0  (omitted)
        itd99 |   .0130719   6.12e-13  2.1e+10   0.000     .0130719    .0130719
       itd100 |  -.0326797   6.12e-13 -5.3e+10   0.000    -.0326797   -.0326797
       itd101 |  -.0588235   6.11e-13 -9.6e+10   0.000    -.0588235   -.0588235
       itd102 |  -.0261438   6.11e-13 -4.3e+10   0.000    -.0261438   -.0261438
       itd103 |  -.0457516   6.12e-13 -7.5e+10   0.000    -.0457516   -.0457516
       itd104 |  -.0588235   6.12e-13 -9.6e+10   0.000    -.0588235   -.0588235
       itd105 |  -.0522876   6.12e-13 -8.5e+10   0.000    -.0522876   -.0522876
       itd106 |   .0326797   6.12e-13  5.3e+10   0.000     .0326797    .0326797
       itd107 |   .0457516   6.10e-13  7.5e+10   0.000     .0457516    .0457516
       itd108 |  -.0392157   6.12e-13 -6.4e+10   0.000    -.0392157   -.0392157
       itd109 |   .0588235   6.11e-13  9.6e+10   0.000     .0588235    .0588235
       itd110 |   .0784314   6.11e-13  1.3e+11   0.000     .0784314    .0784314
       itd111 |   .0326797   6.12e-13  5.3e+10   0.000     .0326797    .0326797
       itd112 |          0  (omitted)
       itd113 |  -.1251704   .0027578   -45.39   0.000    -.1307068   -.1196339
       itd114 |  -.1040563   .0035653   -29.19   0.000     -.111214   -.0968986
       itd115 |   .0812828   .0036842    22.06   0.000     .0738864    .0886792
       itd116 |  -.2268174   .0032079   -70.70   0.000    -.2332576   -.2203772
       itd117 |  -.1037975   .0034397   -30.18   0.000     -.110703   -.0968921
       itd118 |  -.1347566   .0033381   -40.37   0.000    -.1414581    -.128055
       itd119 |  -.2630027   .0030785   -85.43   0.000     -.269183   -.2568225
       itd120 |  -.2348734   .0019056  -123.26   0.000     -.238699   -.2310478
       itd121 |  -.0920004    .001241   -74.13   0.000    -.0944918    -.089509
       itd122 |  -.1643777   .0006526  -251.88   0.000    -.1656879   -.1630676
       itd123 |  -.2341283   .0006784  -345.11   0.000    -.2354903   -.2327663
       itd124 |  -.1825404   .0005183  -352.17   0.000     -.183581   -.1814998
       itd125 |          0  (omitted)
       itd126 |  -.1925486   .0011729  -164.16   0.000    -.1949033   -.1901938
       itd127 |   .1018519   8.67e-13  1.2e+11   0.000     .1018519    .1018519
       itd128 |   -.037037   8.76e-13 -4.2e+10   0.000     -.037037    -.037037
       itd129 |   .2407407   8.63e-13  2.8e+11   0.000     .2407407    .2407407
       itd130 |  -.1244384   7.21e-13 -1.7e+11   0.000    -.1244384   -.1244384
       itd131 |  -.1296296   8.72e-13 -1.5e+11   0.000    -.1296296   -.1296296
       itd132 |          0  (omitted)
       itd133 |  -.1519613   7.18e-13 -2.1e+11   0.000    -.1519613   -.1519613
       itd134 |  -.1060898   7.20e-13 -1.5e+11   0.000    -.1060898   -.1060898
       itd135 |  -.0602182   7.53e-13 -8.0e+10   0.000    -.0602182   -.0602182
       itd136 |  -.1336127   7.04e-13 -1.9e+11   0.000    -.1336127   -.1336127
       itd137 |  -.1519613   7.04e-13 -2.2e+11   0.000    -.1519613   -.1519613
       itd138 |  -.1886586   7.05e-13 -2.7e+11   0.000    -.1886586   -.1886586
       itd139 |  -.0326953   7.07e-13 -4.6e+10   0.000    -.0326953   -.0326953
       itd140 |  -.1244384   7.05e-13 -1.8e+11   0.000    -.1244384   -.1244384
       itd141 |  -9.40e-13   1.98e-12    -0.47   0.637    -4.91e-12    3.03e-12
       itd142 |  -9.40e-13   1.98e-12    -0.47   0.637    -4.91e-12    3.03e-12
       itd143 |          0  (omitted)
       itd144 |  -9.40e-13   1.98e-12    -0.47   0.637    -4.91e-12    3.03e-12
       itd145 |  -9.40e-13   1.98e-12    -0.47   0.637    -4.91e-12    3.03e-12
       itd146 |  -9.40e-13   1.98e-12    -0.47   0.637    -4.91e-12    3.03e-12
       itd147 |  -9.40e-13   1.98e-12    -0.47   0.637    -4.91e-12    3.03e-12
       itd148 |  -9.40e-13   1.98e-12    -0.47   0.637    -4.91e-12    3.03e-12
       itd149 |  -9.40e-13   1.98e-12    -0.47   0.637    -4.91e-12    3.03e-12
       itd150 |  -9.40e-13   1.98e-12    -0.47   0.637    -4.91e-12    3.03e-12
       itd151 |  -9.40e-13   1.98e-12    -0.47   0.637    -4.91e-12    3.03e-12
       itd152 |  -9.40e-13   1.98e-12    -0.47   0.637    -4.91e-12    3.03e-12
       itd153 |  -9.40e-13   1.98e-12    -0.47   0.637    -4.91e-12    3.03e-12
       itd154 |  -9.40e-13   1.98e-12    -0.47   0.637    -4.91e-12    3.03e-12
       itd155 |          0  (omitted)
       itd156 |   1.53e-12   2.58e-12     0.59   0.555    -3.64e-12    6.71e-12
       itd157 |   1.53e-12   2.58e-12     0.59   0.555    -3.64e-12    6.71e-12
       itd158 |   1.53e-12   2.58e-12     0.59   0.555    -3.64e-12    6.71e-12
       itd159 |   1.53e-12   2.58e-12     0.59   0.555    -3.64e-12    6.71e-12
       itd160 |   1.53e-12   2.58e-12     0.59   0.555    -3.64e-12    6.71e-12
       itd161 |   1.53e-12   2.58e-12     0.59   0.555    -3.64e-12    6.71e-12
       itd162 |   1.53e-12   2.58e-12     0.59   0.555    -3.64e-12    6.71e-12
       itd163 |   1.53e-12   2.58e-12     0.59   0.555    -3.64e-12    6.71e-12
       itd164 |   1.53e-12   2.58e-12     0.59   0.555    -3.64e-12    6.71e-12
       itd165 |   1.53e-12   2.58e-12     0.59   0.555    -3.64e-12    6.71e-12
       itd166 |   1.53e-12   2.58e-12     0.59   0.555    -3.64e-12    6.71e-12
       itd167 |   1.53e-12   2.58e-12     0.59   0.555    -3.64e-12    6.71e-12
       itd168 |   1.53e-12   2.58e-12     0.59   0.555    -3.64e-12    6.71e-12
       itd169 |          0  (omitted)
       itd170 |   8.51e-13   1.93e-12     0.44   0.662    -3.03e-12    4.73e-12
       itd171 |       .625   1.93e-12  3.2e+11   0.000         .625        .625
       itd172 |       .125   1.93e-12  6.5e+10   0.000         .125        .125
       itd173 |        .25   1.93e-12  1.3e+11   0.000          .25         .25
       itd174 |       .125   1.93e-12  6.5e+10   0.000         .125        .125
       itd175 |       .125   1.93e-12  6.5e+10   0.000         .125        .125
       itd176 |        .25   1.93e-12  1.3e+11   0.000          .25         .25
       itd177 |       .375   1.86e-12  2.0e+11   0.000         .375        .375
       itd178 |       .125   1.93e-12  6.5e+10   0.000         .125        .125
       itd179 |        .25   1.93e-12  1.3e+11   0.000          .25         .25
       itd180 |      1.625   1.94e-12  8.4e+11   0.000        1.625       1.625
       itd181 |   8.51e-13   1.93e-12     0.44   0.662    -3.03e-12    4.73e-12
       itd182 |          1   1.95e-12  5.1e+11   0.000            1           1
       itd183 |   .0051877   .0000819    63.33   0.000     .0050232    .0053522
       itd184 |  -.0325011    .000058  -560.58   0.000    -.0326175   -.0323847
       itd185 |  -.0496476   .0001503  -330.30   0.000    -.0499494   -.0493459
       itd186 |   .0883403   .0001016   869.50   0.000     .0881363    .0885443
       itd187 |          0  (omitted)
       itd188 |  -.0434986   .0001967  -221.12   0.000    -.0438935   -.0431036
       itd189 |  -.0369214   .0003537  -104.39   0.000    -.0376314   -.0362114
       itd190 |   .0110105   .0007177    15.34   0.000     .0095696    .0124514
       itd191 |  -.0620026   .0010616   -58.41   0.000    -.0641338   -.0598714
       itd192 |  -.0063519   .0017423    -3.65   0.001    -.0098498    -.002854
       itd193 |  -.0110856   .0024503    -4.52   0.000    -.0160049   -.0061663
       itd194 |  -.0009565   .0030254    -0.32   0.753    -.0070303    .0051173
       itd195 |   .0325233     .00273    11.91   0.000     .0270426    .0380041
       itd196 |  -.0261414   .0033969    -7.70   0.000    -.0329609   -.0193219
       itd197 |  -.0124777   .0039518    -3.16   0.003    -.0204114   -.0045441
       itd198 |  -.0846564    .003893   -21.75   0.000    -.0924719   -.0768409
       itd199 |  -.1071937   .0040994   -26.15   0.000    -.1154236   -.0989637
       itd200 |  -.0564058   .0039669   -14.22   0.000    -.0643696    -.048442
       itd201 |  -.0647871   .0037713   -17.18   0.000    -.0723582   -.0572159
       itd202 |  -.0456937   .0036371   -12.56   0.000    -.0529955   -.0383919
       itd203 |  -.0943376    .003494   -27.00   0.000     -.101352   -.0873232
       itd204 |  -.1093133   .0032687   -33.44   0.000    -.1158756   -.1027511
       itd205 |  -.0259462     .00229   -11.33   0.000    -.0305436   -.0213488
       itd206 |   -.101296   .0018782   -53.93   0.000    -.1050667   -.0975253
       itd207 |  -.0729131   .0008598   -84.80   0.000    -.0746392    -.071187
       itd208 |   .0010445   .0003925     2.66   0.010     .0002565    .0018325
       itd209 |  -.0546611   .0012532   -43.62   0.000    -.0571769   -.0521452
       itd210 |          0  (omitted)
       itd211 |  -1.040816   2.71e-12 -3.8e+11   0.000    -1.040816   -1.040816
       itd212 |          0  (omitted)
       itd213 |   .1836735   2.73e-12  6.7e+10   0.000     .1836735    .1836735
       itd214 |  -.1632653   2.72e-12 -6.0e+10   0.000    -.1632653   -.1632653
       itd215 |  -1.040816   2.71e-12 -3.8e+11   0.000    -1.040816   -1.040816
       itd216 |  -.9591837   2.71e-12 -3.5e+11   0.000    -.9591837   -.9591837
       itd217 |   -.877551   2.71e-12 -3.2e+11   0.000     -.877551    -.877551
       itd218 |  -.8979592   2.71e-12 -3.3e+11   0.000    -.8979592   -.8979592
       itd219 |  -.9591837   2.71e-12 -3.5e+11   0.000    -.9591837   -.9591837
       itd220 |  -.8571429   2.71e-12 -3.2e+11   0.000    -.8571429   -.8571429
       itd221 |  -.9591837   2.71e-12 -3.5e+11   0.000    -.9591837   -.9591837
       itd222 |  -.9387755   2.71e-12 -3.5e+11   0.000    -.9387755   -.9387755
       itd223 |  -.9183673   2.71e-12 -3.4e+11   0.000    -.9183673   -.9183673
       itd224 |  -1.040816   2.71e-12 -3.8e+11   0.000    -1.040816   -1.040816
       itd225 |  -.0642959   .0003637  -176.77   0.000    -.0650261   -.0635657
       itd226 |  -.0282901   .0004079   -69.36   0.000     -.029109   -.0274713
       itd227 |  -.0807323   .0004285  -188.40   0.000    -.0815926    -.079872
       itd228 |   .0432243    .000417   103.64   0.000      .042387    .0440615
       itd229 |  -.0172553   .0004009   -43.04   0.000    -.0180601   -.0164505
       itd230 |   .2726051   .0003095   880.78   0.000     .2719837    .2732264
       itd231 |   .0128092   .0002498    51.28   0.000     .0123077    .0133106
       itd232 |   .0293223    .000221   132.70   0.000     .0288787    .0297659
       itd233 |   .0364071   .0001857   196.05   0.000     .0360343    .0367799
       itd234 |          0  (omitted)
       itd235 |  -.0955702   .0000525 -1821.42   0.000    -.0956755   -.0954648
       itd236 |  -.0073784   .0001491   -49.49   0.000    -.0076776   -.0070791
       itd237 |   .0365734    .000265   138.02   0.000     .0360414    .0371053
       itd238 |   .2324319   .0003935   590.71   0.000      .231642    .2332219
       itd239 |   -.010989   1.84e-12 -6.0e+09   0.000     -.010989    -.010989
       itd240 |   -.010989   1.84e-12 -6.0e+09   0.000     -.010989    -.010989
       itd241 |  -5.22e-13   1.84e-12    -0.28   0.778    -4.21e-12    3.17e-12
       itd242 |  -5.21e-13   1.84e-12    -0.28   0.778    -4.21e-12    3.17e-12
       itd243 |    .010989   1.84e-12  6.0e+09   0.000      .010989     .010989
       itd244 |   -.021978   1.84e-12 -1.2e+10   0.000     -.021978    -.021978
       itd245 |   -.021978   1.84e-12 -1.2e+10   0.000     -.021978    -.021978
       itd246 |          0  (omitted)
       itd247 |   -.021978   1.84e-12 -1.2e+10   0.000     -.021978    -.021978
       itd248 |    .010989   1.84e-12  6.0e+09   0.000      .010989     .010989
       itd249 |   -.032967   1.90e-12 -1.7e+10   0.000     -.032967    -.032967
       itd250 |   -.010989   1.84e-12 -6.0e+09   0.000     -.010989    -.010989
       itd251 |   .0549451   1.80e-12  3.1e+10   0.000     .0549451    .0549451
       itd252 |  -5.22e-13   1.84e-12    -0.28   0.778    -4.21e-12    3.17e-12
       itd253 |   .0460262   .0182203     2.53   0.015     .0094474    .0826049
       itd254 |   .0755671   .0191862     3.94   0.000     .0370491    .1140851
       itd255 |   .0112864   .0196383     0.57   0.568    -.0281392    .0507119
       itd256 |   .0629025   .0193262     3.25   0.002     .0241035    .1017015
       itd257 |   .0223078   .0189834     1.18   0.245     -.015803    .0604186
       itd258 |   .0680071   .0168742     4.03   0.000     .0341307    .1018835
       itd259 |   .1425849   .0155648     9.16   0.000     .1113372    .1738325
       itd260 |   .0351206   .0148934     2.36   0.022      .005221    .0650203
       itd261 |   .0061162   .0140743     0.43   0.666    -.0221392    .0343716
       itd262 |   .0182565   .0097467     1.87   0.067    -.0013108    .0378238
       itd263 |   .0267721   .0082562     3.24   0.002      .010197    .0433472
       itd264 |   .0303456   .0050757     5.98   0.000     .0201557    .0405354
       itd265 |   .0360902   .0029774    12.12   0.000     .0301129    .0420676
       itd266 |          0  (omitted)
       itd267 |  -.4321865   .0001633 -2646.95   0.000    -.4325143   -.4318587
       itd268 |  -.1727191    .001809   -95.48   0.000    -.1763509   -.1690874
       itd269 |  -.1244738   .0019815   -62.82   0.000    -.1284519   -.1204958
       itd270 |          0  (omitted)
       itd271 |  -.1338996   .0002787  -480.41   0.000    -.1344592     -.13334
       itd272 |  -.4040421   .0010455  -386.45   0.000    -.4061411   -.4019432
       itd273 |   -.373846   .0019702  -189.75   0.000    -.3778013   -.3698906
       itd274 |  -.4109959   .0037575  -109.38   0.000    -.4185394   -.4034523
       itd275 |   -.322329   .0056682   -56.87   0.000    -.3337083   -.3109497
       itd276 |  -.4042149   .0120817   -33.46   0.000    -.4284699     -.37996
       itd277 |   .0681011     .01311     5.19   0.000     .0417818    .0944205
       itd278 |    -.31491    .013834   -22.76   0.000    -.3426828   -.2871371
       itd279 |  -.2729875   .0113903   -23.97   0.000    -.2958544   -.2501206
       itd280 |  -.1315264   .0166059    -7.92   0.000     -.164864   -.0981888
       itd281 |        -.5   2.19e-12 -2.3e+11   0.000          -.5         -.5
       itd282 |       -1.5   2.19e-12 -6.9e+11   0.000         -1.5        -1.5
       itd283 |          0  (omitted)
       itd284 |          1   2.19e-12  4.6e+11   0.000            1           1
       itd285 |          4   2.20e-12  1.8e+12   0.000            4           4
       itd286 |          3   2.20e-12  1.4e+12   0.000            3           3
       itd287 |          3   2.20e-12  1.4e+12   0.000            3           3
       itd288 |         .5   2.19e-12  2.3e+11   0.000           .5          .5
       itd289 |         -1   2.19e-12 -4.6e+11   0.000           -1          -1
       itd290 |   1.30e-12   2.19e-12     0.59   0.555    -3.09e-12    5.69e-12
       itd291 |         -1   2.19e-12 -4.6e+11   0.000           -1          -1
       itd292 |        -.5   2.19e-12 -2.3e+11   0.000          -.5         -.5
       itd293 |       -1.5   2.19e-12 -6.8e+11   0.000         -1.5        -1.5
       itd294 |         -2   2.20e-12 -9.1e+11   0.000           -2          -2
       itd295 |  -.0434978   .0008587   -50.65   0.000    -.0452218   -.0417739
       itd296 |   1.083792   .0002149  5042.64   0.000      1.08336    1.084223
       itd297 |          0  (omitted)
       itd298 |   .8785566   .0013382   656.53   0.000     .8758701    .8812432
       itd299 |  -.1980432   .0011866  -166.90   0.000    -.2004253    -.195661
       itd300 |  -.3508438   .0006963  -503.88   0.000    -.3522416   -.3494459
       itd301 |  -.0429988   .0006247   -68.83   0.000     -.044253   -.0417447
       itd302 |  -.1986815   .0014859  -133.71   0.000    -.2016646   -.1956984
       itd303 |   .3385435   .0020658   163.88   0.000     .3343962    .3426908
       itd304 |   .4875623   .0043296   112.61   0.000     .4788703    .4962542
       itd305 |  -.5118438    .004051  -126.35   0.000    -.5199766    -.503711
       itd306 |  -.4331959   .0032422  -133.61   0.000    -.4397049   -.4266869
       itd307 |  -.0422874   .0002911  -145.27   0.000    -.0428718    -.041703
       itd308 |  -.4309179    .002174  -198.22   0.000    -.4352823   -.4265535
       itd309 |   .0833333   2.08e-12  4.0e+10   0.000     .0833333    .0833333
       itd310 |  -1.57e-13   2.06e-12    -0.08   0.940    -4.30e-12    3.98e-12
       itd311 |  -.1666667   2.08e-12 -8.0e+10   0.000    -.1666667   -.1666667
       itd312 |  -1.57e-13   2.06e-12    -0.08   0.939    -4.30e-12    3.98e-12
       itd313 |  -.0833333   2.08e-12 -4.0e+10   0.000    -.0833333   -.0833333
       itd314 |  -.0833333   2.08e-12 -4.0e+10   0.000    -.0833333   -.0833333
       itd315 |  -.0833333   2.08e-12 -4.0e+10   0.000    -.0833333   -.0833333
       itd316 |  -.0833333   2.08e-12 -4.0e+10   0.000    -.0833333   -.0833333
       itd317 |  -.0833333   2.08e-12 -4.0e+10   0.000    -.0833333   -.0833333
       itd318 |  -.1666667   2.08e-12 -8.0e+10   0.000    -.1666667   -.1666667
       itd319 |          0  (omitted)
       itd320 |  -1.58e-13   2.06e-12    -0.08   0.939    -4.30e-12    3.98e-12
       itd321 |         .5   2.08e-12  2.4e+11   0.000           .5          .5
       itd322 |  -.0833333   2.08e-12 -4.0e+10   0.000    -.0833333   -.0833333
       itd323 |  -.5887708   .0011744  -501.36   0.000    -.5911284   -.5864132
       itd324 |  -.3226923   .0012821  -251.70   0.000    -.3252661   -.3201185
       itd325 |  -.2857057   .0013338  -214.20   0.000    -.2883834   -.2830279
       itd326 |  -.3594813   .0013011  -276.29   0.000    -.3620933   -.3568692
       itd327 |  -.5808948   .0012128  -478.98   0.000    -.5833296   -.5784601
       itd328 |  -.3128551   .0010354  -302.16   0.000    -.3149337   -.3107764
       itd329 |  -.6395892   .0008857  -722.16   0.000    -.6413673   -.6378112
       itd330 |  -.6661069   .0008134  -818.89   0.000    -.6677399   -.6644739
       itd331 |  -.3821438   .0007249  -527.16   0.000    -.3835991   -.3806884
       itd332 |  -.6044936   .0002616 -2310.48   0.000    -.6050188   -.6039683
       itd333 |  -.0469695   .0001309  -358.88   0.000    -.0472323   -.0467068
       itd334 |          0  (omitted)
       itd335 |  -.5221423   .0004073 -1281.94   0.000      -.52296   -.5213246
       itd336 |  -.4809371   .0007291  -659.66   0.000    -.4824008   -.4794734
       itd337 |  -1.122778   .0022378  -501.72   0.000    -1.127271   -1.118286
       itd338 |  -.7790971   .0024501  -317.99   0.000    -.7840158   -.7741784
       itd339 |  -.9506581   .0027399  -346.96   0.000    -.9561587   -.9451575
       itd340 |  -.8410164   .0026178  -321.27   0.000    -.8462718   -.8357611
       itd341 |  -.7254366   .0012527  -579.08   0.000    -.7279516   -.7229216
       itd342 |          0  (omitted)
       itd343 |   1.467736   .0001998  7346.55   0.000     1.467335    1.468137
       itd344 |  -.8990648   .0014647  -613.81   0.000    -.9020053   -.8961242
       itd345 |  -1.334367   .0052026  -256.48   0.000    -1.344812   -1.323923
       itd346 |  -.8561264   .0081102  -105.56   0.000    -.8724083   -.8398445
       itd347 |  -1.261488   .0119961  -105.16   0.000    -1.285571   -1.237405
       itd348 |  -.9945103   .0142047   -70.01   0.000    -1.023027   -.9659931
       itd349 |  -1.258265    .011697  -107.57   0.000    -1.281748   -1.234782
       itd350 |   -1.21279   .0171259   -70.82   0.000    -1.247171   -1.178408
       itd351 |  -.0066225   1.65e-12 -4.0e+09   0.000    -.0066225   -.0066225
       itd352 |  -.0016556   1.65e-12 -1.0e+09   0.000    -.0016556   -.0016556
       itd353 |  -.0033113   1.65e-12 -2.0e+09   0.000    -.0033113   -.0033113
       itd354 |  -.0066225   1.65e-12 -4.0e+09   0.000    -.0066225   -.0066225
       itd355 |  -.0033113   1.65e-12 -2.0e+09   0.000    -.0033113   -.0033113
       itd356 |  -.0049669   1.65e-12 -3.0e+09   0.000    -.0049669   -.0049669
       itd357 |  -.0082781   1.65e-12 -5.0e+09   0.000    -.0082781   -.0082781
       itd358 |  -.0082781   1.65e-12 -5.0e+09   0.000    -.0082781   -.0082781
       itd359 |  -.0082781   1.65e-12 -5.0e+09   0.000    -.0082781   -.0082781
       itd360 |  -.0016556   1.65e-12 -1.0e+09   0.000    -.0016556   -.0016556
       itd361 |  -.0082781   1.65e-12 -5.0e+09   0.000    -.0082781   -.0082781
       itd362 |  -.0033113   1.65e-12 -2.0e+09   0.000    -.0033113   -.0033113
       itd363 |  -.0066225   1.65e-12 -4.0e+09   0.000    -.0066225   -.0066225
       itd364 |          0  (omitted)
       itd365 |   .0478733   .0224498     2.13   0.038     .0028033    .0929432
       itd366 |   .0521418   .0244516     2.13   0.038     .0030533    .1012304
       itd367 |   .0551213   .0258487     2.13   0.038     .0032278    .1070148
       itd368 |   .0512334   .0240255     2.13   0.038     .0030001    .0994667
       itd369 |   .0411396   .0192921     2.13   0.038      .002409    .0798702
       itd370 |   .2481744    .022591    10.99   0.000      .202821    .2935278
       itd371 |   .0443883   .0208156     2.13   0.038     .0025993    .0861773
       itd372 |   .0265504   .0124506     2.13   0.038     .0015547    .0515462
       itd373 |   .2325616   .0152695    15.23   0.000     .2019067    .2632165
       itd374 |   .0269964   .0126598     2.13   0.038     .0015808    .0524119
       itd375 |   .0210402   .0098666     2.13   0.038     .0012321    .0408483
       itd376 |          0  (omitted)
       itd377 |   .0165618   .0077665     2.13   0.038     .0009698    .0321538
       itd378 |   .0037939   .0017791     2.13   0.038     .0002222    .0073656
       itd379 |    .002279   .0011703     1.95   0.057    -.0000704    .0046284
       itd380 |   .0215806   .0005119    42.16   0.000     .0205529    .0226082
       itd381 |     .01579   .0005031    31.39   0.000       .01478       .0168
       itd382 |   .0437642   .0007481    58.50   0.000     .0422623    .0452661
       itd383 |  -.0175487   .0000855  -205.33   0.000    -.0177203   -.0173771
       itd384 |          0  (omitted)
       itd385 |    .034113   .0001359   250.96   0.000     .0338401    .0343859
       itd386 |  -.0311382   .0029649   -10.50   0.000    -.0370904    -.025186
       itd387 |   .0278991   .0044345     6.29   0.000     .0189965    .0368018
       itd388 |  -.0283027    .010124    -2.80   0.007    -.0486274    -.007978
       itd389 |  -.0051465   .0121492    -0.42   0.674    -.0295371    .0192441
       itd390 |   -.045726   .0122777    -3.72   0.000    -.0703745   -.0210775
       itd391 |   -.051953   .0104731    -4.96   0.000    -.0729787   -.0309273
       itd392 |  -.0136389   .0132522    -1.03   0.308    -.0402437     .012966
       itd393 |  -.1712749   1.63e-12 -1.1e+11   0.000    -.1712749   -.1712749
       itd394 |  -.1712749   1.63e-12 -1.1e+11   0.000    -.1712749   -.1712749
       itd395 |  -.1842619   1.62e-12 -1.1e+11   0.000    -.1842619   -.1842619
       itd396 |  -.1712749   1.63e-12 -1.1e+11   0.000    -.1712749   -.1712749
       itd397 |  -.1626169   1.74e-12 -9.3e+10   0.000    -.1626169   -.1626169
       itd398 |          0  (omitted)
       itd399 |  -.1106688   1.74e-12 -6.4e+10   0.000    -.1106688   -.1106688
       itd400 |  -.0933528   1.63e-12 -5.7e+10   0.000    -.0933528   -.0933528
       itd401 |  -.1409718   1.71e-12 -8.3e+10   0.000    -.1409718   -.1409718
       itd402 |  -.1453008   1.68e-12 -8.7e+10   0.000    -.1453008   -.1453008
       itd403 |  -.1149978   1.74e-12 -6.6e+10   0.000    -.1149978   -.1149978
       itd404 |  -.1842619   1.62e-12 -1.1e+11   0.000    -.1842619   -.1842619
       itd405 |  -.1130435   1.51e-12 -7.5e+10   0.000    -.1130435   -.1130435
       itd406 |  -.1236558   1.68e-12 -7.4e+10   0.000    -.1236558   -.1236558
       itd407 |   .0104607   .0004679    22.36   0.000     .0095214    .0114001
       itd408 |  -.0145751    .000149   -97.79   0.000    -.0148744   -.0142759
       itd409 |          0  (omitted)
       itd410 |  -.0073437   .0000942   -77.92   0.000    -.0075329   -.0071545
       itd411 |  -.0076436   .0001996   -38.29   0.000    -.0080443   -.0072428
       itd412 |  -.0213143   .0008596   -24.80   0.000      -.02304   -.0195887
       itd413 |  -.0178251    .001291   -13.81   0.000    -.0204168   -.0152334
       itd414 |  -.0184175   .0014991   -12.29   0.000     -.021427   -.0154079
       itd415 |  -.0238605   .0017542   -13.60   0.000    -.0273822   -.0203388
       itd416 |  -.0158749   .0030918    -5.13   0.000    -.0220818   -.0096679
       itd417 |  -.0169626    .003474    -4.88   0.000    -.0239369   -.0099884
       itd418 |   .0046365   .0041717     1.11   0.272    -.0037385    .0130115
       itd419 |   -.021331   .0050088    -4.26   0.000    -.0313866   -.0112753
       itd420 |  -.0216139   .0059369    -3.64   0.001    -.0335327    -.009695
       itd421 |   .0238518   .0003328    71.68   0.000     .0231838    .0245199
       itd422 |  -.0132587   .0009232   -14.36   0.000    -.0151122   -.0114053
       itd423 |  -.0011909   .0011411    -1.04   0.302    -.0034818       .0011
       itd424 |   .0285265    .000691    41.28   0.000     .0271392    .0299138
       itd425 |          0  (omitted)
       itd426 |  -.0031412   .0002883   -10.89   0.000    -.0037201   -.0025624
       itd427 |   .0918754   .0002253   407.86   0.000     .0914231    .0923276
       itd428 |   .1073502    .001777    60.41   0.000     .1037827    .1109176
       itd429 |   .0541872   .0015337    35.33   0.000     .0511081    .0572663
       itd430 |   .0015968   .0027201     0.59   0.560     -.003864    .0070576
       itd431 |   .0116712   .0033472     3.49   0.001     .0049515     .018391
       itd432 |   .0463092   .0049139     9.42   0.000     .0364441    .0561742
       itd433 |   .1566822   .0038732    40.45   0.000     .1489065    .1644579
       itd434 |   .0764232   .0053133    14.38   0.000     .0657562    .0870902
       itd435 |   .0171844   .0051436     3.34   0.002     .0068582    .0275105
       itd436 |   .0122469   .0053263     2.30   0.026     .0015539    .0229399
       itd437 |   .0183162   .0055371     3.31   0.002        .0072    .0294324
       itd438 |   .0122538   .0053397     2.29   0.026     .0015339    .0229738
       itd439 |   .0118787   .0052023     2.28   0.027     .0014347    .0223226
       itd440 |    .011056   .0048825     2.26   0.028     .0012539    .0208581
       itd441 |   .0103027   .0046052     2.24   0.030     .0010574     .019548
       itd442 |   .0090664   .0041998     2.16   0.036     .0006349     .017498
       itd443 |   .0091852    .003321     2.77   0.008     .0025179    .0158524
       itd444 |   .0036219   .0023167     1.56   0.124    -.0010291     .008273
       itd445 |   .0038846   .0014666     2.65   0.011     .0009403    .0068288
       itd446 |    .002457   .0009362     2.62   0.011     .0005774    .0043365
       itd447 |   .0066706   .0013613     4.90   0.000     .0039377    .0094036
       itd448 |          0  (omitted)
       itd449 |  -1.39e-12   2.24e-12    -0.62   0.538    -5.89e-12    3.11e-12
       itd450 |  -1.39e-12   2.24e-12    -0.62   0.538    -5.89e-12    3.11e-12
       itd451 |          0  (omitted)
       itd452 |  -1.39e-12   2.24e-12    -0.62   0.538    -5.89e-12    3.11e-12
       itd453 |  -1.39e-12   2.24e-12    -0.62   0.538    -5.89e-12    3.11e-12
       itd454 |  -1.39e-12   2.24e-12    -0.62   0.538    -5.89e-12    3.11e-12
       itd455 |  -1.39e-12   2.24e-12    -0.62   0.538    -5.89e-12    3.11e-12
       itd456 |  -1.39e-12   2.24e-12    -0.62   0.538    -5.89e-12    3.11e-12
       itd457 |  -1.39e-12   2.24e-12    -0.62   0.538    -5.89e-12    3.11e-12
       itd458 |  -1.39e-12   2.24e-12    -0.62   0.538    -5.89e-12    3.11e-12
       itd459 |  -1.39e-12   2.24e-12    -0.62   0.538    -5.89e-12    3.11e-12
       itd460 |  -1.39e-12   2.24e-12    -0.62   0.538    -5.89e-12    3.11e-12
       itd461 |  -1.39e-12   2.24e-12    -0.62   0.538    -5.89e-12    3.11e-12
       itd462 |  -1.39e-12   2.24e-12    -0.62   0.538    -5.89e-12    3.11e-12
       itd463 |  -.0286301   .0003997   -71.63   0.000    -.0294325   -.0278277
       itd464 |   .0829687    .000171   485.20   0.000     .0826254     .083312
       itd465 |          0  (omitted)
       itd466 |   .3606022   .0002386  1511.05   0.000     .3601231    .3610813
       itd467 |   .4703462   .0008798   534.63   0.000       .46858    .4721124
       itd468 |   .1937631   .0003195   606.48   0.000     .1931217    .1944045
       itd469 |   .3044907   .0004993   609.78   0.000     .3034882    .3054932
       itd470 |   .0243041   .0016289    14.92   0.000     .0210339    .0275744
       itd471 |   .1085565    .001198    90.62   0.000     .1061515    .1109615
       itd472 |   .1082248   .0013535    79.96   0.000     .1055075    .1109421
       itd473 |   .1630792   .0016823    96.94   0.000     .1597017    .1664566
       itd474 |   .0770537   .0029448    26.17   0.000     .0711419    .0829656
       itd475 |   .0240746   .0017366    13.86   0.000     .0205883    .0275609
       itd476 |  -.0051704   .0024246    -2.13   0.038     -.010038   -.0003028
       itd477 |     .00925   .0075657     1.22   0.227    -.0059388    .0244387
       itd478 |  -.0019742   .0089176    -0.22   0.826     -.019877    .0159286
       itd479 |   .0261969   .0090351     2.90   0.006     .0080583    .0443356
       itd480 |   .0774295   .0082334     9.40   0.000     .0609003    .0939587
       itd481 |   .0090178   .0088915     1.01   0.315    -.0088325    .0268682
       itd482 |  -.0019693   .0089396    -0.22   0.827    -.0199163    .0159778
       itd483 |   .0298185   .0084171     3.54   0.001     .0129204    .0467166
       itd484 |   .0122407   .0059878     2.04   0.046     .0002197    .0242617
       itd485 |  -.0272398   .0049776    -5.47   0.000    -.0372326   -.0172469
       itd486 |   .0037554   .0012793     2.94   0.005     .0011872    .0063237
       itd487 |    .024359   .0007398    32.93   0.000     .0228738    .0258442
       itd488 |   .0366227   .0012906    28.38   0.000     .0340317    .0392138
       itd489 |   .0136316   .0023489     5.80   0.000      .008916    .0183473
       itd490 |          0  (omitted)
       itd491 |   .0393349   .0016296    24.14   0.000     .0360634    .0426063
       itd492 |   .0474008   .0018697    25.35   0.000     .0436473    .0511543
       itd493 |  -.0094189   .0020272    -4.65   0.000    -.0134887   -.0053491
       itd494 |  -.0024341   .0018353    -1.33   0.191    -.0061186    .0012504
       itd495 |  -.0135743    .001356   -10.01   0.000    -.0162966    -.010852
       itd496 |   .0392264     .00159    24.67   0.000     .0360343    .0424185
       itd497 |  -.0210643   .0013568   -15.53   0.000    -.0237882   -.0183405
       itd498 |    .004188   .0005069     8.26   0.000     .0031703    .0052057
       itd499 |  -.0176073   .0007489   -23.51   0.000    -.0191108   -.0161039
       itd500 |  -.0237051   .0003101   -76.44   0.000    -.0243277   -.0230826
       itd501 |          0  (omitted)
       itd502 |   .0225725   .0010807    20.89   0.000     .0204028    .0247422
       itd503 |   -.000719    .000432    -1.66   0.102    -.0015862    .0001483
       itd504 |  -.0199269   .0011466   -17.38   0.000    -.0222289    -.017625
       itd505 |  -.5770389   .0052501  -109.91   0.000     -.587579   -.5664988
       itd506 |  -.4576528   .0052171   -87.72   0.000    -.4681265   -.4471791
       itd507 |  -.4444565   .0054788   -81.12   0.000    -.4554557   -.4334573
       itd508 |  -.6054567   .0053068  -114.09   0.000    -.6161104   -.5948029
       itd509 |  -.5599868   .0050717  -110.41   0.000    -.5701686    -.549805
       itd510 |  -.4257107   .0048341   -88.06   0.000    -.4354156   -.4160058
       itd511 |  -.3541801   .0046207   -76.65   0.000    -.3634566   -.3449037
       itd512 |   -.223849   .0043357   -51.63   0.000    -.2325533   -.2151446
       itd513 |    -.31924   .0031826  -100.31   0.000    -.3256293   -.3128506
       itd514 |  -.5650724   .0025365  -222.77   0.000    -.5701647   -.5599801
       itd515 |  -.6472714   .0013296  -486.80   0.000    -.6499407    -.644602
       itd516 |  -.4805013   .0007067  -679.88   0.000    -.4819201   -.4790825
       itd517 |  -.3166192   .0015834  -199.96   0.000     -.319798   -.3134404
       itd518 |          0  (omitted)
       itd519 |          0  (omitted)
       itd520 |  -1.249053   .0004439 -2813.57   0.000    -1.249945   -1.248162
       itd521 |  -2.636411    .000699 -3771.91   0.000    -2.637814   -2.635008
       itd522 |  -2.065142   .0007739 -2668.36   0.000    -2.066696   -2.063589
       itd523 |  -.3345973   .0005927  -564.50   0.000    -.3357873   -.3334073
       itd524 |  -1.780727   .0013828 -1287.77   0.000    -1.783503    -1.77795
       itd525 |  -3.067173    .001726 -1777.04   0.000    -3.070638   -3.063708
       itd526 |  -2.503836   .0017989 -1391.90   0.000    -2.507447   -2.500225
       itd527 |  -2.337674   .0020356 -1148.37   0.000    -2.341761   -2.333588
       itd528 |  -2.340322   .0032771  -714.14   0.000    -2.346901   -2.333743
       itd529 |  -.8410781   .0036319  -231.58   0.000    -.8483693   -.8337868
       itd530 |  -2.509126   .0042795  -586.32   0.000    -2.517717   -2.500534
       itd531 |  -1.787766   .0046838  -381.69   0.000    -1.797169   -1.778363
       itd532 |  -1.360769   .0054222  -250.96   0.000    -1.371654   -1.349883
       itd533 |  -.0541024   .0003067  -176.39   0.000    -.0547181   -.0534866
       itd534 |  -.1009801   .0004017  -251.39   0.000    -.1017865   -.1001737
       itd535 |  -.1020474   .0004461  -228.77   0.000    -.1029429   -.1011518
       itd536 |  -.0644259    .000418  -154.13   0.000    -.0652651   -.0635867
       itd537 |    -.09714   .0003872  -250.85   0.000    -.0979175   -.0963626
       itd538 |  -.0459538   .0001905  -241.21   0.000    -.0463363   -.0455714
       itd539 |   -.103005   .0000616 -1671.97   0.000    -.1031287   -.1028813
       itd540 |          0  (omitted)
       itd541 |  -.0644794   .0000764  -844.46   0.000    -.0646327   -.0643261
       itd542 |  -.0501595   .0004747  -105.66   0.000    -.0511125   -.0492065
       itd543 |  -.0952015   .0005885  -161.76   0.000    -.0963831     -.09402
       itd544 |  -.0177663   .0007979   -22.27   0.000    -.0193682   -.0161644
       itd545 |   .0010414   .0010468     0.99   0.324    -.0010601    .0031429
       itd546 |   .0089785    .001322     6.79   0.000     .0063244    .0116326
       itd547 |  -.2309489    .000376  -614.26   0.000    -.2317037   -.2301941
       itd548 |  -.4847197    .000204 -2375.92   0.000    -.4851292   -.4843101
       itd549 |   -.442571   .0001323 -3346.39   0.000    -.4428365   -.4423055
       itd550 |          0  (omitted)
       itd551 |  -.4705424   .0001012 -4650.54   0.000    -.4707455   -.4703393
       itd552 |  -.4554676   .0007937  -573.88   0.000    -.4570609   -.4538743
       itd553 |   -.642519   .0006752  -951.65   0.000    -.6438744   -.6411635
       itd554 |  -.6855597   .0009241  -741.90   0.000    -.6874148   -.6837045
       itd555 |  -.6582647   .0011992  -548.94   0.000    -.6606722   -.6558573
       itd556 |  -.5368659   .0029324  -183.08   0.000    -.5427529   -.5309789
       itd557 |  -.6287704   .0055951  -112.38   0.000    -.6400031   -.6175377
       itd558 |  -.6110165   .0145972   -41.86   0.000    -.6403216   -.5817115
       itd559 |  -.6140004   .0102856   -59.70   0.000    -.6346495   -.5933513
       itd560 |  -.5326049   .0112643   -47.28   0.000     -.555219   -.5099908
       itd561 |  -3.073581   .0016765 -1833.28   0.000    -3.076947   -3.070216
       itd562 |          0  (omitted)
       itd563 |  -3.024613   .0006908 -4378.51   0.000       -3.026   -3.023226
       itd564 |  -1.071225   .0027407  -390.85   0.000    -1.076728   -1.065723
       itd565 |  -2.970916   .0036082  -823.38   0.000    -2.978159   -2.963672
       itd566 |  -5.681847   .0023737 -2393.71   0.000    -5.686613   -5.677082
       itd567 |  -5.146093   .0023387 -2200.40   0.000    -5.150788   -5.141397
       itd568 |  -5.510486   .0049486 -1113.54   0.000    -5.520421   -5.500551
       itd569 |  -5.667547   .0096751  -585.79   0.000    -5.686971   -5.648124
       itd570 |  -5.825043   .0153259  -380.08   0.000    -5.855811   -5.794275
       itd571 |  -5.762652   .0180245  -319.71   0.000    -5.798837   -5.726466
       itd572 |  -5.475427   .0171764  -318.78   0.000     -5.50991   -5.440944
       itd573 |  -5.636651   .0064253  -877.26   0.000     -5.64955   -5.623752
       itd574 |  -5.504008   .0144552  -380.76   0.000    -5.533028   -5.474988
       itd575 |   -1.03277   2.41e-13 -4.3e+12   0.000     -1.03277    -1.03277
       itd576 |  -1.014992   2.42e-13 -4.2e+12   0.000    -1.014992   -1.014992
       itd577 |  -.9183604   2.19e-13 -4.2e+12   0.000    -.9183604   -.9183604
       itd578 |  -.8154088   3.46e-13 -2.4e+12   0.000    -.8154088   -.8154088
       itd579 |  -.9627302   3.54e-13 -2.7e+12   0.000    -.9627302   -.9627302
       itd580 |  -.9004232   2.20e-13 -4.1e+12   0.000    -.9004232   -.9004232
       itd581 |  -.8823731   3.51e-13 -2.5e+12   0.000    -.8823731   -.8823731
       itd582 |  -.6788911   3.93e-13 -1.7e+12   0.000    -.6788911   -.6788911
       itd583 |  -1.117214   2.41e-13 -4.6e+12   0.000    -1.117214   -1.117214
       itd584 |  -.3813643   2.38e-13 -1.6e+12   0.000    -.3813643   -.3813643
       itd585 |  -.4471877   1.93e-13 -2.3e+12   0.000    -.4471877   -.4471877
       itd586 |  -.4311381   2.40e-13 -1.8e+12   0.000    -.4311381   -.4311381
       itd587 |  -.0321564   3.03e-13 -1.1e+11   0.000    -.0321564   -.0321564
       itd588 |          0  (omitted)
       itd589 |  -3.01e-12   3.52e-12    -0.86   0.396    -1.01e-11    4.05e-12
       itd590 |  -3.01e-12   3.52e-12    -0.86   0.396    -1.01e-11    4.05e-12
       itd591 |  -3.06e-12   3.56e-12    -0.86   0.394    -1.02e-11    4.09e-12
       itd592 |  -3.06e-12   3.56e-12    -0.86   0.394    -1.02e-11    4.09e-12
       itd593 |  -3.06e-12   3.56e-12    -0.86   0.394    -1.02e-11    4.09e-12
       itd594 |          0  (omitted)
       itd595 |  -3.06e-12   3.56e-12    -0.86   0.394    -1.02e-11    4.09e-12
       itd596 |  -3.06e-12   3.56e-12    -0.86   0.394    -1.02e-11    4.09e-12
       itd597 |  -3.06e-12   3.56e-12    -0.86   0.394    -1.02e-11    4.09e-12
       itd598 |  -3.06e-12   3.56e-12    -0.86   0.394    -1.02e-11    4.09e-12
       itd599 |  -3.07e-12   3.56e-12    -0.86   0.394    -1.02e-11    4.09e-12
       itd600 |  -3.07e-12   3.56e-12    -0.86   0.394    -1.02e-11    4.09e-12
       itd601 |  -3.07e-12   3.56e-12    -0.86   0.394    -1.02e-11    4.09e-12
       itd602 |  -3.06e-12   3.56e-12    -0.86   0.394    -1.02e-11    4.09e-12
       itd603 |   1.230781   .0053201   231.34   0.000       1.2201    1.241461
       itd604 |   1.241778   .0022761   545.57   0.000     1.237208    1.246347
       itd605 |          0  (omitted)
       itd606 |   1.488525   .0031765   468.60   0.000     1.482148    1.494902
       itd607 |  -.0423037   .0117103    -3.61   0.001    -.0658131   -.0187943
       itd608 |   .7346373   .0042526   172.75   0.000     .7260997    .7431748
       itd609 |   1.475989   .0066467   222.06   0.000     1.462645    1.489332
       itd610 |  -.0783286   .0216825    -3.61   0.001     -.121858   -.0347991
       itd611 |   .6923952   .0159459    43.42   0.000     .6603825    .7244078
       itd612 |   .6849151   .0180164    38.02   0.000     .6487456    .7210847
       itd613 |  -.0808959   .0223932    -3.61   0.001    -.1258521   -.0359397
       itd614 |   2.108399   .0391971    53.79   0.000     2.029708    2.187091
       itd615 |  -.3335043   .0231152   -14.43   0.000    -.3799101   -.2870986
       itd616 |    .883412   .0322733    27.37   0.000     .8186207    .9482033
       itd617 |   -.088345   1.01e-12 -8.7e+10   0.000     -.088345    -.088345
       itd618 |  -.1069496   1.00e-12 -1.1e+11   0.000    -.1069496   -.1069496
       itd619 |  -.0976473   1.00e-12 -9.8e+10   0.000    -.0976473   -.0976473
       itd620 |  -.0929962   1.00e-12 -9.3e+10   0.000    -.0929962   -.0929962
       itd621 |  -.1046241   1.00e-12 -1.0e+11   0.000    -.1046241   -.1046241
       itd622 |  -.0929962   1.00e-12 -9.3e+10   0.000    -.0929962   -.0929962
       itd623 |  -.0813682   1.00e-12 -8.1e+10   0.000    -.0813682   -.0813682
       itd624 |  -.0278799   1.02e-12 -2.7e+10   0.000    -.0278799   -.0278799
       itd625 |  -.0627636   1.05e-12 -6.0e+10   0.000    -.0627636   -.0627636
       itd626 |   .0652681   7.49e-13  8.7e+10   0.000     .0652681    .0652681
       itd627 |   .0651434   1.00e-12  6.5e+10   0.000     .0651434    .0651434
       itd628 |          0  (omitted)
       itd629 |  -.0767171   1.03e-12 -7.4e+10   0.000    -.0767171   -.0767171
       itd630 |  -.0929962   1.00e-12 -9.3e+10   0.000    -.0929962   -.0929962
       itd631 |   .2593407   .0015885   163.26   0.000     .2561516    .2625299
       itd632 |   .2576906    .001157   222.73   0.000     .2553679    .2600133
       itd633 |  -.0763951   .0009608   -79.51   0.000    -.0783241   -.0744661
       itd634 |  -.0213388   .0008317   -25.66   0.000    -.0230085   -.0196691
       itd635 |  -.0216706   .0007583   -28.58   0.000    -.0231931   -.0201482
       itd636 |  -.0223365   .0008294   -26.93   0.000    -.0240015   -.0206714
       itd637 |  -.0757597   .0013082   -57.91   0.000    -.0783861   -.0731333
       itd638 |  -.0762039   .0013066   -58.32   0.000    -.0788271   -.0735807
       itd639 |          0  (omitted)
       itd640 |   -.191054   .0021093   -90.58   0.000    -.1952886   -.1868195
       itd641 |  -.2013999    .004226   -47.66   0.000    -.2098839   -.1929159
       itd642 |  -.1267811   .0140779    -9.01   0.000    -.1550435   -.0985186
       itd643 |  -.0501685   .0087268    -5.75   0.000    -.0676884   -.0326486
       itd644 |  -.0212663   .0099727    -2.13   0.038    -.0412872   -.0012453
       itd645 |   .1002256   .0187341     5.35   0.000     .0626154    .1378358
       itd646 |   .0676398   .0185507     3.65   0.001     .0303977    .1048819
       itd647 |   .0839521   .0186649     4.50   0.000     .0464807    .1214235
       itd648 |   .0981341   .0179701     5.46   0.000     .0620576    .1342107
       itd649 |   .1147717   .0180764     6.35   0.000     .0784817    .1510616
       itd650 |   .1651989   .0187766     8.80   0.000     .1275033    .2028944
       itd651 |   .1182459   .0192719     6.14   0.000     .0795559    .1569359
       itd652 |   .1147984   .0180549     6.36   0.000     .0785517    .1510451
       itd653 |   .2003527   .0139666    14.35   0.000     .1723136    .2283918
       itd654 |    .028482   .0103955     2.74   0.008     .0076123    .0493518
       itd655 |   .0153736   .0055811     2.75   0.008     .0041691    .0265782
       itd656 |          0  (omitted)
       itd657 |   .0394809   .0084205     4.69   0.000     .0225761    .0563857
       itd658 |   .3179785    .004095    77.65   0.000     .3097574    .3261996
       itd659 |  -.0452817   .0012729   -35.58   0.000    -.0478371   -.0427264
       itd660 |  -.0648261   .0015886   -40.81   0.000    -.0680154   -.0616368
       itd661 |  -.0474155   .0017362   -27.31   0.000    -.0509011     -.04393
       itd662 |  -.0068545   .0016429    -4.17   0.000    -.0101527   -.0035563
       itd663 |   .0404791   .0015385    26.31   0.000     .0373904    .0435678
       itd664 |  -.0123291    .000885   -13.93   0.000    -.0141059   -.0105524
       itd665 |  -.0645182   .0004578  -140.92   0.000    -.0654373    -.063599
       itd666 |   .0369588   .0002517   146.82   0.000     .0364534    .0374642
       itd667 |          0  (omitted)
       itd668 |  -.0149748   .0013254   -11.30   0.000    -.0176357   -.0123139
       itd669 |  -.0670305   .0017039   -39.34   0.000    -.0704512   -.0636099
       itd670 |    .012712   .0023948     5.31   0.000     .0079042    .0175197
       itd671 |  -.0677871   .0032238   -21.03   0.000    -.0742591   -.0613151
       itd672 |  -.0839067   .0041428   -20.25   0.000    -.0922238   -.0755897
       itd673 |  -1.224788   1.33e-12 -9.2e+11   0.000    -1.224788   -1.224788
       itd674 |  -.5051257   1.27e-12 -4.0e+11   0.000    -.5051257   -.5051257
       itd675 |  -.7772776   1.27e-12 -6.1e+11   0.000    -.7772776   -.7772776
       itd676 |  -1.089653   1.33e-12 -8.2e+11   0.000    -1.089653   -1.089653
       itd677 |  -.7103506   1.26e-12 -5.6e+11   0.000    -.7103506   -.7103506
       itd678 |     -.2172   1.26e-12 -1.7e+11   0.000       -.2172      -.2172
       itd679 |  -.5028775   1.17e-12 -4.3e+11   0.000    -.5028775   -.5028775
       itd680 |          0  (omitted)
       itd681 |   .0519934   1.21e-12  4.3e+10   0.000     .0519934    .0519934
       itd682 |  -.6977608   1.49e-12 -4.7e+11   0.000    -.6977608   -.6977608
       itd683 |   -1.10652   1.33e-12 -8.3e+11   0.000     -1.10652    -1.10652
       itd684 |   -1.01063   1.33e-12 -7.6e+11   0.000     -1.01063    -1.01063
       itd685 |   -.627068   1.31e-12 -4.8e+11   0.000     -.627068    -.627068
       itd686 |  -.9695338   1.33e-12 -7.3e+11   0.000    -.9695338   -.9695338
       itd687 |   .0167729   .0170455     0.98   0.330    -.0174475    .0509932
       itd688 |   .0015303    .018196     0.08   0.933    -.0349997    .0380604
       itd689 |   .0290517   .0188826     1.54   0.130    -.0088567      .06696
       itd690 |   .0221498   .0169141     1.31   0.196    -.0118068    .0561063
       itd691 |  -.0054186   .0147123    -0.37   0.714    -.0349548    .0241175
       itd692 |   .0665085   .0160948     4.13   0.000     .0341968    .0988201
       itd693 |  -.0099931   .0146907    -0.68   0.499     -.039486    .0194998
       itd694 |  -.0083518   .0100582    -0.83   0.410    -.0285445    .0118409
       itd695 |   .1121802    .010232    10.96   0.000     .0916385    .1327219
       itd696 |   .0097293   .0071906     1.35   0.182    -.0047065     .024165
       itd697 |   .0739481   .0048739    15.17   0.000     .0641634    .0837329
       itd698 |          0  (omitted)
       itd699 |   .0786678   .0048319    16.28   0.000     .0689673    .0883682
       itd700 |  -.0023057   .0004897    -4.71   0.000    -.0032888   -.0013227
       itd701 |  -.0890421   .0079716   -11.17   0.000    -.1050458   -.0730384
       itd702 |  -.0714821   .0098717    -7.24   0.000    -.0913003   -.0516639
       itd703 |   -.086592   .0101706    -8.51   0.000    -.1070104   -.0661736
       itd704 |  -.0580918   .0090203    -6.44   0.000    -.0762007   -.0399828
       itd705 |   .0106152   .0092704     1.15   0.258    -.0079958    .0292262
       itd706 |  -.0815595   .0092875    -8.78   0.000    -.1002049    -.062914
       itd707 |   -.071807   .0087052    -8.25   0.000    -.0892833   -.0543306
       itd708 |  -.0687085    .005615   -12.24   0.000    -.0799812   -.0574358
       itd709 |  -.0007353   .0043183    -0.17   0.865    -.0094046    .0079341
       itd710 |  -.0130902   .0002925   -44.75   0.000    -.0136774    -.012503
       itd711 |          0  (omitted)
       itd712 |  -.0950927   .0001395  -681.44   0.000    -.0953729   -.0948126
       itd713 |  -.0326548   .0015278   -21.37   0.000    -.0357219   -.0295877
       itd714 |  -.0719044    .001319   -54.51   0.000    -.0745524   -.0692565
       itd715 |   -1.64118   .0243778   -67.32   0.000     -1.69012    -1.59224
       itd716 |  -1.314805   .0266155   -49.40   0.000    -1.368238   -1.261372
       itd717 |  -1.536709   .0268564   -57.22   0.000    -1.590626   -1.482793
       itd718 |  -.3477815   .0238542   -14.58   0.000    -.3956709   -.2998922
       itd719 |  -.4532174   .0230277   -19.68   0.000    -.4994475   -.4069873
       itd720 |   .7380415     .02131    34.63   0.000     .6952599    .7808231
       itd721 |  -1.035596   .0187089   -55.35   0.000    -1.073155    -.998036
       itd722 |  -.8454512   .0148923   -56.77   0.000    -.8753487   -.8155537
       itd723 |  -.8840441   .0140405   -62.96   0.000    -.9122315   -.8558566
       itd724 |  -1.175335   .0070146  -167.55   0.000    -1.189418   -1.161253
       itd725 |  -1.150383   .0042525  -270.52   0.000     -1.15892   -1.141846
       itd726 |          0  (omitted)
       itd727 |  -.9214489   .0011345  -812.24   0.000    -.9237264   -.9191714
       itd728 |  -.4757207   .0051417   -92.52   0.000    -.4860432   -.4653983
        _cons |   .1196112   .0505483     2.37   0.022     .0181313    .2210912
--------------+----------------------------------------------------------------
      sigma_u |  .83768757
      sigma_e |  .68648119
          rho |  .59823896   (fraction of variance due to u_i)
-------------------------------------------------------------------------------

. 
. keep if  condition_around == 1 /* prediction only on minerals with reliable prices */
(5,020 observations deleted)

. *
. cap drop benchLPM_nb

. predict  benchLPM_nb 
(option xb assumed; fitted values)
(231 missing values generated)

. sum benchLPM_nb, d

                      Linear prediction
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.9131587      -5.470302
 5%    -.4822031      -5.470302
10%    -.2030811      -5.470302       Obs             139,024
25%     .0244097      -5.470302       Sum of Wgt.     139,024

50%     .1113331                      Mean           .1443204
                        Largest       Std. Dev.      .5577784
75%     .1458082       5.066959
90%      .566497       5.066959       Variance       .3111168
95%     1.019714       5.097856       Skewness       1.207052
99%     2.098323       5.581021       Kurtosis        34.3052

. *
. tsset cell year
       panel variable:  cell (unbalanced)
        time variable:  year, 1997 to 2010, but with gaps
                delta:  1 unit

. 
. /* counterfactual: put all prices to their 97 level */
. sort  mainmineral 

. merge mainmineral using  "$Output_data\tempzz", nokeep
(note: you are using old merge syntax; see [D] merge for new syntax)
variable mainmineral does not uniquely identify observations in the master data

. tab  _merge

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    137,123       98.47       98.47
          3 |      2,132        1.53      100.00
------------+-----------------------------------
      Total |    139,255      100.00

. drop _merge

. *
. rename mainmineral_around mainmineral_a

. sort  mainmineral_a

. merge mainmineral_a using "$Output_data\tempyy", nokeep
(note: you are using old merge syntax; see [D] merge for new syntax)
variable mainmineral_a does not uniquely identify observations in the master data

. tab  _merge

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    118,782       85.30       85.30
          3 |     20,473       14.70      100.00
------------+-----------------------------------
      Total |    139,255      100.00

. drop _merge

. *
. replace main_lprice         = main_lprice97   if main_lprice   != 0
(2,328 real changes made, 434 to missing)

. replace main_lprice_a       = main_lprice_a97 if main_lprice_a != 0
(21,559 real changes made, 2,554 to missing)

. *
. cap drop counterLPM_nb

. predict counterLPM_nb
(option xb assumed; fitted values)
(2,873 missing values generated)

. sum counterLPM_nb, d

                      Linear prediction
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.9131587      -5.514341
 5%    -.4822031      -5.514341
10%    -.2149861      -5.514341       Obs             136,382
25%     .0240411      -5.514341       Sum of Wgt.     136,382

50%     .1101923                      Mean           .1330939
                        Largest       Std. Dev.      .5434385
75%     .1367956       4.971861
90%     .5498174       4.971861       Variance       .2953254
95%     1.005938       4.981688       Skewness       .9695602
99%      1.96773        5.57637       Kurtosis       36.22466

. 
. /* how many events did not happen? */
. g diff = benchLPM_nb-counterLPM_nb
(2,873 missing values generated)

. sum diff, d

                            diff
-------------------------------------------------------------
      Percentiles      Smallest
 1%     -.012446      -.0888023
 5%            0      -.0863678
10%            0      -.0840507       Obs             136,382
25%            0      -.0749114       Sum of Wgt.     136,382

50%            0                      Mean           .0037869
                        Largest       Std. Dev.      .0201641
75%            0       .4267838
90%            0       .4499196       Variance       .0004066
95%     .0311598       .4644488       Skewness       8.634811
99%     .0689902       .4916593       Kurtosis       107.1573

. /* drop 1997 (no change by definition) */
. drop if year == 1997
(9,957 observations deleted)

. /* keep if comparison can be made */
. replace counterLPM_nb = . if benchLPM_nb   ==.
(0 real changes made)

. replace benchLPM_nb   = . if counterLPM_nb ==.
(2,453 real changes made, 2,453 to missing)

. replace nb_acled      = . if counterLPM_nb ==.
(2,667 real changes made, 2,667 to missing)

. drop if counterLPM_nb == . | benchLPM_nb  == . | nb_acled == .
(2,667 observations deleted)

. 
. save "$Output_data\tempzz", replace
file Data_Code_BCRT_AER\Data\tempzz.dta saved

. 
. ********************************************
. * country level effect for map (Figure A8) *
. ********************************************
. 
. use "$Output_data\tempzz", clear

. /* sum events by year and country */
. collapse (sum) nb_acled diff counterLPM_nb benchLPM_nb, by(iso_1 year)

. /* sum events by country over the period */ 
. collapse (sum) nb_acled diff counterLPM_nb benchLPM_nb, by(iso_1)

. g share1 = diff/nb_acled 
(4 missing values generated)

. g share2 = diff/benchLPM_nb 

. 
. sum, d 

                          Iso code
-------------------------------------------------------------
no observations

                       (sum) nb_acled
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            8              0       Obs                  51
25%           41              0       Sum of Wgt.          51

50%          161                      Mean           361.0196
                        Largest       Std. Dev.      484.2297
75%          402           1402
90%         1097           1494       Variance       234478.4
95%         1494           1501       Skewness       1.854569
99%         2134           2134       Kurtosis       5.842144

                         (sum) diff
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs                  51
25%            0              0       Sum of Wgt.          51

50%     2.701393                      Mean           10.12666
                        Largest       Std. Dev.      13.80319
75%     17.78672       31.94198
90%      24.9085       33.51815       Variance       190.5281
95%     33.51815        55.7175       Skewness       1.688684
99%     57.64123       57.64123       Kurtosis       5.879892

                     (sum) counterLPM_nb
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -1570.963      -1570.963
 5%    -1387.235      -1441.155
10%    -482.9403      -1387.235       Obs                  51
25%     1.554946      -787.1435       Sum of Wgt.          51

50%     137.5001                      Mean           334.4207
                        Largest       Std. Dev.      779.8657
75%     900.1872       1321.505
90%     1144.761       1775.317       Variance       608190.4
95%     1775.317       2106.683       Skewness      -.0817386
99%     2142.604       2142.604       Kurtosis       3.512412

                      (sum) benchLPM_nb
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -1570.963      -1570.963
 5%    -1381.108      -1440.692
10%    -482.9403      -1381.108       Obs                  51
25%     1.554946      -769.1208       Sum of Wgt.          51

50%     137.5001                      Mean           344.5474
                        Largest       Std. Dev.      789.0593
75%     900.1872       1335.012
90%     1161.842       1801.198       Variance       622614.6
95%     1801.198         2162.4       Skewness      -.0515604
99%     2174.546       2174.546       Kurtosis        3.48919

                           share1
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs                  47
25%            0              0       Sum of Wgt.          47

50%     .0157067                      Mean            .136313
                        Largest       Std. Dev.      .4378016
75%     .0700055       .3009403
90%     .2935264       .3420523       Variance       .1916702
95%     .3420523       .8898907       Skewness       5.596906
99%     2.894899       2.894899       Kurtosis       35.21431

                           share2
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.2206948      -.2206948
 5%    -.0234328      -.0761184
10%    -.0018553      -.0234328       Obs                  51
25%            0      -.0075813       Sum of Wgt.          51

50%            0                      Mean            .003943
                        Largest       Std. Dev.      .0372034
75%     .0186451       .0354489
90%      .026912       .0368526       Variance       .0013841
95%     .0368526       .0425446       Skewness      -4.525081
99%     .0523411       .0523411       Kurtosis       27.68712

. 
. rename iso_1 ISO3

. sort ISO3

. keep ISO3 diff nb_acled share1

. save "$Output_data\Figure_A8", replace
(note: file Data_Code_BCRT_AER\Data\Figure_A8.dta not found)
file Data_Code_BCRT_AER\Data\Figure_A8.dta saved

. 
. use "$Output_data\BCRT_baseline", replace

. replace main_lprice = . if main_lprice == 0
(141,470 real changes made, 141,470 to missing)

. collapse (mean) main_lprice mines, by(iso_1)

. g noprice = (mines>0 & main_lprice == .)

. *
. rename iso_1 ISO3

. sort ISO3

. merge ISO3 using "$Output_data\Figure_A8", nokeep
(note: you are using old merge syntax; see [D] merge for new syntax)

. tab _merge

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          1        1.92        1.92
          3 |         51       98.08      100.00
------------+-----------------------------------
      Total |         52      100.00

. drop _merge

. *
. rename share1 share

. replace share = -1 if share == 0 & noprice == 1
(0 real changes made)

. drop noprice

. 
. g share_bin = .
(52 missing values generated)

. replace share_bin = 1 if share >= 0.000 & share < 0.01 & share != .
(21 real changes made)

. replace share_bin = 2 if share >= 0.010 & share < 0.050 & share != .
(9 real changes made)

. replace share_bin = 3 if share >= 0.050 & share < 0.200 & share != .
(11 real changes made)

. replace share_bin = 4 if share >= 0.200 & share < 0.500 & share != .
(4 real changes made)

. replace share_bin = 5 if share >= 0.500 & share != . 
(2 real changes made)

. replace share_bin = 0 if mines == 0 | nb_acled == . | nb_acled == 0/* no observation in estimation */
(23 real changes made)

. 
. sort ISO3

. save "$Output_data\Figure_A8", replace
file Data_Code_BCRT_AER\Data\Figure_A8.dta saved

. outsheet using "$Results\Figure_A8.csv", comma replace
(note: file Data_Code_BCRT_AER\results\Figure_A8.csv not found)

. 
. *************************
. * Bar chart (Figure 1B) *
. *************************
. 
. rename share increase

. drop if increase == 0 | increase == . | increase == -1
(19 observations deleted)

. replace increase = 1 if increase > 1
(1 real change made)

. 
. graph hbar (sum) increase, over(ISO3, sort(increase) label(labsize(small))) bar(1, color(black)) legend(off) bgcolor(white) graphregion(color(white)) intensity(40)   lintensity(100) ytitle(Share of events explained by increase in mineral prices)  

. graph export $Results\Figure_1B.eps, as(eps) replace
(note: file Data_Code_BCRT_AER\results\Figure_1B.eps not found)
(file Data_Code_BCRT_AER\results\Figure_1B.eps written in EPS format)

. 
. save "$Output_data\tempzz", replace
file Data_Code_BCRT_AER\Data\tempzz.dta saved

. 
. *****************************
. * aggregate quantifications *
. *****************************
. 
. /*get total number of observed events */
. /*(to be able to drop countries with less than 50 events in total sample)*/
. 
. use "$Output_data\BCRT_baseline", replace

. drop if year == 1997
(10,335 observations deleted)

. collapse (sum) nb_acled, by(iso_1)

. sort iso_1

. save "$Output_data\tempyy.dta", replace
file Data_Code_BCRT_AER\Data\tempyy.dta saved

. 
. use "$Output_data\tempzz", clear

. rename increase share

. drop if share == -1 | nb_acled == .
(0 observations deleted)

. g nomines = (diff == 0)

. collapse (sum) nb_acled diff, by(nomines)

. egen nb_acled_tot = sum(nb_acled)

. 
. * share of events in countries with mines 
. g share_events1 = diff/nb_acled if nomines == 0

. 
. ///// AGGREGATE QUANTIFICATIONS /////
> 
. /* how many events saved in Africa? */ 
. sum share_events1 if nomines == 0, d

                        share_events1
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0352894       .0352894
 5%     .0352894              .
10%     .0352894              .       Obs                   1
25%     .0352894              .       Sum of Wgt.           1

50%     .0352894                      Mean           .0352894
                        Largest       Std. Dev.             .
75%     .0352894              .
90%     .0352894              .       Variance              .
95%     .0352894              .       Skewness              .
99%     .0352894       .0352894       Kurtosis              .

. 
. /* how many on average across countries with mines ?*/
. use "$Output_data\tempzz", clear

. drop nb_acled

. rename ISO3 iso_1

. sort  iso_1

. merge iso_1 using "$Output_data\tempyy.dta", nokeep
(note: you are using old merge syntax; see [D] merge for new syntax)

. tab  _merge

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          3 |         33      100.00      100.00
------------+-----------------------------------
      Total |         33      100.00

. drop _merge

. 
. rename increase share

. drop if share == 0 | share == . | share == -1 
(0 observations deleted)

. replace share = 1 if share > 1
(0 real changes made)

. 
. /* how many on average across countries with mines? */
. egen mean = mean(share)

. di mean 
.13672151

. /* how many on average across countries with mines, excluding countries with <50 events ?*/
. drop mean 

. egen mean = mean(share) if nb_acled>=50
(4 missing values generated)

. di mean 
.07974137

. *
. erase  "$Output_data\tempzz.dta"

. erase  "$Output_data\tempyy.dta"

. erase  "$Output_data\Figure_A8.dta"

. 
. 
. * ------------------------------------------------------------------------------------------------- *
.                                         * D - Figures A5 and A6: cell-level quantifications *
. * ------------------------------------------------------------------------------------------------- *
. 
. *----------------------------*
. /* FIGURE A5 (Web appendix)*/
. *----------------------------*
. 
. // Specification used similar to column 4 of baseline Table 2, augmented with surrounding cells
. 
. /*get 97 mineral prices of the cell */
. use "$Output_data\BCRT_baseline", clear

. drop if main_lprice == . | main_lprice == 0
(141,470 observations deleted)

. keep if mines == 1
(780 observations deleted)

. collapse (mean) main_lprice, by(mainmineral year)

. keep if year == 1997
(180 observations deleted)

. rename main_lprice main_lprice97

. keep mainmineral main_lprice

. sort mainmineral

. save "$Output_data\tempzz", replace
(note: file Data_Code_BCRT_AER\Data\tempzz.dta not found)
file Data_Code_BCRT_AER\Data\tempzz.dta saved

. 
. /*get 97 mineral prices of the surrounding cells */
. use "$Output_data\BCRT_baseline", clear

. drop if main_lprice == . | main_lprice == 0
(141,470 observations deleted)

. keep if mines == 1
(780 observations deleted)

. collapse (mean) main_lprice, by(mainmineral year)

. keep if year == 1997
(180 observations deleted)

. rename main_lprice main_lprice_a97

. rename mainmineral mainmineral_a 

. keep mainmineral_a main_lprice_a97

. sort mainmineral_a

. save "$Output_data\tempyy", replace
(note: file Data_Code_BCRT_AER\Data\tempyy.dta not found)
file Data_Code_BCRT_AER\Data\tempyy.dta saved

. *
. use "$Output_data\BCRT_baseline", clear

. cap drop FEcell FEit

. qui tab it, gen(itd)

. 
. drop   main_lprice 

. rename main_lprice_hist0 main_lprice

. 
. g condition_around = (mainmineral != "diamond" & mainmineral_around != "diamond" & mainmineral != "tantalum" & mainmineral_around != "tantalum")

. 
. /*estimation*/
. xtreg acled  main_lprice main_lprice_a itd* if  condition_around == 1, fe cluster(country_nb)
note: itd3 omitted because of collinearity
note: itd28 omitted because of collinearity
note: itd40 omitted because of collinearity
note: itd56 omitted because of collinearity
note: itd58 omitted because of collinearity
note: itd84 omitted because of collinearity
note: itd87 omitted because of collinearity
note: itd109 omitted because of collinearity
note: itd126 omitted because of collinearity
note: itd140 omitted because of collinearity
note: itd149 omitted because of collinearity
note: itd158 omitted because of collinearity
note: itd169 omitted because of collinearity
note: itd185 omitted because of collinearity
note: itd199 omitted because of collinearity
note: itd220 omitted because of collinearity
note: itd238 omitted because of collinearity
note: itd247 omitted because of collinearity
note: itd266 omitted because of collinearity
note: itd269 omitted because of collinearity
note: itd289 omitted because of collinearity
note: itd296 omitted because of collinearity
note: itd322 omitted because of collinearity
note: itd336 omitted because of collinearity
note: itd350 omitted because of collinearity
note: itd364 omitted because of collinearity
note: itd376 omitted because of collinearity
note: itd384 omitted because of collinearity
note: itd396 omitted because of collinearity
note: itd409 omitted because of collinearity
note: itd434 omitted because of collinearity
note: itd448 omitted because of collinearity
note: itd450 omitted because of collinearity
note: itd474 omitted because of collinearity
note: itd490 omitted because of collinearity
note: itd504 omitted because of collinearity
note: itd518 omitted because of collinearity
note: itd521 omitted because of collinearity
note: itd546 omitted because of collinearity
note: itd558 omitted because of collinearity
note: itd563 omitted because of collinearity
note: itd577 omitted because of collinearity
note: itd590 omitted because of collinearity
note: itd614 omitted because of collinearity
note: itd630 omitted because of collinearity
note: itd642 omitted because of collinearity
note: itd651 omitted because of collinearity
note: itd661 omitted because of collinearity
note: itd674 omitted because of collinearity
note: itd698 omitted because of collinearity
note: itd703 omitted because of collinearity
note: itd728 omitted because of collinearity

Fixed-effects (within) regression               Number of obs      =    139426
Group variable: cell                            Number of groups   =      9959

R-sq:  within  = 0.0548                         Obs per group: min =        14
       between = 0.0005                                        avg =      14.0
       overall = 0.0053                                        max =        14

                                                F(2,51)            =         .
corr(u_i, Xb)  = -0.5989                        Prob > F           =         .

                             (Std. Err. adjusted for 52 clusters in country_nb)
-------------------------------------------------------------------------------
              |               Robust
        acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
  main_lprice |   .0387051   .0129674     2.98   0.004     .0126719    .0647383
main_lprice_a |   .0160679   .0061123     2.63   0.011     .0037969    .0283389
         itd1 |  -.0904372   9.96e-06 -9076.36   0.000    -.0904572   -.0904171
         itd2 |  -.0356189   9.49e-07 -3.8e+04   0.000    -.0356208    -.035617
         itd3 |          0  (omitted)
         itd4 |  -.0767265   5.41e-06 -1.4e+04   0.000    -.0767374   -.0767157
         itd5 |  -.1095956   2.49e-06 -4.4e+04   0.000    -.1096006   -.1095906
         itd6 |  -.2164444   2.29e-06 -9.4e+04   0.000     -.216449   -.2164398
         itd7 |  -.2383679   4.45e-06 -5.4e+04   0.000    -.2383768   -.2383589
         itd8 |  -.2438828   .0000179 -1.4e+04   0.000    -.2439188   -.2438468
         itd9 |  -.2411625   .0000253 -9524.17   0.000    -.2412133   -.2411116
        itd10 |  -.2357342   .0000448 -5263.08   0.000    -.2358241   -.2356443
        itd11 |  -.2329941   .0000447 -5215.92   0.000    -.2330838   -.2329045
        itd12 |  -.2384649   .0000414 -5764.17   0.000     -.238548   -.2383819
        itd13 |  -.2357047   .0000336 -7016.57   0.000    -.2357722   -.2356373
        itd14 |  -.2466943   .0000453 -5451.26   0.000    -.2467852   -.2466035
        itd15 |   .0017016   .0006473     2.63   0.011     .0004021    .0030012
        itd16 |  -.0891082   .0006851  -130.07   0.000    -.0904835   -.0877329
        itd17 |  -.0890619   .0007027  -126.74   0.000    -.0904726   -.0876511
        itd18 |   .0018179   .0006915     2.63   0.011     .0004296    .0032062
        itd19 |   .0017851   .0006791     2.63   0.011     .0004218    .0031484
        itd20 |   .0015798    .000601     2.63   0.011     .0003733    .0027863
        itd21 |   .0014456   .0005499     2.63   0.011     .0003416    .0025495
        itd22 |  -.3622556   .0005253  -689.66   0.000    -.3633101   -.3612011
        itd23 |  -.1805168   .0004951  -364.63   0.000    -.1815107   -.1795229
        itd24 |  -.1809329   .0003368  -537.29   0.000     -.181609   -.1802569
        itd25 |    -.36287   .0002915 -1244.76   0.000    -.3634553   -.3622848
        itd26 |  -.1812689   .0002089  -867.59   0.000    -.1816884   -.1808495
        itd27 |  -.0906203   .0001098  -824.95   0.000    -.0908409   -.0903998
        itd28 |          0  (omitted)
        itd29 |    .004482    .001705     2.63   0.011     .0010591    .0079048
        itd30 |   .0280666   .0016194    17.33   0.000     .0248155    .0313177
        itd31 |   .0041538   .0015801     2.63   0.011     .0009815     .007326
        itd32 |    .004123   .0015684     2.63   0.011     .0009743    .0072716
        itd33 |   .0279203   .0015638    17.85   0.000     .0247809    .0310597
        itd34 |   .0041739   .0015878     2.63   0.011     .0009863    .0073616
        itd35 |   .0044684   .0016998     2.63   0.011     .0010559    .0078808
        itd36 |   .0044652   .0016986     2.63   0.011     .0010551    .0078752
        itd37 |   .0044756   .0017026     2.63   0.011     .0010576    .0078936
        itd38 |   .0044073   .0016766     2.63   0.011     .0010415    .0077732
        itd39 |   .0034618   .0013169     2.63   0.011      .000818    .0061057
        itd40 |          0  (omitted)
        itd41 |   .0022395   .0008519     2.63   0.011     .0005292    .0039498
        itd42 |   .0022882   .0008705     2.63   0.011     .0005407    .0040358
        itd43 |   -.004085   .0055469    -0.74   0.465    -.0152208    .0070508
        itd44 |  -.0029828   .0058703    -0.51   0.614     -.014768    .0088023
        itd45 |   .0435093   .0060215     7.23   0.000     .0314207    .0555979
        itd46 |   .0316893   .0059259     5.35   0.000     .0197926     .043586
        itd47 |   .0083366    .005819     1.43   0.158    -.0033455    .0200188
        itd48 |   .0405383   .0051497     7.87   0.000     .0301999    .0508766
        itd49 |   .0045644   .0047121     0.97   0.337    -.0048956    .0140244
        itd50 |   .0153392    .004501     3.41   0.001     .0063031    .0243754
        itd51 |   -.008531   .0042423    -2.01   0.050    -.0170478   -.0000143
        itd52 |   .0098342   .0028857     3.41   0.001      .004041    .0156274
        itd53 |  -.0029811    .002498    -1.19   0.238    -.0079961    .0020339
        itd54 |     .02909   .0017904    16.25   0.000     .0254957    .0326843
        itd55 |  -.0082863   .0009413    -8.80   0.000    -.0101761   -.0063966
        itd56 |          0  (omitted)
        itd57 |  -.0008256   .0001998    -4.13   0.000    -.0012267   -.0004245
        itd58 |          0  (omitted)
        itd59 |   .0063343   .0000643    98.46   0.000     .0062052    .0064635
        itd60 |   .0052281    .000365    14.32   0.000     .0044954    .0059609
        itd61 |   .0052565   .0003972    13.23   0.000      .004459     .006054
        itd62 |   .0053915   .0003463    15.57   0.000     .0046962    .0060867
        itd63 |  -.0019725   .0005476    -3.60   0.001    -.0030718   -.0008732
        itd64 |  -.0034976   .0009595    -3.65   0.001    -.0054239   -.0015714
        itd65 |    .003179   .0009308     3.42   0.001     .0013104    .0050476
        itd66 |  -.0047849   .0012661    -3.78   0.000    -.0073267   -.0022432
        itd67 |   .0009319   .0015112     0.62   0.540    -.0021019    .0039658
        itd68 |   .0008865   .0016052     0.55   0.583    -.0023361     .004109
        itd69 |   .0090604   .0011723     7.73   0.000     .0067069    .0114139
        itd70 |  -.0056853   .0015851    -3.59   0.001    -.0088675   -.0025031
        itd71 |  -.0940594   2.64e-13 -3.6e+11   0.000    -.0940594   -.0940594
        itd72 |  -.0742574   2.64e-13 -2.8e+11   0.000    -.0742574   -.0742574
        itd73 |  -.0990099   2.64e-13 -3.8e+11   0.000    -.0990099   -.0990099
        itd74 |  -.0940594   2.64e-13 -3.6e+11   0.000    -.0940594   -.0940594
        itd75 |  -.0841584   2.64e-13 -3.2e+11   0.000    -.0841584   -.0841584
        itd76 |  -.0346535   2.65e-13 -1.3e+11   0.000    -.0346535   -.0346535
        itd77 |   -.049505   2.65e-13 -1.9e+11   0.000     -.049505    -.049505
        itd78 |  -.0693069   2.64e-13 -2.6e+11   0.000    -.0693069   -.0693069
        itd79 |  -.0643564   2.64e-13 -2.4e+11   0.000    -.0643564   -.0643564
        itd80 |  -.0346535   2.65e-13 -1.3e+11   0.000    -.0346535   -.0346535
        itd81 |   -.039604   2.65e-13 -1.5e+11   0.000     -.039604    -.039604
        itd82 |   -.019802   2.65e-13 -7.5e+10   0.000     -.019802    -.019802
        itd83 |  -.0346535   2.65e-13 -1.3e+11   0.000    -.0346535   -.0346535
        itd84 |          0  (omitted)
        itd85 |  -.1050307   .0003939  -266.61   0.000    -.1058216   -.1042398
        itd86 |  -.0758857   .0001306  -581.14   0.000    -.0761478   -.0756235
        itd87 |          0  (omitted)
        itd88 |  -.0474319   .0000827  -573.68   0.000    -.0475979   -.0472659
        itd89 |  -.0477286   .0001765  -270.36   0.000     -.048083   -.0473742
        itd90 |    .092014   .0007298   126.08   0.000     .0905488    .0934791
        itd91 |   .0908544   .0010932    83.11   0.000     .0886597    .0930491
        itd92 |  -.0323599   .0012736   -25.41   0.000    -.0349166   -.0298031
        itd93 |  -.0425552   .0015169   -28.05   0.000    -.0456006   -.0395098
        itd94 |  -.0650162   .0026428   -24.60   0.000    -.0703219   -.0597104
        itd95 |  -.1038545   .0029931   -34.70   0.000    -.1098633   -.0978456
        itd96 |  -.0585801   .0035884   -16.32   0.000    -.0657841   -.0513761
        itd97 |  -.1079037   .0042573   -25.35   0.000    -.1164506   -.0993568
        itd98 |   .0687668   .0050693    13.57   0.000     .0585899    .0789438
        itd99 |  -.0326797   4.44e-13 -7.4e+10   0.000    -.0326797   -.0326797
       itd100 |  -.0522876   4.44e-13 -1.2e+11   0.000    -.0522876   -.0522876
       itd101 |  -.0588235   4.44e-13 -1.3e+11   0.000    -.0588235   -.0588235
       itd102 |  -.0588235   4.45e-13 -1.3e+11   0.000    -.0588235   -.0588235
       itd103 |  -.0522876   4.44e-13 -1.2e+11   0.000    -.0522876   -.0522876
       itd104 |  -.0588235   4.45e-13 -1.3e+11   0.000    -.0588235   -.0588235
       itd105 |  -.0588235   4.45e-13 -1.3e+11   0.000    -.0588235   -.0588235
       itd106 |  -.0261438   4.46e-13 -5.9e+10   0.000    -.0261438   -.0261438
       itd107 |  -.0130719   4.45e-13 -2.9e+10   0.000    -.0130719   -.0130719
       itd108 |  -.0457516   4.80e-13 -9.5e+10   0.000    -.0457516   -.0457516
       itd109 |          0  (omitted)
       itd110 |  -.0326797   4.45e-13 -7.3e+10   0.000    -.0326797   -.0326797
       itd111 |  -.0261438   4.47e-13 -5.9e+10   0.000    -.0261438   -.0261438
       itd112 |  -.0457516   4.79e-13 -9.5e+10   0.000    -.0457516   -.0457516
       itd113 |   .0499953   .0008746    57.16   0.000     .0482394    .0517512
       itd114 |   .0409973   .0010534    38.92   0.000     .0388826     .043112
       itd115 |   .1155636    .001077   107.31   0.000     .1134016    .1177257
       itd116 |  -.0034392   .0009738    -3.53   0.001    -.0053941   -.0014843
       itd117 |   .0464029    .001023    45.36   0.000     .0443491    .0484567
       itd118 |   .0366788   .0009992    36.71   0.000     .0346727    .0386848
       itd119 |   -.018695   .0009418   -19.85   0.000    -.0205858   -.0168043
       itd120 |  -.0030928   .0006856    -4.51   0.000    -.0044692   -.0017165
       itd121 |   .0322315   .0005394    59.75   0.000     .0311485    .0333144
       itd122 |   .0224555    .000128   175.47   0.000     .0221986    .0227124
       itd123 |  -.0065494   .0001141   -57.41   0.000    -.0067785   -.0063204
       itd124 |   .0156585   .0001447   108.18   0.000     .0153679    .0159491
       itd125 |   .0588454   .0002526   232.93   0.000     .0583383    .0593526
       itd126 |          0  (omitted)
       itd127 |   .0550459   3.41e-13  1.6e+11   0.000     .0550459    .0550459
       itd128 |   .0642202   3.42e-13  1.9e+11   0.000     .0642202    .0642202
       itd129 |   .1834862   3.58e-13  5.1e+11   0.000     .1834862    .1834862
       itd130 |   .0275229   3.12e-13  8.8e+10   0.000     .0275229    .0275229
       itd131 |   2.14e-13   3.41e-13     0.63   0.533    -4.70e-13    8.98e-13
       itd132 |   .0458716   3.47e-13  1.3e+11   0.000     .0458716    .0458716
       itd133 |   .0091743   3.42e-13  2.7e+10   0.000     .0091743    .0091743
       itd134 |   2.14e-13   3.41e-13     0.63   0.533    -4.70e-13    8.98e-13
       itd135 |   .0275229   3.12e-13  8.8e+10   0.000     .0275229    .0275229
       itd136 |   2.20e-13   3.45e-13     0.64   0.525    -4.72e-13    9.13e-13
       itd137 |   2.20e-13   3.45e-13     0.64   0.526    -4.72e-13    9.13e-13
       itd138 |  -.0091743   3.42e-13 -2.7e+10   0.000    -.0091743   -.0091743
       itd139 |   2.19e-13   3.44e-13     0.64   0.527    -4.71e-13    9.09e-13
       itd140 |          0  (omitted)
       itd141 |   1.40e-12   1.52e-12     0.92   0.361    -1.65e-12    4.46e-12
       itd142 |   1.40e-12   1.52e-12     0.92   0.361    -1.65e-12    4.46e-12
       itd143 |   1.40e-12   1.52e-12     0.92   0.361    -1.65e-12    4.46e-12
       itd144 |   1.40e-12   1.52e-12     0.92   0.361    -1.65e-12    4.46e-12
       itd145 |   1.40e-12   1.52e-12     0.92   0.361    -1.65e-12    4.46e-12
       itd146 |   1.40e-12   1.52e-12     0.92   0.361    -1.65e-12    4.46e-12
       itd147 |   1.40e-12   1.52e-12     0.92   0.361    -1.65e-12    4.46e-12
       itd148 |   1.40e-12   1.52e-12     0.92   0.361    -1.65e-12    4.46e-12
       itd149 |          0  (omitted)
       itd150 |   1.40e-12   1.52e-12     0.92   0.361    -1.65e-12    4.46e-12
       itd151 |   1.40e-12   1.52e-12     0.92   0.361    -1.65e-12    4.46e-12
       itd152 |   1.40e-12   1.52e-12     0.92   0.361    -1.65e-12    4.46e-12
       itd153 |   1.40e-12   1.52e-12     0.92   0.361    -1.65e-12    4.46e-12
       itd154 |   1.40e-12   1.52e-12     0.92   0.361    -1.65e-12    4.46e-12
       itd155 |   8.47e-13   9.02e-13     0.94   0.352    -9.64e-13    2.66e-12
       itd156 |   8.47e-13   9.02e-13     0.94   0.352    -9.64e-13    2.66e-12
       itd157 |   8.47e-13   9.02e-13     0.94   0.352    -9.64e-13    2.66e-12
       itd158 |          0  (omitted)
       itd159 |   8.47e-13   9.02e-13     0.94   0.352    -9.64e-13    2.66e-12
       itd160 |   8.47e-13   9.02e-13     0.94   0.352    -9.64e-13    2.66e-12
       itd161 |   8.47e-13   9.02e-13     0.94   0.352    -9.64e-13    2.66e-12
       itd162 |   8.47e-13   9.02e-13     0.94   0.352    -9.64e-13    2.66e-12
       itd163 |   8.47e-13   9.02e-13     0.94   0.352    -9.64e-13    2.66e-12
       itd164 |   8.47e-13   9.02e-13     0.94   0.352    -9.64e-13    2.66e-12
       itd165 |   8.47e-13   9.02e-13     0.94   0.352    -9.64e-13    2.66e-12
       itd166 |   8.47e-13   9.02e-13     0.94   0.352    -9.64e-13    2.66e-12
       itd167 |   8.47e-13   9.02e-13     0.94   0.352    -9.64e-13    2.66e-12
       itd168 |   8.47e-13   9.02e-13     0.94   0.352    -9.64e-13    2.66e-12
       itd169 |          0  (omitted)
       itd170 |   1.24e-12   1.37e-12     0.91   0.369    -1.51e-12    4.00e-12
       itd171 |       .125   1.46e-12  8.6e+10   0.000         .125        .125
       itd172 |       .125   1.46e-12  8.6e+10   0.000         .125        .125
       itd173 |       .125   1.46e-12  8.6e+10   0.000         .125        .125
       itd174 |       .125   1.46e-12  8.6e+10   0.000         .125        .125
       itd175 |       .125   1.46e-12  8.6e+10   0.000         .125        .125
       itd176 |        .25   1.38e-12  1.8e+11   0.000          .25         .25
       itd177 |       .125   1.46e-12  8.6e+10   0.000         .125        .125
       itd178 |       .125   1.46e-12  8.6e+10   0.000         .125        .125
       itd179 |       .125   1.46e-12  8.6e+10   0.000         .125        .125
       itd180 |       .125   1.46e-12  8.6e+10   0.000         .125        .125
       itd181 |   1.24e-12   1.37e-12     0.91   0.369    -1.51e-12    4.00e-12
       itd182 |        .25   1.37e-12  1.8e+11   0.000          .25         .25
       itd183 |   .0229873   .0000539   426.73   0.000     .0228792    .0230955
       itd184 |   .0034118   .0000215   158.90   0.000     .0033687    .0034549
       itd185 |          0  (omitted)
       itd186 |   .0323722   .0000113  2855.90   0.000     .0323494    .0323949
       itd187 |     .01263   .0000354   357.07   0.000      .012559     .012701
       itd188 |  -.0002247   .0000807    -2.78   0.008    -.0003867   -.0000626
       itd189 |   .0066166   .0001172    56.46   0.000     .0063813    .0068519
       itd190 |   .0202412   .0002005   100.95   0.000     .0198386    .0206437
       itd191 |   -.000849   .0002789    -3.04   0.004    -.0014089   -.0002892
       itd192 |   .0183265   .0004331    42.31   0.000     .0174569     .019196
       itd193 |   .0166563    .000594    28.04   0.000     .0154639    .0178487
       itd194 |   .0208812   .0007257    28.77   0.000     .0194242    .0223381
       itd195 |    .044276   .0006605    67.04   0.000       .04295     .045602
       itd196 |   .0160226   .0008129    19.71   0.000     .0143907    .0176545
       itd197 |   .0143042   .0000339   422.09   0.000     .0142362    .0143723
       itd198 |  -.0059064   .0000476  -124.01   0.000     -.006002   -.0058107
       itd199 |          0  (omitted)
       itd200 |   .0200803   .0000309   649.61   0.000     .0200183    .0201424
       itd201 |  -.0002265   .0000757    -2.99   0.004    -.0003785   -.0000744
       itd202 |    .014085   .0001065   132.22   0.000     .0138712    .0142989
       itd203 |   .0024563   .0001393    17.63   0.000     .0021767     .002736
       itd204 |  -.0034634   .0001912   -18.11   0.000    -.0038473   -.0030795
       itd205 |    .018921   .0004165    45.43   0.000     .0180849    .0197571
       itd206 |  -.0073111   .0005118   -14.29   0.000    -.0083385   -.0062836
       itd207 |    .012166   .0007452    16.33   0.000     .0106699     .013662
       itd208 |   .0320137   .0008526    37.55   0.000     .0303021    .0337254
       itd209 |   .0153039   .0006538    23.41   0.000     .0139913    .0166166
       itd210 |   .0230857   .0009421    24.50   0.000     .0211944    .0249771
       itd211 |  -.0408163   2.01e-13 -2.0e+11   0.000    -.0408163   -.0408163
       itd212 |   .1632653   1.99e-13  8.2e+11   0.000     .1632653    .1632653
       itd213 |   .1632653   1.99e-13  8.2e+11   0.000     .1632653    .1632653
       itd214 |   .1836735   2.00e-13  9.2e+11   0.000     .1836735    .1836735
       itd215 |  -.0408163   2.01e-13 -2.0e+11   0.000    -.0408163   -.0408163
       itd216 |  -.0204082   2.01e-13 -1.0e+11   0.000    -.0204082   -.0204082
       itd217 |   .0408163   1.99e-13  2.0e+11   0.000     .0408163    .0408163
       itd218 |   1.21e-13   1.99e-13     0.60   0.548    -2.80e-13    5.21e-13
       itd219 |  -.0204082   2.01e-13 -1.0e+11   0.000    -.0204082   -.0204082
       itd220 |          0  (omitted)
       itd221 |  -.0204082   2.01e-13 -1.0e+11   0.000    -.0204082   -.0204082
       itd222 |   .0612245   2.00e-13  3.1e+11   0.000     .0612245    .0612245
       itd223 |   .0408163   1.99e-13  2.0e+11   0.000     .0408163    .0408163
       itd224 |  -.0408163   2.01e-13 -2.0e+11   0.000    -.0408163   -.0408163
       itd225 |   -.123844    .000177  -699.57   0.000    -.1241994   -.1234886
       itd226 |  -.0934302   .0001873  -498.69   0.000    -.0938063    -.093054
       itd227 |  -.0934175   .0001922  -486.11   0.000    -.0938033   -.0930317
       itd228 |  -.0630387   .0001891  -333.32   0.000    -.0634184   -.0626591
       itd229 |  -.1072466   .0001857  -577.49   0.000    -.1076194   -.1068738
       itd230 |   .0584431   .0001644   355.60   0.000     .0581131     .058773
       itd231 |  -.0714279   .0001504  -474.96   0.000    -.0717298    -.071126
       itd232 |   -.035534   .0001436  -247.37   0.000    -.0358224   -.0352456
       itd233 |  -.0714673   .0001354  -527.86   0.000    -.0717391   -.0711955
       itd234 |  -.0853933   .0000921  -927.22   0.000    -.0855782   -.0852084
       itd235 |  -.1158125   .0000797 -1452.66   0.000    -.1159726   -.1156525
       itd236 |  -.0799603   .0000571 -1399.39   0.000     -.080075   -.0798456
       itd237 |  -.0441199     .00003 -1468.62   0.000    -.0441802   -.0440596
       itd238 |          0  (omitted)
       itd239 |    .010989   1.21e-12  9.1e+09   0.000      .010989     .010989
       itd240 |   1.12e-12   1.21e-12     0.93   0.358    -1.30e-12    3.54e-12
       itd241 |   1.12e-12   1.21e-12     0.93   0.358    -1.30e-12    3.54e-12
       itd242 |    .010989   1.21e-12  9.1e+09   0.000      .010989     .010989
       itd243 |    .010989   1.21e-12  9.1e+09   0.000      .010989     .010989
       itd244 |   1.12e-12   1.21e-12     0.93   0.358    -1.30e-12    3.54e-12
       itd245 |   1.12e-12   1.21e-12     0.93   0.358    -1.30e-12    3.54e-12
       itd246 |    .010989   1.21e-12  9.1e+09   0.000      .010989     .010989
       itd247 |          0  (omitted)
       itd248 |   1.12e-12   1.21e-12     0.93   0.358    -1.30e-12    3.54e-12
       itd249 |   -.010989   1.12e-12 -9.8e+09   0.000     -.010989    -.010989
       itd250 |   1.12e-12   1.21e-12     0.93   0.358    -1.30e-12    3.54e-12
       itd251 |    .010989   1.21e-12  9.1e+09   0.000      .010989     .010989
       itd252 |   1.12e-12   1.21e-12     0.93   0.358    -1.30e-12    3.54e-12
       itd253 |   .0283054   .0039674     7.13   0.000     .0203406    .0362703
       itd254 |   .0159657   .0041754     3.82   0.000     .0075832    .0243481
       itd255 |  -.0099673   .0042727    -2.33   0.024    -.0185452   -.0013894
       itd256 |   .0292466   .0042048     6.96   0.000      .020805    .0376882
       itd257 |   .0026445   .0041304     0.64   0.525    -.0056476    .0109366
       itd258 |   .0271928   .0036733     7.40   0.000     .0198184    .0345673
       itd259 |   .0787157   .0033912    23.21   0.000     .0719075    .0855239
       itd260 |   .0255224   .0032456     7.86   0.000     .0190067    .0320382
       itd261 |  -.0014792    .003068    -0.48   0.632    -.0076384      .00468
       itd262 |   .0212182   .0021287     9.97   0.000     .0169447    .0254918
       itd263 |   .0068559    .001799     3.81   0.000     .0032443    .0104675
       itd264 |    .030653   .0010848    28.26   0.000     .0284752    .0328308
       itd265 |   .0288088   .0006455    44.63   0.000     .0275128    .0301047
       itd266 |          0  (omitted)
       itd267 |  -.0968671   .0004847  -199.85   0.000    -.0978402   -.0958941
       itd268 |  -.0001567   .0000382    -4.10   0.000    -.0002335     -.00008
       itd269 |          0  (omitted)
       itd270 |   .0302119   .0004333    69.72   0.000      .029342    .0310818
       itd271 |     .01421   .0004611    30.82   0.000     .0132844    .0151356
       itd272 |  -.0816523   .0006723  -121.45   0.000     -.083002   -.0803026
       itd273 |  -.0982379   .0008932  -109.98   0.000    -.1000312   -.0964446
       itd274 |  -.0837792   .0012919   -64.85   0.000    -.0863728   -.0811857
       itd275 |  -.0536911   .0017005   -31.57   0.000    -.0571049   -.0502772
       itd276 |  -.0744537   .0031516   -23.62   0.000    -.0807807   -.0681266
       itd277 |   .0515752   .0033652    15.33   0.000     .0448193    .0583311
       itd278 |  -.1235767   .0035293   -35.01   0.000    -.1306622   -.1164912
       itd279 |  -.0100815   .0029782    -3.39   0.001    -.0160605   -.0041025
       itd280 |  -.0144186   .0041728    -3.46   0.001    -.0227958   -.0060414
       itd281 |   2.89e-13   6.18e-13     0.47   0.643    -9.52e-13    1.53e-12
       itd282 |   2.89e-13   6.18e-13     0.47   0.643    -9.52e-13    1.53e-12
       itd283 |   2.89e-13   6.18e-13     0.47   0.643    -9.52e-13    1.53e-12
       itd284 |   2.88e-13   6.18e-13     0.47   0.643    -9.52e-13    1.53e-12
       itd285 |   2.88e-13   6.18e-13     0.47   0.643    -9.52e-13    1.53e-12
       itd286 |         .5   6.15e-13  8.1e+11   0.000           .5          .5
       itd287 |         .5   6.15e-13  8.1e+11   0.000           .5          .5
       itd288 |   2.89e-13   6.18e-13     0.47   0.643    -9.52e-13    1.53e-12
       itd289 |          0  (omitted)
       itd290 |   2.89e-13   6.18e-13     0.47   0.643    -9.52e-13    1.53e-12
       itd291 |   2.89e-13   6.18e-13     0.47   0.643    -9.52e-13    1.53e-12
       itd292 |   2.89e-13   6.18e-13     0.47   0.643    -9.52e-13    1.53e-12
       itd293 |   2.89e-13   6.18e-13     0.47   0.643    -9.52e-13    1.53e-12
       itd294 |        -.5   6.15e-13 -8.1e+11   0.000          -.5         -.5
       itd295 |  -.0774847   .0002137  -362.66   0.000    -.0779137   -.0770558
       itd296 |          0  (omitted)
       itd297 |  -.1539681   .0000464 -3319.54   0.000    -.1540612    -.153875
       itd298 |  -.0008563   .0003258    -2.63   0.011    -.0015103   -.0002024
       itd299 |  -.2315324   .0002903  -797.54   0.000    -.2321152   -.2309496
       itd300 |   -.154308   .0001757  -878.34   0.000    -.1546607   -.1539553
       itd301 |  -.0773409   .0001589  -486.58   0.000      -.07766   -.0770218
       itd302 |  -.2317164   .0003603  -643.14   0.000    -.2324397    -.230993
       itd303 |  -.0013035   .0004959    -2.63   0.011     -.002299    -.000308
       itd304 |   -.233464   .0010251  -227.75   0.000     -.235522    -.231406
       itd305 |  -.2332928     .00096  -243.02   0.000    -.2352201   -.2313656
       itd306 |  -.2327957   .0007709  -301.98   0.000    -.2343434   -.2312481
       itd307 |   -.230982    .000081 -2853.29   0.000    -.2311446   -.2308195
       itd308 |  -.3090623   .0005211  -593.04   0.000    -.3101085    -.308016
       itd309 |   .0833333   6.65e-13  1.3e+11   0.000     .0833333    .0833333
       itd310 |   6.21e-13   6.86e-13     0.90   0.370    -7.57e-13    2.00e-12
       itd311 |  -.0833333   6.54e-13 -1.3e+11   0.000    -.0833333   -.0833333
       itd312 |   6.20e-13   6.86e-13     0.90   0.370    -7.57e-13    2.00e-12
       itd313 |   6.20e-13   6.86e-13     0.90   0.370    -7.57e-13    2.00e-12
       itd314 |   6.20e-13   6.86e-13     0.90   0.370    -7.57e-13    2.00e-12
       itd315 |   6.21e-13   6.87e-13     0.90   0.370    -7.58e-13    2.00e-12
       itd316 |   6.20e-13   6.86e-13     0.90   0.370    -7.57e-13    2.00e-12
       itd317 |   6.20e-13   6.86e-13     0.90   0.370    -7.57e-13    2.00e-12
       itd318 |  -.0833333   6.54e-13 -1.3e+11   0.000    -.0833333   -.0833333
       itd319 |   6.21e-13   6.87e-13     0.90   0.370    -7.57e-13    2.00e-12
       itd320 |   .0833333   6.65e-13  1.3e+11   0.000     .0833333    .0833333
       itd321 |   6.20e-13   6.86e-13     0.90   0.370    -7.57e-13    2.00e-12
       itd322 |          0  (omitted)
       itd323 |  -.1085356   .0004289  -253.05   0.000    -.1093966   -.1076745
       itd324 |   .0172012   .0004539    37.90   0.000     .0162899    .0181125
       itd325 |   .0067685   .0004656    14.54   0.000     .0058338    .0077032
       itd326 |  -.0194339   .0004582   -42.41   0.000    -.0203538    -.018514
       itd327 |  -.0665815   .0004499  -147.98   0.000    -.0674848   -.0656782
       itd328 |  -.0039247   .0003982    -9.86   0.000    -.0047241   -.0031253
       itd329 |  -.0930413   .0003644  -255.36   0.000    -.0937728   -.0923098
       itd330 |   -.093095    .000348  -267.49   0.000    -.0937937   -.0923963
       itd331 |  -.0250981    .000328   -76.51   0.000    -.0257566   -.0244395
       itd332 |  -.0673282   .0002231  -301.74   0.000    -.0677762   -.0668803
       itd333 |   .0058715   .0001932    30.40   0.000     .0054837    .0062593
       itd334 |   .0266338   .0001384   192.39   0.000     .0263559    .0269117
       itd335 |  -.0521164   .0000728  -716.03   0.000    -.0522625   -.0519703
       itd336 |          0  (omitted)
       itd337 |   .0741897   .0043819    16.93   0.000     .0653926    .0829868
       itd338 |   .1954248   .0044315    44.10   0.000     .1865282    .2043214
       itd339 |   .1354559   .0046227    29.30   0.000     .1261754    .1447364
       itd340 |   .0743572   .0044689    16.64   0.000     .0653855    .0833289
       itd341 |   .1949826   .0042964    45.38   0.000     .1863573     .203608
       itd342 |   .3458663   .0040483    85.43   0.000     .3377389    .3539936
       itd343 |   .5271013    .003838   137.34   0.000     .5193962    .5348063
       itd344 |   .1020793    .003594    28.40   0.000     .0948641    .1092945
       itd345 |   .0082578   .0027614     2.99   0.004     .0027141    .0138016
       itd346 |   .0972858   .0020724    46.94   0.000     .0931252    .1014464
       itd347 |   -.026942   .0012047   -22.36   0.000    -.0293605   -.0245234
       itd348 |   .1533067   .0006994   219.21   0.000     .1519027    .1547108
       itd349 |   .0040541   .0012361     3.28   0.002     .0015726    .0065356
       itd350 |          0  (omitted)
       itd351 |  -1.22e-13   1.78e-13    -0.68   0.497    -4.79e-13    2.35e-13
       itd352 |   .0049669   1.77e-13  2.8e+10   0.000     .0049669    .0049669
       itd353 |   .0033113   1.78e-13  1.9e+10   0.000     .0033113    .0033113
       itd354 |  -1.22e-13   1.78e-13    -0.68   0.497    -4.79e-13    2.35e-13
       itd355 |  -1.22e-13   1.78e-13    -0.68   0.497    -4.79e-13    2.36e-13
       itd356 |  -1.22e-13   1.78e-13    -0.68   0.497    -4.79e-13    2.36e-13
       itd357 |  -.0016556   1.78e-13 -9.3e+09   0.000    -.0016556   -.0016556
       itd358 |  -.0016556   1.78e-13 -9.3e+09   0.000    -.0016556   -.0016556
       itd359 |  -.0016556   1.78e-13 -9.3e+09   0.000    -.0016556   -.0016556
       itd360 |   .0016556   1.78e-13  9.3e+09   0.000     .0016556    .0016556
       itd361 |  -.0016556   1.78e-13 -9.3e+09   0.000    -.0016556   -.0016556
       itd362 |  -1.22e-13   1.78e-13    -0.68   0.497    -4.79e-13    2.36e-13
       itd363 |  -1.22e-13   1.78e-13    -0.68   0.497    -4.80e-13    2.36e-13
       itd364 |          0  (omitted)
       itd365 |   .0137972   .0052486     2.63   0.011     .0032603    .0243342
       itd366 |   .0150275   .0057165     2.63   0.011      .003551    .0265039
       itd367 |   .0158861   .0060432     2.63   0.011     .0037539    .0280184
       itd368 |   .0147656   .0056169     2.63   0.011     .0034891    .0260421
       itd369 |   .0118566   .0045103     2.63   0.011     .0028017    .0209114
       itd370 |    .213884   .0052816    40.50   0.000     .2032808    .2244872
       itd371 |   .0127929   .0048665     2.63   0.011      .003023    .0225627
       itd372 |   .0076519   .0029108     2.63   0.011     .0018082    .0134957
       itd373 |   .2093844   .0035699    58.65   0.000     .2022175    .2165512
       itd374 |   .0077804   .0029597     2.63   0.011     .0018385    .0137224
       itd375 |   .0060638   .0023067     2.63   0.011     .0014329    .0106948
       itd376 |          0  (omitted)
       itd377 |   .0047732   .0018157     2.63   0.011     .0011279    .0084184
       itd378 |   .0010934   .0004159     2.63   0.011     .0002584    .0019284
       itd379 |   .0163287   .0002623    62.26   0.000     .0158022    .0168552
       itd380 |   .0111158   .0001165    95.39   0.000     .0108819    .0113498
       itd381 |  -.0003849   .0001135    -3.39   0.001    -.0006127   -.0001571
       itd382 |   .0224058   .0001677   133.58   0.000     .0220691    .0227426
       itd383 |  -.0000757   .0000176    -4.31   0.000     -.000111   -.0000404
       itd384 |          0  (omitted)
       itd385 |   .0056475    .000031   182.16   0.000     .0055852    .0057097
       itd386 |   -.013685    .000675   -20.27   0.000    -.0150401   -.0123298
       itd387 |   .0196845   .0010075    19.54   0.000     .0176618    .0217071
       itd388 |  -.0190666   .0022978    -8.30   0.000    -.0236796   -.0144536
       itd389 |   .0081701   .0027587     2.96   0.005     .0026317    .0137084
       itd390 |  -.0091656    .002788    -3.29   0.002    -.0147627   -.0035684
       itd391 |  -.0077728   .0023818    -3.26   0.002    -.0125544   -.0029911
       itd392 |  -.0040837   .0030141    -1.35   0.181    -.0101348    .0019674
       itd393 |   -.008658   1.89e-13 -4.6e+10   0.000     -.008658    -.008658
       itd394 |   -.004329   1.90e-13 -2.3e+10   0.000     -.004329    -.004329
       itd395 |   -.008658   1.89e-13 -4.6e+10   0.000     -.008658    -.008658
       itd396 |          0  (omitted)
       itd397 |   -.004329   1.89e-13 -2.3e+10   0.000     -.004329    -.004329
       itd398 |    .034632   1.87e-13  1.9e+11   0.000      .034632     .034632
       itd399 |    .012987   2.21e-13  5.9e+10   0.000      .012987     .012987
       itd400 |    .017316   1.89e-13  9.2e+10   0.000      .017316     .017316
       itd401 |  -1.26e-13   2.22e-13    -0.57   0.574    -5.72e-13    3.21e-13
       itd402 |    .012987   2.23e-13  5.8e+10   0.000      .012987     .012987
       itd403 |    .012987   2.25e-13  5.8e+10   0.000      .012987     .012987
       itd404 |   -.008658   1.89e-13 -4.6e+10   0.000     -.008658    -.008658
       itd405 |    .021645   1.88e-13  1.2e+11   0.000      .021645     .021645
       itd406 |   -.008658   1.89e-13 -4.6e+10   0.000     -.008658    -.008658
       itd407 |  -.0145055   .0001058  -137.07   0.000    -.0147179    -.014293
       itd408 |  -.0119054   .0000337  -353.18   0.000    -.0119731   -.0118377
       itd409 |          0  (omitted)
       itd410 |  -.0118639   .0000213  -556.60   0.000    -.0119067   -.0118211
       itd411 |  -.0072267   .0000451  -160.08   0.000    -.0073173   -.0071361
       itd412 |  -.0148022   .0001944   -76.14   0.000    -.0151925   -.0144119
       itd413 |  -.0151291    .000292   -51.82   0.000    -.0157152   -.0145429
       itd414 |  -.0129283    .000339   -38.13   0.000    -.0136089   -.0122476
       itd415 |    -.01548   .0003967   -39.02   0.000    -.0162765   -.0146836
       itd416 |  -.0117765   .0006993   -16.84   0.000    -.0131803   -.0103727
       itd417 |  -.0144245   .0007857   -18.36   0.000    -.0160019   -.0128472
       itd418 |   .0015562   .0009435     1.65   0.105    -.0003379    .0034504
       itd419 |  -.0108705   .0011328    -9.60   0.000    -.0131447   -.0085962
       itd420 |  -.0115737   .0013427    -8.62   0.000    -.0142693    -.008878
       itd421 |  -.0040631    .001314    -3.09   0.003     -.006701   -.0014252
       itd422 |  -.0344502   .0014519   -23.73   0.000    -.0373649   -.0315354
       itd423 |  -.0266107   .0015023   -17.71   0.000    -.0296266   -.0235947
       itd424 |  -.0076755   .0013976    -5.49   0.000    -.0104814   -.0048697
       itd425 |  -.0350508   .0012466   -28.12   0.000    -.0375534   -.0325482
       itd426 |  -.0271627   .0013028   -20.85   0.000    -.0297781   -.0245473
       itd427 |   .0225152   .0011861    18.98   0.000     .0201339    .0248965
       itd428 |   .0253143   .0008249    30.69   0.000     .0236584    .0269703
       itd429 |  -.0283485   .0008805   -32.20   0.000    -.0301161   -.0265808
       itd430 |   -.025244   .0006036   -41.82   0.000    -.0264557   -.0240322
       itd431 |  -.0179633   .0004578   -39.24   0.000    -.0188823   -.0170443
       itd432 |  -.0113333    .000096  -118.04   0.000     -.011526   -.0111405
       itd433 |   .0432475    .000335   129.11   0.000      .042575      .04392
       itd434 |          0  (omitted)
       itd435 |   .0038612   .0011663     3.31   0.002     .0015198    .0062026
       itd436 |   .0012688   .0012075     1.05   0.298    -.0011554     .003693
       itd437 |   .0068939   .0012551     5.49   0.000     .0043742    .0094137
       itd438 |   .0012729    .001211     1.05   0.298    -.0011583    .0037042
       itd439 |   .0011719   .0011797     0.99   0.325    -.0011965    .0035402
       itd440 |   .0009464    .001106     0.86   0.396     -.001274    .0031668
       itd441 |   .0007432   .0010427     0.71   0.479    -.0013501    .0028365
       itd442 |   .0004202   .0009523     0.44   0.661    -.0014917    .0023321
       itd443 |   .0024648   .0007553     3.26   0.002     .0009486    .0039811
       itd444 |  -.0010231   .0005276    -1.94   0.058    -.0020824    .0000362
       itd445 |   .0010549   .0003359     3.14   0.003     .0003806    .0017293
       itd446 |   .0006689   .0002147     3.12   0.003     .0002379       .0011
       itd447 |   .0037759   .0003068    12.31   0.000     .0031599    .0043918
       itd448 |          0  (omitted)
       itd449 |   1.29e-12   1.41e-12     0.91   0.366    -1.55e-12    4.12e-12
       itd450 |          0  (omitted)
       itd451 |   1.29e-12   1.41e-12     0.91   0.366    -1.55e-12    4.12e-12
       itd452 |   1.29e-12   1.41e-12     0.91   0.366    -1.55e-12    4.12e-12
       itd453 |   1.29e-12   1.41e-12     0.91   0.366    -1.55e-12    4.12e-12
       itd454 |   1.29e-12   1.41e-12     0.91   0.366    -1.55e-12    4.12e-12
       itd455 |   1.29e-12   1.41e-12     0.91   0.366    -1.55e-12    4.12e-12
       itd456 |   1.29e-12   1.41e-12     0.91   0.366    -1.55e-12    4.12e-12
       itd457 |   1.29e-12   1.41e-12     0.91   0.366    -1.55e-12    4.12e-12
       itd458 |   1.29e-12   1.41e-12     0.91   0.366    -1.55e-12    4.12e-12
       itd459 |   1.29e-12   1.41e-12     0.91   0.366    -1.55e-12    4.12e-12
       itd460 |   1.29e-12   1.41e-12     0.91   0.366    -1.55e-12    4.12e-12
       itd461 |   1.29e-12   1.41e-12     0.91   0.366    -1.55e-12    4.12e-12
       itd462 |   1.29e-12   1.41e-12     0.91   0.366    -1.55e-12    4.12e-12
       itd463 |  -.0817692    .000595  -137.42   0.000    -.0829637   -.0805746
       itd464 |  -.0538508   .0006485   -83.04   0.000    -.0551527    -.052549
       itd465 |  -.0537458   .0006885   -78.07   0.000    -.0551279   -.0523636
       itd466 |   .0849965   .0006327   134.35   0.000     .0837263    .0862666
       itd467 |   .0568247   .0004828   117.70   0.000     .0558554    .0577939
       itd468 |  -.0261643   .0006138   -42.63   0.000    -.0273965   -.0249321
       itd469 |   .0015029   .0005717     2.63   0.011     .0003551    .0026507
       itd470 |  -.0547469   .0003076  -177.96   0.000    -.0553645   -.0541293
       itd471 |  -.0267042   .0004084   -65.39   0.000    -.0275241   -.0258844
       itd472 |   .0287557    .000372    77.30   0.000     .0280089    .0295026
       itd473 |   .0007759   .0002951     2.63   0.011     .0001833    .0013684
       itd474 |          0  (omitted)
       itd475 |  -.0270352   .0002825   -95.71   0.000    -.0276023   -.0264682
       itd476 |  -.0552359   .0001216  -454.20   0.000      -.05548   -.0549917
       itd477 |  -.0055729   .0017291    -3.22   0.002    -.0090442   -.0021015
       itd478 |   .0027709   .0020394     1.36   0.180    -.0013233     .006865
       itd479 |   .0028523   .0020625     1.38   0.173    -.0012884     .006993
       itd480 |   .0207358   .0018822    11.02   0.000     .0169572    .0245144
       itd481 |   .0101304   .0020335     4.98   0.000      .006048    .0142128
       itd482 |  -.0046039   .0020451    -2.25   0.029    -.0087096   -.0004981
       itd483 |   .0097729   .0019259     5.07   0.000     .0059064    .0136394
       itd484 |  -.0030591   .0013705    -2.23   0.030    -.0058105   -.0003077
       itd485 |   -.014837   .0011379   -13.04   0.000    -.0171214   -.0125527
       itd486 |  -.0063891   .0002874   -22.23   0.000     -.006966   -.0058122
       itd487 |   .0042719   .0001653    25.85   0.000     .0039401    .0046037
       itd488 |   .0083072   .0002957    28.10   0.000     .0077136    .0089008
       itd489 |   .0016955   .0005376     3.15   0.003     .0006162    .0027748
       itd490 |          0  (omitted)
       itd491 |   .0143691   .0006398    22.46   0.000     .0130847    .0156536
       itd492 |   .0120478   .0006952    17.33   0.000     .0106522    .0134434
       itd493 |  -.0027688   .0007315    -3.79   0.000    -.0042374   -.0013002
       itd494 |  -.0029008   .0006872    -4.22   0.000    -.0042805   -.0015212
       itd495 |   .0017454   .0005765     3.03   0.004      .000588    .0029028
       itd496 |   .0043897   .0006308     6.96   0.000     .0031234     .005656
       itd497 |  -.0032351    .000577    -5.61   0.000    -.0043935   -.0020767
       itd498 |   .0011566   .0003807     3.04   0.004     .0003923    .0019209
       itd499 |   .0013211   .0004367     3.03   0.004     .0004444    .0021978
       itd500 |  -.0064494   .0003357   -19.21   0.000    -.0071234   -.0057754
       itd501 |   .0132254   .0002604    50.79   0.000     .0127026    .0137482
       itd502 |   .0124925    .000015   833.87   0.000     .0124624    .0125226
       itd503 |   .0029822   .0001648    18.09   0.000     .0026512    .0033131
       itd504 |          0  (omitted)
       itd505 |  -.1674873   .0011999  -139.58   0.000    -.1698962   -.1650784
       itd506 |  -.1543473   .0011937  -129.30   0.000    -.1567438   -.1519508
       itd507 |  -.1607517   .0012525  -128.34   0.000    -.1632663   -.1582371
       itd508 |  -.1542858   .0012144  -127.04   0.000    -.1567239   -.1518477
       itd509 |  -.1412891   .0011601  -121.79   0.000    -.1436182     -.13896
       itd510 |  -.1151368   .0011053  -104.17   0.000    -.1173558   -.1129179
       itd511 |  -.0692339    .001055   -65.62   0.000    -.0713519   -.0671158
       itd512 |  -.0760073   .0009895   -76.81   0.000    -.0779938   -.0740208
       itd513 |  -.1228452   .0007248  -169.49   0.000    -.1243003   -.1213901
       itd514 |  -.1759195   .0005761  -305.36   0.000    -.1770761   -.1747629
       itd515 |  -.1899018   .0002982  -636.77   0.000    -.1905005   -.1893031
       itd516 |  -.1179595   .0001548  -761.82   0.000    -.1182704   -.1176487
       itd517 |  -.0943357   .0003568  -264.43   0.000    -.0950519   -.0936195
       itd518 |          0  (omitted)
       itd519 |   .4283426    .000087  4921.80   0.000     .4281679    .4285174
       itd520 |   .2856414   .0000277  1.0e+04   0.000     .2855858    .2856971
       itd521 |          0  (omitted)
       itd522 |   .1428111   .0000175  8147.05   0.000     .1427759    .1428463
       itd523 |   .1427595   .0000371  3845.18   0.000      .142685    .1428341
       itd524 |  -.1432774   .0001599  -896.18   0.000    -.1435984   -.1429565
       itd525 |  -.2863455   .0002401 -1192.55   0.000    -.2868275   -.2858634
       itd526 |  -.1435901   .0002788  -514.98   0.000    -.1441499   -.1430303
       itd527 |  -.0008577   .0003263    -2.63   0.011    -.0015127   -.0002027
       itd528 |  -.0015117   .0005751    -2.63   0.011    -.0026662   -.0003572
       itd529 |   .2840157   .0006461   439.56   0.000     .2827185    .2853129
       itd530 |  -.1448968   .0007759  -186.74   0.000    -.1464546   -.1433391
       itd531 |   -.002449   .0009316    -2.63   0.011    -.0043193   -.0005787
       itd532 |   .1399544   .0011042   126.74   0.000     .1377375    .1421712
       itd533 |  -.0177253    .000376   -47.14   0.000    -.0184802   -.0169704
       itd534 |  -.0412171    .000398  -103.57   0.000    -.0420161   -.0404182
       itd535 |  -.0411866   .0004082  -100.90   0.000    -.0420061   -.0403671
       itd536 |   -.023538   .0004017   -58.59   0.000    -.0243446   -.0227315
       itd537 |  -.0318046   .0003945   -80.62   0.000    -.0325966   -.0310127
       itd538 |  -.0130941   .0003491   -37.51   0.000     -.013795   -.0123933
       itd539 |  -.0308503   .0003194   -96.57   0.000    -.0314917    -.030209
       itd540 |  -.0073359   .0003051   -24.04   0.000    -.0079484   -.0067233
       itd541 |   -.025056   .0002876   -87.12   0.000    -.0256333   -.0244786
       itd542 |  -.0312193   .0001956  -159.59   0.000     -.031612   -.0308265
       itd543 |  -.0348311   .0001693  -205.68   0.000    -.0351711   -.0344911
       itd544 |  -.0043498   .0001214   -35.84   0.000    -.0045935   -.0041061
       itd545 |   .0037237   .0000638    58.35   0.000     .0035956    .0038518
       itd546 |          0  (omitted)
       itd547 |   .1098225   .0033915    32.38   0.000     .1030139    .1166312
       itd548 |   .0534031   .0033523    15.93   0.000      .046673    .0601332
       itd549 |   .0533682   .0033351    16.00   0.000     .0466728    .0600636
       itd550 |   .1518168   .0032939    46.09   0.000     .1452041    .1584295
       itd551 |   .0953573   .0032599    29.25   0.000     .0888127    .1019018
       itd552 |   .0525816   .0031228    16.84   0.000     .0463124    .0588509
       itd553 |   .0104213   .0031705     3.29   0.002     .0040563    .0167864
       itd554 |   -.017952   .0031148    -5.76   0.000    -.0242051   -.0116988
       itd555 |   .0099912   .0030543     3.27   0.002     .0038595     .016123
       itd556 |   .0226808   .0026707     8.49   0.000      .017319    .0280425
       itd557 |   .0347774   .0020589    16.89   0.000      .030644    .0389107
       itd558 |          0  (omitted)
       itd559 |   .0171286   .0009996    17.14   0.000     .0151219    .0191353
       itd560 |   .0444946   .0007887    56.41   0.000     .0429112    .0460781
       itd561 |  -.0012832   .0004198    -3.06   0.004    -.0021261   -.0004403
       itd562 |   .2855352   .0000373  7660.96   0.000     .2854603      .28561
       itd563 |          0  (omitted)
       itd564 |   .1405285   .0007501   187.35   0.000     .1390226    .1420344
       itd565 |  -.0025822   .0008003    -3.23   0.002    -.0041889   -.0009756
       itd566 |  -.6088086   .0005032 -1209.91   0.000    -.6098188   -.6077984
       itd567 |  -.5016478   .0004907 -1022.24   0.000     -.502633   -.5006626
       itd568 |  -.5750365   .0011056  -520.13   0.000    -.5772561    -.572817
       itd569 |  -.5787601   .0021602  -267.92   0.000    -.5830968   -.5744234
       itd570 |  -.6542012   .0034723  -188.41   0.000    -.6611721   -.6472304
       itd571 |   -.620788   .0040552  -153.08   0.000    -.6289292   -.6126467
       itd572 |  -.5488849   .0038435  -142.81   0.000     -.556601   -.5411689
       itd573 |   -.612148   .0013576  -450.89   0.000    -.6148736   -.6094224
       itd574 |  -.5469331   .0032111  -170.33   0.000    -.5533796   -.5404867
       itd575 |  -.0577778   5.16e-13 -1.1e+11   0.000    -.0577778   -.0577778
       itd576 |  -.0711111   5.18e-13 -1.4e+11   0.000    -.0711111   -.0711111
       itd577 |          0  (omitted)
       itd578 |   .0711111   5.11e-13  1.4e+11   0.000     .0711111    .0711111
       itd579 |  -.0177778   5.14e-13 -3.5e+10   0.000    -.0177778   -.0177778
       itd580 |   .0088889   5.13e-13  1.7e+10   0.000     .0088889    .0088889
       itd581 |  -.0444444   5.14e-13 -8.6e+10   0.000    -.0444444   -.0444444
       itd582 |   .0222222   5.97e-13  3.7e+10   0.000     .0222222    .0222222
       itd583 |  -.0977778   5.20e-13 -1.9e+11   0.000    -.0977778   -.0977778
       itd584 |   .1066667   5.12e-13  2.1e+11   0.000     .1066667    .1066667
       itd585 |   .0933333   5.11e-13  1.8e+11   0.000     .0933333    .0933333
       itd586 |   .0844444   5.09e-13  1.7e+11   0.000     .0844444    .0844444
       itd587 |   .1777778   5.16e-13  3.4e+11   0.000     .1777778    .1777778
       itd588 |   .1911111   5.17e-13  3.7e+11   0.000     .1911111    .1911111
       itd589 |   1.52e-12   1.63e-12     0.93   0.356    -1.76e-12    4.79e-12
       itd590 |          0  (omitted)
       itd591 |   1.52e-12   1.63e-12     0.93   0.356    -1.76e-12    4.80e-12
       itd592 |   1.52e-12   1.63e-12     0.93   0.356    -1.76e-12    4.80e-12
       itd593 |   1.52e-12   1.63e-12     0.93   0.356    -1.76e-12    4.80e-12
       itd594 |   1.52e-12   1.63e-12     0.93   0.356    -1.76e-12    4.80e-12
       itd595 |   1.52e-12   1.63e-12     0.93   0.356    -1.76e-12    4.80e-12
       itd596 |   1.52e-12   1.63e-12     0.93   0.356    -1.76e-12    4.80e-12
       itd597 |   1.52e-12   1.63e-12     0.93   0.356    -1.76e-12    4.80e-12
       itd598 |   1.52e-12   1.63e-12     0.93   0.356    -1.76e-12    4.80e-12
       itd599 |   1.52e-12   1.63e-12     0.93   0.356    -1.76e-12    4.80e-12
       itd600 |   1.52e-12   1.63e-12     0.93   0.356    -1.76e-12    4.80e-12
       itd601 |   1.52e-12   1.63e-12     0.93   0.356    -1.76e-12    4.80e-12
       itd602 |   1.52e-12   1.63e-12     0.93   0.356    -1.76e-12    4.80e-12
       itd603 |   .2800734   .0069416    40.35   0.000     .2661376    .2940091
       itd604 |   .2827756   .0075653    37.38   0.000     .2675876    .2979636
       itd605 |   .0347962   .0080317     4.33   0.000     .0186719    .0509205
       itd606 |   .0319763   .0073808     4.33   0.000     .0171587    .0467939
       itd607 |   .0244007   .0056322     4.33   0.000     .0130936    .0357078
       itd608 |    .031021   .0071603     4.33   0.000     .0166461    .0453959
       itd609 |   .2788957   .0066697    41.82   0.000     .2655057    .2922858
       itd610 |   .2655481   .0035888    73.99   0.000     .2583432     .272753
       itd611 |   .0206407   .0047643     4.33   0.000     .0110759    .0302054
       itd612 |   .0188026     .00434     4.33   0.000     .0100896    .0275155
       itd613 |   .0149172   .0034432     4.33   0.000     .0080047    .0218298
       itd614 |          0  (omitted)
       itd615 |   .0142763   .0032953     4.33   0.000     .0076607    .0208918
       itd616 |   .0061464   .0014187     4.33   0.000     .0032982    .0089947
       itd617 |   .0023256   6.59e-13  3.5e+09   0.000     .0023256    .0023256
       itd618 |  -.0023256   6.46e-13 -3.6e+09   0.000    -.0023256   -.0023256
       itd619 |   .0046512   6.45e-13  7.2e+09   0.000     .0046512    .0046512
       itd620 |   .0046512   6.43e-13  7.2e+09   0.000     .0046512    .0046512
       itd621 |  -.0069767   6.44e-13 -1.1e+10   0.000    -.0069767   -.0069767
       itd622 |  -.0023256   6.43e-13 -3.6e+09   0.000    -.0023256   -.0023256
       itd623 |   .0069767   6.85e-13  1.0e+10   0.000     .0069767    .0069767
       itd624 |   .0162791   6.75e-13  2.4e+10   0.000     .0162791    .0162791
       itd625 |   .0162791   6.78e-13  2.4e+10   0.000     .0162791    .0162791
       itd626 |   .0581395   6.34e-13  9.2e+10   0.000     .0581395    .0581395
       itd627 |   .0511628   6.38e-13  8.0e+10   0.000     .0511628    .0511628
       itd628 |   .0348837   6.36e-13  5.5e+10   0.000     .0348837    .0348837
       itd629 |   .0116279   6.82e-13  1.7e+10   0.000     .0116279    .0116279
       itd630 |          0  (omitted)
       itd631 |     .17995   .0032925    54.65   0.000       .17334    .1865599
       itd632 |   .1240157   .0032277    38.42   0.000     .1175358    .1304956
       itd633 |   .0127322   .0031987     3.98   0.000     .0063106    .0191539
       itd634 |   .0126016   .0031623     3.98   0.000      .006253    .0189502
       itd635 |   .0125112   .0031343     3.99   0.000     .0062188    .0188036
       itd636 |   .0678477    .003039    22.33   0.000     .0617466    .0739488
       itd637 |   .0127799   .0031223     4.09   0.000     .0065116    .0190481
       itd638 |   .0126532   .0030797     4.11   0.000     .0064705    .0188359
       itd639 |   .0680892   .0030358    22.43   0.000     .0619946    .0741839
       itd640 |   .0116005   .0027387     4.24   0.000     .0061024    .0170986
       itd641 |   .0090261   .0021225     4.25   0.000     .0047649    .0132873
       itd642 |          0  (omitted)
       itd643 |   .0051041   .0011368     4.49   0.000     .0028219    .0073863
       itd644 |   .0602517   .0010083    59.76   0.000     .0582275    .0622759
       itd645 |   .0156517   .0001194   131.05   0.000     .0154119    .0158915
       itd646 |  -.0167077   .0001613  -103.59   0.000    -.0170315   -.0163839
       itd647 |  -.0005196   .0001348    -3.85   0.000    -.0007902   -.0002489
       itd648 |  -.0171692   .0002914   -58.92   0.000    -.0177542   -.0165842
       itd649 |  -.0170488   .0002695   -63.26   0.000    -.0175898   -.0165077
       itd650 |    -.00038   .0001117    -3.40   0.001    -.0006044   -.0001557
       itd651 |          0  (omitted)
       itd652 |  -.0170481   .0002756   -61.87   0.000    -.0176013   -.0164948
       itd653 |  -.0200655   .0012067   -16.63   0.000     -.022488    -.017643
       itd654 |  -.0228523   .0020088   -11.38   0.000    -.0268851   -.0188194
       itd655 |  -.0263852   .0031062    -8.49   0.000    -.0326213   -.0201492
       itd656 |  -.0305154   .0043763    -6.97   0.000    -.0393012   -.0217296
       itd657 |  -.0081246   .0024623    -3.30   0.002    -.0130679   -.0031812
       itd658 |    .085466   .0034482    24.79   0.000     .0785435    .0923884
       itd659 |  -.0207493   .0001056  -196.53   0.000    -.0209613   -.0205374
       itd660 |  -.0205168   .0000336  -610.08   0.000    -.0205844   -.0204493
       itd661 |          0  (omitted)
       itd662 |    .006734   .0000213   316.67   0.000     .0066913    .0067767
       itd663 |   .0032558    .000045    72.29   0.000     .0031654    .0033462
       itd664 |  -.0142322   .0001939   -73.38   0.000    -.0146216   -.0138428
       itd665 |  -.0247508   .0002913   -84.97   0.000    -.0253356   -.0241661
       itd666 |   .0023083   .0003382     6.82   0.000     .0016292    .0029873
       itd667 |   .0123263   .0003958    31.14   0.000     .0115317     .013121
       itd668 |  -.0090571   .0006976   -12.98   0.000    -.0104576   -.0076566
       itd669 |  -.0127372   .0007838   -16.25   0.000    -.0143108   -.0111635
       itd670 |    .013965   .0009413    14.84   0.000     .0120753    .0158546
       itd671 |  -.0172577   .0011302   -15.27   0.000    -.0195266   -.0149888
       itd672 |  -.0179344   .0013396   -13.39   0.000    -.0206237   -.0152451
       itd673 |  -.1351351   1.17e-13 -1.2e+12   0.000    -.1351351   -.1351351
       itd674 |          0  (omitted)
       itd675 |   -.027027   1.23e-13 -2.2e+11   0.000     -.027027    -.027027
       itd676 |  -.0405405   1.23e-13 -3.3e+11   0.000    -.0405405   -.0405405
       itd677 |   .0540541   1.20e-13  4.5e+11   0.000     .0540541    .0540541
       itd678 |   .0540541   1.20e-13  4.5e+11   0.000     .0540541    .0540541
       itd679 |   .0945946   1.22e-13  7.7e+11   0.000     .0945946    .0945946
       itd680 |   .2027027   1.15e-13  1.8e+12   0.000     .2027027    .2027027
       itd681 |   .0945946   1.22e-13  7.7e+11   0.000     .0945946    .0945946
       itd682 |  -5.85e-14   1.23e-13    -0.48   0.636    -3.06e-13    1.89e-13
       itd683 |  -.0810811   1.15e-13 -7.0e+11   0.000    -.0810811   -.0810811
       itd684 |  -7.20e-14   1.22e-13    -0.59   0.557    -3.16e-13    1.72e-13
       itd685 |   .1351351   1.22e-13  1.1e+12   0.000     .1351351    .1351351
       itd686 |   .0540541   1.17e-13  4.6e+11   0.000     .0540541    .0540541
       itd687 |  -.0070889    .003503    -2.02   0.048    -.0141214   -.0000564
       itd688 |  -.0227284   .0037365    -6.08   0.000    -.0302298   -.0152271
       itd689 |   .0001084   .0038752     0.03   0.978    -.0076713    .0078881
       itd690 |  -.0099465   .0034615    -2.87   0.006    -.0168957   -.0029974
       itd691 |  -.0119221   .0030187    -3.95   0.000    -.0179824   -.0058617
       itd692 |     .01156   .0032887     3.52   0.001     .0049577    .0181622
       itd693 |  -.0091302    .002994    -3.05   0.004    -.0151408   -.0031196
       itd694 |   .0033897   .0020655     1.64   0.107     -.000757    .0075364
       itd695 |   .0341534    .002077    16.44   0.000     .0299836    .0383232
       itd696 |   .0036923     .00144     2.56   0.013     .0008014    .0065833
       itd697 |   .0155135   .0009664    16.05   0.000     .0135734    .0174536
       itd698 |          0  (omitted)
       itd699 |    .037677   .0009753    38.63   0.000     .0357191    .0396349
       itd700 |    .008457   .0000909    93.00   0.000     .0082744    .0086396
       itd701 |  -.0096678   .0004945   -19.55   0.000    -.0106605    -.008675
       itd702 |  -.0042059   .0000681   -61.79   0.000    -.0043426   -.0040693
       itd703 |          0  (omitted)
       itd704 |   .0150459   .0002586    58.18   0.000     .0145268    .0155651
       itd705 |   .0312223    .000207   150.84   0.000     .0308068    .0316379
       itd706 |  -.0006297   .0001926    -3.27   0.002    -.0010164    -.000243
       itd707 |  -.0050845   .0003335   -15.25   0.000     -.005754    -.004415
       itd708 |   .0045126   .0010288     4.39   0.000     .0024473     .006578
       itd709 |   .0194028   .0013169    14.73   0.000     .0167591    .0220466
       itd710 |   .0161468   .0022534     7.17   0.000      .011623    .0206706
       itd711 |   .0199711   .0023092     8.65   0.000     .0153352     .024607
       itd712 |  -.0119099   .0023466    -5.08   0.000    -.0166208   -.0071989
       itd713 |   .0092887   .0019623     4.73   0.000     .0053491    .0132283
       itd714 |  -.0008172   .0025913    -0.32   0.754    -.0060194     .004385
       itd715 |  -.2978238   .0062811   -47.42   0.000    -.3104337    -.285214
       itd716 |  -.2370312   .0067501   -35.12   0.000    -.2505826   -.2234798
       itd717 |  -.2515976   .0068192   -36.90   0.000    -.2652877   -.2379075
       itd718 |    .076725   .0062041    12.37   0.000     .0642697    .0891802
       itd719 |   .0099891   .0060151     1.66   0.103    -.0020866    .0220649
       itd720 |   .1040639   .0056699    18.35   0.000      .092681    .1154468
       itd721 |  -.1116248   .0050768   -21.99   0.000    -.1218169   -.1014326
       itd722 |  -.0780786    .004268   -18.29   0.000    -.0866469   -.0695102
       itd723 |   -.108297   .0041068   -26.37   0.000    -.1165418   -.1000522
       itd724 |  -.1659215   .0026102   -63.57   0.000    -.1711617   -.1606813
       itd725 |  -.1538084   .0020507   -75.00   0.000    -.1579253   -.1496914
       itd726 |   .0705602   .0011085    63.66   0.000     .0683348    .0727855
       itd727 |  -.1049136   .0012999   -80.71   0.000    -.1075232   -.1023039
       itd728 |          0  (omitted)
        _cons |   .0301132   .0114236     2.64   0.011     .0071793    .0530471
--------------+----------------------------------------------------------------
      sigma_u |  .18517994
      sigma_e |  .18003634
          rho |  .51408091   (fraction of variance due to u_i)
-------------------------------------------------------------------------------

. *
. keep if  condition_around == 1 /* prediction only on minerals with reliable prices */
(5,026 observations deleted)

. *
. cap drop benchLPM_nb

. predict  benchLPM_nb 
(option xb assumed; fitted values)
(238 missing values generated)

. sum benchLPM_nb, d

                      Linear prediction
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.2110492      -.5563228
 5%    -.0850236      -.5563228
10%    -.0391937      -.5563228       Obs             139,426
25%     .0164282      -.5563228       Sum of Wgt.     139,426

50%     .0301132                      Mean           .0552623
                        Largest       Std. Dev.      .1275541
75%      .056747        1.05653
90%     .1980822       1.063698       Variance         .01627
95%     .2959044       1.064999       Skewness       2.601765
99%     .5157344       1.064999       Kurtosis       17.70228

. *
. tsset cell year
       panel variable:  cell (strongly balanced)
        time variable:  year, 1997 to 2010
                delta:  1 unit

. /* counterfactual: put all prices to their 97 level */
. sort  mainmineral 

. merge mainmineral using  "$Output_data\tempzz", nokeep
(note: you are using old merge syntax; see [D] merge for new syntax)
variable mainmineral does not uniquely identify observations in the master data

. tab  _merge

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    137,494       98.45       98.45
          3 |      2,170        1.55      100.00
------------+-----------------------------------
      Total |    139,664      100.00

. drop _merge

. *
. rename mainmineral_around mainmineral_a

. sort  mainmineral_a

. merge mainmineral_a using "$Output_data\tempyy", nokeep
(note: you are using old merge syntax; see [D] merge for new syntax)
variable mainmineral_a does not uniquely identify observations in the master data

. tab  _merge

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    119,070       85.25       85.25
          3 |     20,594       14.75      100.00
------------+-----------------------------------
      Total |    139,664      100.00

. drop _merge

. *
. replace main_lprice         = main_lprice97   if main_lprice   != 0
(2,358 real changes made, 434 to missing)

. replace main_lprice_a       = main_lprice_a97 if main_lprice_a != 0
(21,685 real changes made, 2,562 to missing)

. *
. cap drop counterLPM_nb

. predict counterLPM_nb
(option xb assumed; fitted values)
(2,884 missing values generated)

. sum counterLPM_nb, d

                      Linear prediction
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.2110492      -.5690151
 5%    -.0856993      -.5690151
10%    -.0409979      -.5690151       Obs             136,780
25%     .0156887      -.5690151       Sum of Wgt.     136,780

50%     .0301132                      Mean           .0527303
                        Largest       Std. Dev.      .1246003
75%     .0526284       1.028428
90%     .1899998        1.03126       Variance       .0155252
95%     .2904443       1.069358       Skewness       2.558452
99%     .4858691       1.069358       Kurtosis       17.78632

. 
. /* how many events did not happen? */
. g diff = benchLPM_nb-counterLPM_nb
(2,884 missing values generated)

. sum diff, d

                            diff
-------------------------------------------------------------
      Percentiles      Smallest
 1%     -.003587      -.0193168
 5%            0      -.0182105
10%            0      -.0174274       Obs             136,780
25%            0      -.0162951       Sum of Wgt.     136,780

50%            0                      Mean           .0010086
                        Largest       Std. Dev.      .0048726
75%            0       .0882511
90%            0       .0949188       Variance       .0000237
95%     .0089804       .0991063       Skewness       6.868244
99%      .019197       .1069485       Kurtosis       70.33439

. /* drop 1997 (no change by definition) */
. drop if year == 1997
(9,976 observations deleted)

. /* keep if comparison can be made */
. replace counterLPM_nb = . if benchLPM_nb   ==.
(0 real changes made)

. replace benchLPM_nb   = . if counterLPM_nb ==.
(2,457 real changes made, 2,457 to missing)

. drop if counterLPM_nb == . | benchLPM_nb  == . | nb_acled == .
(2,678 observations deleted)

. save "$Output_data\tempzz", replace
file Data_Code_BCRT_AER\Data\tempzz.dta saved

. 
. *****************************************
. * cell level effect for map (Figure A5) *
. *****************************************
. 
. use "$Output_data\tempzz", clear

. keep if year == 2010
(117,240 observations deleted)

. collapse (mean) benchLPM_nb counterLPM_nb, by(gid)

. g share = abs((counterLPM_nb-benchLPM_nb)/benchLPM_nb)

. keep gid share

. sum share if share>0, d

                            share
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0066455       .0066455
 5%     .0373975       .0066455
10%      .049528       .0066455       Obs               1,477
25%     .0605444       .0066455       Sum of Wgt.       1,477

50%     .0628991                      Mean           .0803987
                        Largest       Std. Dev.      .0438608
75%     .0986635       .2575703
90%     .1263836       .2649203       Variance       .0019238
95%     .1974014       .2649203       Skewness       1.849494
99%     .2128279       .2804809       Kurtosis       6.580442

. drop if share == .
(0 observations deleted)

. g share_bin = . 
(9,770 missing values generated)

. replace share_bin = 0 if share == 0
(8,293 real changes made)

. replace share_bin = 1 if share > 0.000 & share <= 0.050
(168 real changes made)

. replace share_bin = 2 if share > 0.050 & share <= 0.075
(806 real changes made)

. replace share_bin = 3 if share > 0.075 & share <= 0.100
(260 real changes made)

. replace share_bin = 4 if share > 0.100
(243 real changes made)

. drop share

. sort gid

. save "$Output_data\Figure_A5", replace
(note: file Data_Code_BCRT_AER\Data\Figure_A5.dta not found)
file Data_Code_BCRT_AER\Data\Figure_A5.dta saved

. outsheet using "$Results\Figure_A5.csv", comma replace
(note: file Data_Code_BCRT_AER\results\Figure_A5.csv not found)

. *
. erase  "$Output_data\tempzz.dta"

. erase  "$Output_data\tempyy.dta"

. erase  "$Output_data\Figure_A5.dta"

. 
. *----------------------------*
. /* FIGURE A6 (Web appendix)*/
. *----------------------------*
. 
. // Specification used is column 3 of baseline Table 2
. 
. /*get 97 mineral prices of the cell */
. use "$Output_data\BCRT_baseline", clear

. drop if main_lprice == . | main_lprice == 0
(141,470 observations deleted)

. keep if mines == 1
(780 observations deleted)

. collapse (mean) main_lprice, by(mainmineral year)

. keep if year == 1997
(180 observations deleted)

. rename main_lprice main_lprice97

. keep mainmineral main_lprice

. sort mainmineral

. save "$Output_data\tempzz", replace
(note: file Data_Code_BCRT_AER\Data\tempzz.dta not found)
file Data_Code_BCRT_AER\Data\tempzz.dta saved

. 
. /*get 97 mineral prices of the surrounding cells */
. use "$Output_data\BCRT_baseline", clear

. drop if main_lprice == . | main_lprice == 0
(141,470 observations deleted)

. keep if mines == 1
(780 observations deleted)

. collapse (mean) main_lprice, by(mainmineral year)

. keep if year == 1997
(180 observations deleted)

. rename main_lprice main_lprice_a97

. rename mainmineral mainmineral_a 

. keep mainmineral_a main_lprice_a97

. sort mainmineral_a

. save "$Output_data\tempyy", replace
(note: file Data_Code_BCRT_AER\Data\tempyy.dta not found)
file Data_Code_BCRT_AER\Data\tempyy.dta saved

. *
. use "$Output_data\BCRT_baseline", clear

. 
. qui tab it, gen(itd)

. drop    main_lprice 

. rename  main_lprice_mines main_lprice

. 
. g condition_around = (mainmineral != "diamond" & mainmineral_around != "diamond" & mainmineral != "tantalum" & mainmineral_around != "tantalum")

. 
. /*estimation*/
. xtreg acled  main_lprice main_lprice_a itd* if  sd_mines == 0  & sd_mines_a ==0 & condition_around == 1, fe cluster(country_nb)
note: itd14 omitted because of collinearity
note: itd28 omitted because of collinearity
note: itd40 omitted because of collinearity
note: itd56 omitted because of collinearity
note: itd67 omitted because of collinearity
note: itd84 omitted because of collinearity
note: itd98 omitted because of collinearity
note: itd112 omitted because of collinearity
note: itd115 omitted because of collinearity
note: itd135 omitted because of collinearity
note: itd144 omitted because of collinearity
note: itd157 omitted because of collinearity
note: itd172 omitted because of collinearity
note: itd185 omitted because of collinearity
note: itd208 omitted because of collinearity
note: itd211 omitted because of collinearity
note: itd238 omitted because of collinearity
note: itd243 omitted because of collinearity
note: itd255 omitted because of collinearity
note: itd280 omitted because of collinearity
note: itd284 omitted because of collinearity
note: itd304 omitted because of collinearity
note: itd320 omitted because of collinearity
note: itd325 omitted because of collinearity
note: itd350 omitted because of collinearity
note: itd351 omitted because of collinearity
note: itd367 omitted because of collinearity
note: itd390 omitted because of collinearity
note: itd406 omitted because of collinearity
note: itd409 omitted because of collinearity
note: itd434 omitted because of collinearity
note: itd448 omitted because of collinearity
note: itd449 omitted because of collinearity
note: itd469 omitted because of collinearity
note: itd482 omitted because of collinearity
note: itd504 omitted because of collinearity
note: itd506 omitted because of collinearity
note: itd521 omitted because of collinearity
note: itd546 omitted because of collinearity
note: itd558 omitted because of collinearity
note: itd570 omitted because of collinearity
note: itd588 omitted because of collinearity
note: itd592 omitted because of collinearity
note: itd603 omitted because of collinearity
note: itd604 omitted because of collinearity
note: itd605 omitted because of collinearity
note: itd606 omitted because of collinearity
note: itd607 omitted because of collinearity
note: itd608 omitted because of collinearity
note: itd609 omitted because of collinearity
note: itd610 omitted because of collinearity
note: itd611 omitted because of collinearity
note: itd612 omitted because of collinearity
note: itd613 omitted because of collinearity
note: itd614 omitted because of collinearity
note: itd615 omitted because of collinearity
note: itd616 omitted because of collinearity
note: itd630 omitted because of collinearity
note: itd642 omitted because of collinearity
note: itd651 omitted because of collinearity
note: itd661 omitted because of collinearity
note: itd684 omitted because of collinearity
note: itd700 omitted because of collinearity
note: itd703 omitted because of collinearity
note: itd716 omitted because of collinearity

Fixed-effects (within) regression               Number of obs      =    127974
Group variable: cell                            Number of groups   =      9141

R-sq:  within  = 0.0479                         Obs per group: min =        14
       between = 0.0056                                        avg =      14.0
       overall = 0.0090                                        max =        14

                                                F(2,50)            =         .
corr(u_i, Xb)  = -0.5993                        Prob > F           =         .

                             (Std. Err. adjusted for 51 clusters in country_nb)
-------------------------------------------------------------------------------
              |               Robust
        acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
  main_lprice |   .0600584    .023755     2.53   0.015     .0123451    .1077718
main_lprice_a |   .0207079   .0093979     2.20   0.032     .0018317     .039584
         itd1 |   .1562839   .0000543  2880.27   0.000      .156175    .1563929
         itd2 |    .211109   .0000681  3099.04   0.000     .2109722    .2112458
         itd3 |   .2467287   .0000696  3545.97   0.000     .2465889    .2468684
         itd4 |    .169998   .0000613  2774.80   0.000      .169875    .1701211
         itd5 |   .1371312   .0000658  2085.46   0.000     .1369991    .1372633
         itd6 |   .0302825   .0000661   458.44   0.000     .0301499    .0304152
         itd7 |   .0083574   .0000627   133.20   0.000     .0082314    .0084834
         itd8 |   .0028323    .000042    67.42   0.000     .0027479    .0029167
         itd9 |    .005547   .0000306   180.99   0.000     .0054854    .0056085
        itd10 |   .0109605   7.14e-07  1.5e+04   0.000      .010959    .0109619
        itd11 |   .0137006   8.99e-07  1.5e+04   0.000     .0136988    .0137024
        itd12 |   .0082323   5.97e-06  1378.41   0.000     .0082203    .0082443
        itd13 |   .0109984   .0000179   613.39   0.000     .0109624    .0110344
        itd14 |          0  (omitted)
        itd15 |  -4.35e-15   6.99e-15    -0.62   0.536    -1.84e-14    9.69e-15
        itd16 |  -4.35e-15   6.97e-15    -0.62   0.535    -1.84e-14    9.65e-15
        itd17 |  -4.31e-15   6.95e-15    -0.62   0.538    -1.83e-14    9.65e-15
        itd18 |  -4.33e-15   6.97e-15    -0.62   0.537    -1.83e-14    9.67e-15
        itd19 |  -4.33e-15   6.96e-15    -0.62   0.537    -1.83e-14    9.65e-15
        itd20 |  -4.31e-15   6.98e-15    -0.62   0.539    -1.83e-14    9.70e-15
        itd21 |  -4.28e-15   6.93e-15    -0.62   0.540    -1.82e-14    9.65e-15
        itd22 |        -.3   6.74e-15 -4.5e+13   0.000          -.3         -.3
        itd23 |        -.2   6.66e-15 -3.0e+13   0.000          -.2         -.2
        itd24 |        -.2   6.55e-15 -3.1e+13   0.000          -.2         -.2
        itd25 |        -.3   6.68e-15 -4.5e+13   0.000          -.3         -.3
        itd26 |        -.1   6.99e-15 -1.4e+13   0.000          -.1         -.1
        itd27 |  -4.27e-15   6.93e-15    -0.62   0.540    -1.82e-14    9.65e-15
        itd28 |          0  (omitted)
        itd29 |   .0057762   .0026214     2.20   0.032     .0005109    .0110415
        itd30 |   .0292959   .0024899    11.77   0.000     .0242948     .034297
        itd31 |   .0053533   .0024295     2.20   0.032     .0004735     .010233
        itd32 |   .0053135   .0024115     2.20   0.032       .00047    .0101571
        itd33 |   .0291074   .0024043    12.11   0.000     .0242781    .0339367
        itd34 |   .0053792   .0024413     2.20   0.032     .0004758    .0102827
        itd35 |   .0057587   .0026135     2.20   0.032     .0005094     .011008
        itd36 |   .0057546   .0026116     2.20   0.032      .000509    .0110002
        itd37 |    .005768   .0026177     2.20   0.032     .0005102    .0110259
        itd38 |     .00568   .0025778     2.20   0.032     .0005024    .0108577
        itd39 |   .0044615   .0020248     2.20   0.032     .0003946    .0085284
        itd40 |          0  (omitted)
        itd41 |   .0028862   .0013099     2.20   0.032     .0002553    .0055171
        itd42 |    .002949   .0013384     2.20   0.032     .0002608    .0056372
        itd43 |  -.0666667   3.01e-14 -2.2e+12   0.000    -.0666667   -.0666667
        itd44 |  -.0666667   3.23e-14 -2.1e+12   0.000    -.0666667   -.0666667
        itd45 |  -1.19e-14   3.21e-14    -0.37   0.712    -7.64e-14    5.26e-14
        itd46 |  -.0666667   3.23e-14 -2.1e+12   0.000    -.0666667   -.0666667
        itd47 |  -.0666667   3.23e-14 -2.1e+12   0.000    -.0666667   -.0666667
        itd48 |  -1.19e-14   3.21e-14    -0.37   0.712    -7.64e-14    5.26e-14
        itd49 |  -.0666667   3.23e-14 -2.1e+12   0.000    -.0666667   -.0666667
        itd50 |  -.0666667   3.23e-14 -2.1e+12   0.000    -.0666667   -.0666667
        itd51 |  -.0666667   3.23e-14 -2.1e+12   0.000    -.0666667   -.0666667
        itd52 |  -.0666667   3.23e-14 -2.1e+12   0.000    -.0666667   -.0666667
        itd53 |  -.0666667   3.23e-14 -2.1e+12   0.000    -.0666667   -.0666667
        itd54 |  -1.19e-14   3.21e-14    -0.37   0.712    -7.64e-14    5.26e-14
        itd55 |  -.0666667   3.23e-14 -2.1e+12   0.000    -.0666667   -.0666667
        itd56 |          0  (omitted)
        itd57 |  -.0027009   .0013489    -2.00   0.051    -.0054101    8.42e-06
        itd58 |  -.0018632   .0015497    -1.20   0.235    -.0049758    .0012494
        itd59 |   .0050111   .0014002     3.58   0.001     .0021987    .0078236
        itd60 |  -.0036472   .0010849    -3.36   0.001    -.0058263   -.0014682
        itd61 |   .0045737   .0012421     3.68   0.001     .0020789    .0070685
        itd62 |    .004181   .0011355     3.68   0.001     .0019004    .0064616
        itd63 |  -.0041523    .000915    -4.54   0.000    -.0059903   -.0023144
        itd64 |  -.0049292   .0007116    -6.93   0.000    -.0063584      -.0035
        itd65 |   .0023848    .000641     3.72   0.001     .0010974    .0036723
        itd66 |  -.0065079   .0002677   -24.31   0.000    -.0070455   -.0059703
        itd67 |          0  (omitted)
        itd68 |   .0013166   .0002958     4.45   0.000     .0007224    .0019107
        itd69 |   .0096537   .0005073    19.03   0.000     .0086349    .0106726
        itd70 |  -.0065673   .0002008   -32.71   0.000    -.0069706   -.0061639
        itd71 |  -.0940594   6.54e-13 -1.4e+11   0.000    -.0940594   -.0940594
        itd72 |  -.0742574   7.60e-13 -9.8e+10   0.000    -.0742574   -.0742574
        itd73 |  -.0990099   6.54e-13 -1.5e+11   0.000    -.0990099   -.0990099
        itd74 |  -.0940594   6.54e-13 -1.4e+11   0.000    -.0940594   -.0940594
        itd75 |  -.0841584   6.56e-13 -1.3e+11   0.000    -.0841584   -.0841584
        itd76 |  -.0346535   6.61e-13 -5.2e+10   0.000    -.0346535   -.0346535
        itd77 |   -.049505   7.08e-13 -7.0e+10   0.000     -.049505    -.049505
        itd78 |  -.0693069   7.59e-13 -9.1e+10   0.000    -.0693069   -.0693069
        itd79 |  -.0643564   7.04e-13 -9.1e+10   0.000    -.0643564   -.0643564
        itd80 |  -.0346535   6.59e-13 -5.3e+10   0.000    -.0346535   -.0346535
        itd81 |   -.039604   7.60e-13 -5.2e+10   0.000     -.039604    -.039604
        itd82 |   -.019802   6.55e-13 -3.0e+10   0.000     -.019802    -.019802
        itd83 |  -.0346535   6.56e-13 -5.3e+10   0.000    -.0346535   -.0346535
        itd84 |          0  (omitted)
        itd85 |  -.0625303   .0022925   -27.28   0.000    -.0671349   -.0579257
        itd86 |  -.0388525   .0024262   -16.01   0.000    -.0437256   -.0339795
        itd87 |  -.0153995   .0024886    -6.19   0.000    -.0203981   -.0104009
        itd88 |    -.03878   .0024491   -15.83   0.000    -.0436992   -.0338608
        itd89 |  -.0621753    .002405   -25.85   0.000    -.0670058   -.0573448
        itd90 |   -.016537   .0021283    -7.77   0.000    -.0208118   -.0122621
        itd91 |   .0759154   .0019475    38.98   0.000     .0720038    .0798271
        itd92 |  -.0638949   .0018602   -34.35   0.000    -.0676313   -.0601585
        itd93 |  -.0177208   .0017533   -10.11   0.000    -.0212424   -.0141992
        itd94 |  -.0660025   .0011926   -55.34   0.000    -.0683979    -.063607
        itd95 |  -.0665082   .0010324   -64.42   0.000    -.0685819   -.0644345
        itd96 |  -.0441757   .0007399   -59.70   0.000    -.0456619   -.0426895
        itd97 |  -.0685393    .000389  -176.18   0.000    -.0693207   -.0677579
        itd98 |          0  (omitted)
        itd99 |   .0130719   1.81e-13  7.2e+10   0.000     .0130719    .0130719
       itd100 |  -.0065359   1.81e-13 -3.6e+10   0.000    -.0065359   -.0065359
       itd101 |  -.0130719   1.79e-13 -7.3e+10   0.000    -.0130719   -.0130719
       itd102 |  -.0130719   1.79e-13 -7.3e+10   0.000    -.0130719   -.0130719
       itd103 |  -.0065359   1.81e-13 -3.6e+10   0.000    -.0065359   -.0065359
       itd104 |  -.0130719   1.79e-13 -7.3e+10   0.000    -.0130719   -.0130719
       itd105 |  -.0130719   1.79e-13 -7.3e+10   0.000    -.0130719   -.0130719
       itd106 |   .0196078   1.80e-13  1.1e+11   0.000     .0196078    .0196078
       itd107 |   .0326797   1.77e-13  1.8e+11   0.000     .0326797    .0326797
       itd108 |   1.54e-13   1.79e-13     0.86   0.394    -2.05e-13    5.13e-13
       itd109 |   .0457516   1.75e-13  2.6e+11   0.000     .0457516    .0457516
       itd110 |   .0130719   1.80e-13  7.2e+10   0.000     .0130719    .0130719
       itd111 |   .0196078   1.80e-13  1.1e+11   0.000     .0196078    .0196078
       itd112 |          0  (omitted)
       itd113 |  -.0673751   .0001796  -375.22   0.000    -.0677358   -.0670145
       itd114 |   -.075548   .0000239 -3159.16   0.000     -.075596   -.0754999
       itd115 |          0  (omitted)
       itd116 |   -.120769   .0000872 -1385.70   0.000     -.120944   -.1205939
       itd117 |  -.0698331   .0000502 -1391.18   0.000     -.069934   -.0697323
       itd118 |  -.0829988   .0000906  -915.62   0.000    -.0831809   -.0828168
       itd119 |  -.1354376    .000151  -896.84   0.000     -.135741   -.1351343
       itd120 |  -.1216785   .0003658  -332.62   0.000    -.1224133   -.1209438
       itd121 |  -.0858318   .0004929  -174.12   0.000    -.0868219   -.0848417
       itd122 |  -.0958082   .0008712  -109.97   0.000    -.0975582   -.0940583
       itd123 |  -.1219925   .0008943  -136.41   0.000    -.1237887   -.1201962
       itd124 |  -.0987147   .0008904  -110.87   0.000     -.100503   -.0969263
       itd125 |  -.0534515    .000829   -64.48   0.000    -.0551165   -.0517865
       itd126 |  -.1166423   .0010637  -109.66   0.000    -.1187787   -.1145058
       itd127 |   .0275229   2.20e-13  1.3e+11   0.000     .0275229    .0275229
       itd128 |   .0366972   2.17e-13  1.7e+11   0.000     .0366972    .0366972
       itd129 |   .1559633   2.13e-13  7.3e+11   0.000     .1559633    .1559633
       itd130 |   2.15e-13   2.30e-13     0.93   0.356    -2.48e-13    6.77e-13
       itd131 |  -.0275229   2.19e-13 -1.3e+11   0.000    -.0275229   -.0275229
       itd132 |   .0183486   2.17e-13  8.4e+10   0.000     .0183486    .0183486
       itd133 |  -.0183486   2.19e-13 -8.4e+10   0.000    -.0183486   -.0183486
       itd134 |  -.0275229   2.19e-13 -1.3e+11   0.000    -.0275229   -.0275229
       itd135 |          0  (omitted)
       itd136 |  -.0275229   2.17e-13 -1.3e+11   0.000    -.0275229   -.0275229
       itd137 |  -.0275229   2.17e-13 -1.3e+11   0.000    -.0275229   -.0275229
       itd138 |  -.0366972   2.08e-13 -1.8e+11   0.000    -.0366972   -.0366972
       itd139 |  -.0275229   2.17e-13 -1.3e+11   0.000    -.0275229   -.0275229
       itd140 |  -.0275229   2.17e-13 -1.3e+11   0.000    -.0275229   -.0275229
       itd141 |  -7.45e-13   7.96e-13    -0.94   0.354    -2.34e-12    8.53e-13
       itd142 |  -7.45e-13   7.96e-13    -0.94   0.354    -2.34e-12    8.53e-13
       itd143 |  -7.45e-13   7.96e-13    -0.94   0.354    -2.34e-12    8.53e-13
       itd144 |          0  (omitted)
       itd145 |  -7.45e-13   7.96e-13    -0.94   0.354    -2.34e-12    8.53e-13
       itd146 |  -7.45e-13   7.96e-13    -0.94   0.354    -2.34e-12    8.53e-13
       itd147 |  -7.45e-13   7.96e-13    -0.94   0.354    -2.34e-12    8.53e-13
       itd148 |  -7.45e-13   7.96e-13    -0.94   0.354    -2.34e-12    8.53e-13
       itd149 |  -7.45e-13   7.96e-13    -0.94   0.354    -2.34e-12    8.53e-13
       itd150 |  -7.45e-13   7.96e-13    -0.94   0.354    -2.34e-12    8.53e-13
       itd151 |  -7.45e-13   7.96e-13    -0.94   0.354    -2.34e-12    8.53e-13
       itd152 |  -7.45e-13   7.96e-13    -0.94   0.354    -2.34e-12    8.53e-13
       itd153 |  -7.45e-13   7.96e-13    -0.94   0.354    -2.34e-12    8.53e-13
       itd154 |  -7.45e-13   7.96e-13    -0.94   0.354    -2.34e-12    8.53e-13
       itd155 |  -5.40e-13   5.79e-13    -0.93   0.355    -1.70e-12    6.23e-13
       itd156 |  -5.40e-13   5.79e-13    -0.93   0.355    -1.70e-12    6.23e-13
       itd157 |          0  (omitted)
       itd158 |  -5.40e-13   5.79e-13    -0.93   0.355    -1.70e-12    6.23e-13
       itd159 |  -5.40e-13   5.79e-13    -0.93   0.355    -1.70e-12    6.23e-13
       itd160 |  -5.40e-13   5.79e-13    -0.93   0.355    -1.70e-12    6.23e-13
       itd161 |  -5.40e-13   5.79e-13    -0.93   0.355    -1.70e-12    6.23e-13
       itd162 |  -5.40e-13   5.79e-13    -0.93   0.355    -1.70e-12    6.23e-13
       itd163 |  -5.40e-13   5.79e-13    -0.93   0.355    -1.70e-12    6.23e-13
       itd164 |  -5.40e-13   5.79e-13    -0.93   0.355    -1.70e-12    6.23e-13
       itd165 |  -5.40e-13   5.79e-13    -0.93   0.355    -1.70e-12    6.23e-13
       itd166 |  -5.40e-13   5.79e-13    -0.93   0.355    -1.70e-12    6.23e-13
       itd167 |  -5.40e-13   5.79e-13    -0.93   0.355    -1.70e-12    6.23e-13
       itd168 |  -5.40e-13   5.79e-13    -0.93   0.355    -1.70e-12    6.23e-13
       itd169 |      -.125   3.22e-13 -3.9e+11   0.000        -.125       -.125
       itd170 |      -.125   3.22e-13 -3.9e+11   0.000        -.125       -.125
       itd171 |  -1.90e-13   3.18e-13    -0.60   0.553    -8.29e-13    4.49e-13
       itd172 |          0  (omitted)
       itd173 |  -1.90e-13   3.18e-13    -0.60   0.553    -8.29e-13    4.49e-13
       itd174 |  -1.90e-13   3.18e-13    -0.60   0.553    -8.29e-13    4.48e-13
       itd175 |  -1.90e-13   3.18e-13    -0.60   0.553    -8.29e-13    4.48e-13
       itd176 |       .125   3.18e-13  3.9e+11   0.000         .125        .125
       itd177 |  -1.90e-13   3.18e-13    -0.60   0.553    -8.29e-13    4.48e-13
       itd178 |  -1.90e-13   3.18e-13    -0.60   0.553    -8.29e-13    4.48e-13
       itd179 |  -1.90e-13   3.18e-13    -0.60   0.553    -8.29e-13    4.48e-13
       itd180 |  -1.91e-13   3.18e-13    -0.60   0.551    -8.31e-13    4.49e-13
       itd181 |      -.125   3.22e-13 -3.9e+11   0.000        -.125       -.125
       itd182 |       .125   3.19e-13  3.9e+11   0.000         .125        .125
       itd183 |   .0241694   .0000344   701.91   0.000     .0241002    .0242385
       itd184 |   .0023722   .0000199   119.49   0.000     .0023324    .0024121
       itd185 |          0  (omitted)
       itd186 |   .0314968   4.47e-06  7043.90   0.000     .0314879    .0315058
       itd187 |   .0132352   .0000347   381.53   0.000     .0131655    .0133048
       itd188 |  -.0001694   .0000626    -2.71   0.009     -.000295   -.0000437
       itd189 |   .0058411   .0000859    67.96   0.000     .0056685    .0060138
       itd190 |   .0201895   .0001687   119.68   0.000     .0198507    .0205283
       itd191 |  -.0018748   .0002547    -7.36   0.000    -.0023864   -.0013633
       itd192 |   .0196479   .0003721    52.80   0.000     .0189005    .0203953
       itd193 |   .0178895   .0005738    31.18   0.000      .016737     .019042
       itd194 |   .0209895   .0007353    28.55   0.000     .0195126    .0224663
       itd195 |   .0444457   .0006048    73.48   0.000     .0432309    .0456606
       itd196 |   .0161696    .000751    21.53   0.000     .0146612     .017678
       itd197 |    -.01874   .0009526   -19.67   0.000    -.0206533   -.0168267
       itd198 |  -.0400841   .0009017   -44.45   0.000    -.0418952   -.0382729
       itd199 |  -.0338639   .0009632   -35.16   0.000    -.0357985   -.0319292
       itd200 |  -.0127559   .0009231   -13.82   0.000      -.01461   -.0109019
       itd201 |  -.0341265    .000862   -39.59   0.000    -.0358579    -.032395
       itd202 |  -.0189444   .0008738   -21.68   0.000    -.0206995   -.0171893
       itd203 |  -.0310974   .0008616   -36.09   0.000    -.0328279   -.0293669
       itd204 |  -.0373212   .0007987   -46.73   0.000    -.0389254    -.035717
       itd205 |  -.0139401   .0004668   -29.87   0.000    -.0148777   -.0130026
       itd206 |  -.0412855   .0004388   -94.09   0.000    -.0421668   -.0404042
       itd207 |  -.0209382   .0001056  -198.37   0.000    -.0211502   -.0207262
       itd208 |          0  (omitted)
       itd209 |  -.0171696     .00039   -44.02   0.000     -.017953   -.0163863
       itd210 |  -.0090384   .0000202  -446.70   0.000     -.009079   -.0089978
       itd211 |          0  (omitted)
       itd212 |   .2040816   2.91e-13  7.0e+11   0.000     .2040816    .2040816
       itd213 |   .2040816   2.91e-13  7.0e+11   0.000     .2040816    .2040816
       itd214 |   .2244898   2.92e-13  7.7e+11   0.000     .2244898    .2244898
       itd215 |   2.58e-13   2.96e-13     0.87   0.387    -3.36e-13    8.52e-13
       itd216 |   .0204082   2.96e-13  6.9e+10   0.000     .0204082    .0204082
       itd217 |   .0816327   2.94e-13  2.8e+11   0.000     .0816327    .0816327
       itd218 |   .0408163   2.95e-13  1.4e+11   0.000     .0408163    .0408163
       itd219 |   .0204082   2.96e-13  6.9e+10   0.000     .0204082    .0204082
       itd220 |   .0408163   2.95e-13  1.4e+11   0.000     .0408163    .0408163
       itd221 |   .0204082   2.96e-13  6.9e+10   0.000     .0204082    .0204082
       itd222 |   .1020408   2.96e-13  3.5e+11   0.000     .1020408    .1020408
       itd223 |   .0816327   2.94e-13  2.8e+11   0.000     .0816327    .0816327
       itd224 |   2.58e-13   2.96e-13     0.87   0.387    -3.36e-13    8.52e-13
       itd225 |  -.1237096   .0002722  -454.50   0.000    -.1242563   -.1231629
       itd226 |  -.0932879   .0002881  -323.85   0.000    -.0938665   -.0927094
       itd227 |  -.0932716   .0002955  -315.67   0.000    -.0938651   -.0926781
       itd228 |  -.0628952   .0002908  -216.30   0.000    -.0634792   -.0623111
       itd229 |  -.1071056   .0002855  -375.10   0.000    -.1076792   -.1065321
       itd230 |   .0585678   .0002527   231.77   0.000     .0580603    .0590754
       itd231 |  -.0713137   .0002312  -308.42   0.000    -.0717781   -.0708493
       itd232 |  -.0354249   .0002209  -160.39   0.000    -.0358686   -.0349813
       itd233 |  -.0713645   .0002082  -342.82   0.000    -.0717826   -.0709464
       itd234 |  -.0853234   .0001416  -602.57   0.000    -.0856078   -.0850389
       itd235 |   -.115752   .0001226  -944.31   0.000    -.1159982   -.1155058
       itd236 |  -.0799169   .0000879  -909.66   0.000    -.0800934   -.0797405
       itd237 |  -.0440971   .0000462  -954.69   0.000    -.0441899   -.0440043
       itd238 |          0  (omitted)
       itd239 |   2.17e-14   3.80e-14     0.57   0.570    -5.45e-14    9.80e-14
       itd240 |   -.010989   3.88e-14 -2.8e+11   0.000     -.010989    -.010989
       itd241 |   -.010989   3.89e-14 -2.8e+11   0.000     -.010989    -.010989
       itd242 |   2.18e-14   3.81e-14     0.57   0.571    -5.48e-14    9.83e-14
       itd243 |          0  (omitted)
       itd244 |   -.010989   3.91e-14 -2.8e+11   0.000     -.010989    -.010989
       itd245 |   -.010989   3.88e-14 -2.8e+11   0.000     -.010989    -.010989
       itd246 |   2.22e-14   3.82e-14     0.58   0.564    -5.45e-14    9.89e-14
       itd247 |   -.010989   3.88e-14 -2.8e+11   0.000     -.010989    -.010989
       itd248 |   -.010989   3.88e-14 -2.8e+11   0.000     -.010989    -.010989
       itd249 |   -.021978   3.68e-14 -6.0e+11   0.000     -.021978    -.021978
       itd250 |   -.010989   3.89e-14 -2.8e+11   0.000     -.010989    -.010989
       itd251 |   2.20e-14   3.82e-14     0.58   0.566    -5.46e-14    9.87e-14
       itd252 |   -.010989   3.88e-14 -2.8e+11   0.000     -.010989    -.010989
       itd253 |   .0352104   .0002822   124.79   0.000     .0346436    .0357771
       itd254 |   .0178141     .00009   197.84   0.000     .0176332    .0179949
       itd255 |          0  (omitted)
       itd256 |   .0360996   .0000695   519.37   0.000     .0359599    .0362392
       itd257 |   .0176298   .0001442   122.24   0.000     .0173401    .0179195
       itd258 |   .0522357   .0005938    87.97   0.000     .0510431    .0534284
       itd259 |   .0693517   .0008545    81.16   0.000     .0676354    .0710679
       itd260 |   .0506079   .0009993    50.65   0.000     .0486009     .052615
       itd261 |   .0135602   .0011749    11.54   0.000     .0112004    .0159201
       itd262 |   .0462971   .0021119    21.92   0.000     .0420552     .050539
       itd263 |   .0267752   .0025025    10.70   0.000     .0217487    .0318017
       itd264 |   .0419411   .0034558    12.14   0.000         .035    .0488823
       itd265 |   .0404199   .0037311    10.83   0.000     .0329258     .047914
       itd266 |   .0015713   .0043682     0.36   0.721    -.0072025    .0103451
       itd267 |  -.0963933   .0042637   -22.61   0.000    -.1049571   -.0878295
       itd268 |  -.0305229   .0050039    -6.10   0.000    -.0405736   -.0204722
       itd269 |   .0544477   .0049825    10.93   0.000     .0444402    .0644553
       itd270 |   .0096806   .0042213     2.29   0.026      .001202    .0181593
       itd271 |  -.0114803   .0042428    -2.71   0.009    -.0200021   -.0029584
       itd272 |  -.0966617   .0041089   -23.52   0.000    -.1049148   -.0884087
       itd273 |  -.0758678   .0038756   -19.58   0.000    -.0836521   -.0680834
       itd274 |  -.0776607   .0032374   -23.99   0.000    -.0841633   -.0711581
       itd275 |  -.0577533   .0027353   -21.11   0.000    -.0632474   -.0522592
       itd276 |  -.0848556   .0006073  -139.72   0.000    -.0860754   -.0836357
       itd277 |   .0427511   .0005203    82.17   0.000     .0417061    .0437961
       itd278 |  -.1057586   .0005178  -204.24   0.000    -.1067986   -.1047185
       itd279 |   .0258625   .0017036    15.18   0.000     .0224406    .0292843
       itd280 |          0  (omitted)
       itd281 |  -2.88e-13   3.88e-13    -0.74   0.461    -1.07e-12    4.90e-13
       itd282 |  -2.88e-13   3.88e-13    -0.74   0.461    -1.07e-12    4.91e-13
       itd283 |  -2.88e-13   3.88e-13    -0.74   0.461    -1.07e-12    4.90e-13
       itd284 |          0  (omitted)
       itd285 |  -2.88e-13   3.88e-13    -0.74   0.461    -1.07e-12    4.90e-13
       itd286 |         .5   3.83e-13  1.3e+12   0.000           .5          .5
       itd287 |         .5   3.83e-13  1.3e+12   0.000           .5          .5
       itd288 |  -2.88e-13   3.88e-13    -0.74   0.461    -1.07e-12    4.90e-13
       itd289 |  -2.88e-13   3.88e-13    -0.74   0.461    -1.07e-12    4.90e-13
       itd290 |  -2.88e-13   3.88e-13    -0.74   0.461    -1.07e-12    4.90e-13
       itd291 |  -2.88e-13   3.88e-13    -0.74   0.461    -1.07e-12    4.90e-13
       itd292 |  -2.88e-13   3.88e-13    -0.74   0.461    -1.07e-12    4.90e-13
       itd293 |  -2.88e-13   3.88e-13    -0.74   0.461    -1.07e-12    4.90e-13
       itd294 |        -.5   3.83e-13 -1.3e+12   0.000          -.5         -.5
       itd295 |   .1565953   .0012476   125.51   0.000     .1540893    .1591012
       itd296 |   .2342422   .0015761   148.62   0.000     .2310764    .2374079
       itd297 |   .0802389   .0015048    53.32   0.000     .0772164    .0832614
       itd298 |   .2331386   .0010753   216.82   0.000     .2309788    .2352983
       itd299 |   .0024894   .0011298     2.20   0.032     .0002202    .0047586
       itd300 |   .0798008    .001306    61.10   0.000     .0771776     .082424
       itd301 |   .1567806   .0013317   117.73   0.000     .1541057    .1594555
       itd302 |   .0022523   .0010222     2.20   0.032     .0001992    .0043054
       itd303 |   .2325622   .0008137   285.80   0.000     .2309278    .2341967
       itd304 |          0  (omitted)
       itd305 |   .0002206   .0001001     2.20   0.032     .0000195    .0004217
       itd306 |   .0008613   .0003909     2.20   0.032     .0000762    .0016463
       itd307 |   .0031987   .0014517     2.20   0.032     .0002829    .0061144
       itd308 |  -.0752157   .0007749   -97.07   0.000    -.0767721   -.0736594
       itd309 |  -5.08e-13   5.50e-13    -0.92   0.359    -1.61e-12    5.95e-13
       itd310 |  -.0833333   5.76e-13 -1.4e+11   0.000    -.0833333   -.0833333
       itd311 |  -.1666667   5.54e-13 -3.0e+11   0.000    -.1666667   -.1666667
       itd312 |  -.0833333   5.77e-13 -1.4e+11   0.000    -.0833333   -.0833333
       itd313 |  -.0833333   5.77e-13 -1.4e+11   0.000    -.0833333   -.0833333
       itd314 |  -.0833333   5.77e-13 -1.4e+11   0.000    -.0833333   -.0833333
       itd315 |  -.0833333   5.77e-13 -1.4e+11   0.000    -.0833333   -.0833333
       itd316 |  -.0833333   5.77e-13 -1.4e+11   0.000    -.0833333   -.0833333
       itd317 |  -.0833333   5.77e-13 -1.4e+11   0.000    -.0833333   -.0833333
       itd318 |  -.1666667   5.54e-13 -3.0e+11   0.000    -.1666667   -.1666667
       itd319 |  -.0833333   5.77e-13 -1.4e+11   0.000    -.0833333   -.0833333
       itd320 |          0  (omitted)
       itd321 |  -.0833333   5.75e-13 -1.4e+11   0.000    -.0833333   -.0833333
       itd322 |  -.0833333   5.75e-13 -1.4e+11   0.000    -.0833333   -.0833333
       itd323 |   -.115909   .0000542 -2137.42   0.000    -.1160179      -.1158
       itd324 |   .0104883   .0000173   607.18   0.000     .0104536    .0105229
       itd325 |          0  (omitted)
       itd326 |  -.0263399   .0000109 -2411.53   0.000    -.0263618   -.0263179
       itd327 |  -.0737352   .0000231 -3187.33   0.000    -.0737817   -.0736887
       itd328 |  -.0107458   .0000996  -107.87   0.000    -.0109459   -.0105457
       itd329 |  -.1055928   .0001496  -705.77   0.000    -.1058933   -.1052923
       itd330 |  -.1003828   .0001737  -577.79   0.000    -.1007318   -.1000339
       itd331 |  -.0372901   .0002033  -183.42   0.000    -.0376984   -.0368817
       itd332 |  -.0744738   .0003583  -207.84   0.000    -.0751935    -.073754
       itd333 |  -.0008871   .0004026    -2.20   0.032    -.0016958   -.0000785
       itd334 |   .0147242   .0004835    30.45   0.000     .0137531    .0156952
       itd335 |  -.0591738   .0005805  -101.94   0.000    -.0603398   -.0580079
       itd336 |  -.0067793   .0006881    -9.85   0.000    -.0081613   -.0053973
       itd337 |   .0833333   2.43e-13  3.4e+11   0.000     .0833333    .0833333
       itd338 |   .1666667   2.47e-13  6.8e+11   0.000     .1666667    .1666667
       itd339 |   .1666667   2.46e-13  6.8e+11   0.000     .1666667    .1666667
       itd340 |   .0833333   2.43e-13  3.4e+11   0.000     .0833333    .0833333
       itd341 |  -1.56e-13   2.49e-13    -0.63   0.533    -6.56e-13    3.44e-13
       itd342 |   .1666667   2.47e-13  6.8e+11   0.000     .1666667    .1666667
       itd343 |         .5   2.35e-13  2.1e+12   0.000           .5          .5
       itd344 |   .0833333   2.43e-13  3.4e+11   0.000     .0833333    .0833333
       itd345 |   .0833333   2.43e-13  3.4e+11   0.000     .0833333    .0833333
       itd346 |   .0833333   2.43e-13  3.4e+11   0.000     .0833333    .0833333
       itd347 |   .0833333   2.43e-13  3.4e+11   0.000     .0833333    .0833333
       itd348 |   .1666667   2.47e-13  6.8e+11   0.000     .1666667    .1666667
       itd349 |  -1.56e-13   2.49e-13    -0.63   0.533    -6.56e-13    3.44e-13
       itd350 |          0  (omitted)
       itd351 |          0  (omitted)
       itd352 |   .0049669   1.62e-12  3.1e+09   0.000     .0049669    .0049669
       itd353 |   .0033113   1.62e-12  2.0e+09   0.000     .0033113    .0033113
       itd354 |   1.54e-12   1.62e-12     0.95   0.345    -1.71e-12    4.78e-12
       itd355 |   1.54e-12   1.62e-12     0.95   0.345    -1.71e-12    4.78e-12
       itd356 |   1.54e-12   1.62e-12     0.95   0.345    -1.71e-12    4.78e-12
       itd357 |  -.0016556   1.62e-12 -1.0e+09   0.000    -.0016556   -.0016556
       itd358 |  -.0016556   1.62e-12 -1.0e+09   0.000    -.0016556   -.0016556
       itd359 |  -.0016556   1.62e-12 -1.0e+09   0.000    -.0016556   -.0016556
       itd360 |   .0016556   1.62e-12  1.0e+09   0.000     .0016556    .0016556
       itd361 |  -.0016556   1.62e-12 -1.0e+09   0.000    -.0016556   -.0016556
       itd362 |   1.54e-12   1.62e-12     0.95   0.345    -1.71e-12    4.78e-12
       itd363 |   1.54e-12   1.62e-12     0.95   0.345    -1.71e-12    4.78e-12
       itd364 |   1.54e-12   1.62e-12     0.95   0.345    -1.71e-12    4.78e-12
       itd365 |   -.001032   .0004683    -2.20   0.032    -.0019726   -.0000913
       itd366 |  -.0003287   .0001492    -2.20   0.032    -.0006284   -.0000291
       itd367 |          0  (omitted)
       itd368 |  -.0002079   .0000943    -2.20   0.032    -.0003973   -.0000184
       itd369 |  -.0004402   .0001998    -2.20   0.032    -.0008415   -.0000389
       itd370 |   .4981043   .0008603   578.96   0.000     .4963762    .4998323
       itd371 |  -.0028471   .0012921    -2.20   0.032    -.0054425   -.0002518
       itd372 |  -.0033062   .0015005    -2.20   0.032    -.0063199   -.0002924
       itd373 |  -.0038688   .0017558    -2.20   0.032    -.0073954   -.0003422
       itd374 |  -.0068188   .0030946    -2.20   0.032    -.0130344   -.0006031
       itd375 |  -.0076617   .0034771    -2.20   0.032    -.0146456   -.0006777
       itd376 |  -.0092005   .0041755    -2.20   0.032    -.0175871   -.0008138
       itd377 |  -.0110467   .0050134    -2.20   0.032    -.0211164   -.0009771
       itd378 |  -.0130936   .0059423    -2.20   0.032     -.025029   -.0011582
       itd379 |    .030757   .0032551     9.45   0.000     .0242189    .0372952
       itd380 |   .0232816   .0031708     7.34   0.000     .0169128    .0296504
       itd381 |  -.0057521    .003169    -1.82   0.076    -.0121172    .0006129
       itd382 |   .0305409   .0032088     9.52   0.000     .0240959     .036986
       itd383 |   .0020631     .00337     0.61   0.543    -.0047057     .008832
       itd384 |   .0094553   .0034111     2.77   0.008     .0026039    .0163068
       itd385 |   .0169001   .0034628     4.88   0.000     .0099448    .0238553
       itd386 |  -.0139166   .0027447    -5.07   0.000    -.0194294   -.0084037
       itd387 |   .0214795   .0024489     8.77   0.000     .0165608    .0263982
       itd388 |  -.0112764   .0010954   -10.29   0.000    -.0134765   -.0090762
       itd389 |   .0231302   .0003943    58.66   0.000     .0223382    .0239221
       itd390 |          0  (omitted)
       itd391 |   .0019908   .0006405     3.11   0.003     .0007043    .0032774
       itd392 |   .0074737   .0000806    92.69   0.000     .0073118    .0076357
       itd393 |   1.76e-12   1.82e-12     0.96   0.339    -1.90e-12    5.42e-12
       itd394 |    .004329   1.82e-12  2.4e+09   0.000      .004329     .004329
       itd395 |   1.76e-12   1.82e-12     0.96   0.339    -1.90e-12    5.42e-12
       itd396 |    .008658   1.74e-12  5.0e+09   0.000      .008658     .008658
       itd397 |    .004329   1.82e-12  2.4e+09   0.000      .004329     .004329
       itd398 |     .04329   1.65e-12  2.6e+10   0.000       .04329      .04329
       itd399 |    .021645   1.75e-12  1.2e+10   0.000      .021645     .021645
       itd400 |    .025974   1.82e-12  1.4e+10   0.000      .025974     .025974
       itd401 |    .008658   1.74e-12  5.0e+09   0.000      .008658     .008658
       itd402 |    .021645   1.74e-12  1.2e+10   0.000      .021645     .021645
       itd403 |    .021645   1.74e-12  1.2e+10   0.000      .021645     .021645
       itd404 |   1.76e-12   1.82e-12     0.96   0.339    -1.90e-12    5.42e-12
       itd405 |    .030303   1.81e-12  1.7e+10   0.000      .030303     .030303
       itd406 |          0  (omitted)
       itd407 |  -.0134323    .000077  -174.40   0.000     -.013587   -.0132776
       itd408 |  -.0133167   .0000245  -542.79   0.000    -.0133659   -.0132674
       itd409 |          0  (omitted)
       itd410 |  -.0106443   .0000155  -686.14   0.000    -.0106754   -.0106131
       itd411 |    -.00803   .0000329  -244.39   0.000     -.008096    -.007964
       itd412 |  -.0135744   .0001415   -95.94   0.000    -.0138586   -.0132902
       itd413 |  -.0137308   .0002125   -64.62   0.000    -.0141576    -.013304
       itd414 |  -.0111538   .0002468   -45.20   0.000    -.0116494   -.0106582
       itd415 |  -.0165514   .0002888   -57.32   0.000    -.0171313   -.0159714
       itd416 |  -.0064264   .0005089   -12.63   0.000    -.0074486   -.0054042
       itd417 |  -.0092176   .0005718   -16.12   0.000    -.0103661    -.008069
       itd418 |    .003792   .0006867     5.52   0.000     .0024127    .0051712
       itd419 |  -.0071217   .0008245    -8.64   0.000    -.0087778   -.0054657
       itd420 |  -.0074584   .0009772    -7.63   0.000    -.0094212   -.0054955
       itd421 |  -.0023559   .0009478    -2.49   0.016    -.0042597   -.0004522
       itd422 |  -.0332417   .0010501   -31.66   0.000    -.0353509   -.0311326
       itd423 |  -.0243246   .0010629   -22.89   0.000    -.0264595   -.0221898
       itd424 |  -.0022247   .0010074    -2.21   0.032    -.0042481   -.0002013
       itd425 |  -.0333051   .0010213   -32.61   0.000    -.0353565   -.0312536
       itd426 |  -.0201762   .0009285   -21.73   0.000    -.0220412   -.0183112
       itd427 |   .0152026   .0008483    17.92   0.000     .0134987    .0169065
       itd428 |   .0327445   .0007413    44.17   0.000     .0312556    .0342334
       itd429 |  -.0296372   .0006689   -44.31   0.000    -.0309807   -.0282937
       itd430 |  -.0258439   .0003734   -69.21   0.000    -.0265939    -.025094
       itd431 |  -.0215444   .0003076   -70.03   0.000    -.0221623   -.0209265
       itd432 |  -.0083208   .0002578   -32.27   0.000    -.0088386    -.007803
       itd433 |   .0404347   .0001973   204.96   0.000     .0400385     .040831
       itd434 |          0  (omitted)
       itd435 |   .0036244   .0013332     2.72   0.009     .0009467    .0063022
       itd436 |   .0007331   .0013415     0.55   0.587    -.0019613    .0034276
       itd437 |   .0066576   .0014016     4.75   0.000     .0038424    .0094728
       itd438 |   .0007956   .0013628     0.58   0.562    -.0019416    .0035328
       itd439 |   .0006319   .0013087     0.48   0.631    -.0019966    .0032605
       itd440 |   .0004652   .0012298     0.38   0.707    -.0020049    .0029352
       itd441 |   .0003128   .0011651     0.27   0.789    -.0020274    .0026529
       itd442 |   .0001152   .0010963     0.11   0.917    -.0020867    .0023171
       itd443 |   .0021917   .0008441     2.60   0.012     .0004963    .0038871
       itd444 |  -.0011328   .0006497    -1.74   0.087    -.0024377    .0001722
       itd445 |  -.0019698    .000381    -5.17   0.000     -.002735   -.0012046
       itd446 |   .0004706   .0002206     2.13   0.038     .0000275    .0009136
       itd447 |   .0039493   .0003665    10.78   0.000     .0032132    .0046854
       itd448 |          0  (omitted)
       itd449 |          0  (omitted)
       itd450 |  -7.93e-13   8.43e-13    -0.94   0.351    -2.49e-12    9.00e-13
       itd451 |  -7.92e-13   8.43e-13    -0.94   0.351    -2.49e-12    9.00e-13
       itd452 |  -7.92e-13   8.43e-13    -0.94   0.351    -2.49e-12    9.00e-13
       itd453 |  -7.91e-13   8.41e-13    -0.94   0.352    -2.48e-12    8.98e-13
       itd454 |  -7.91e-13   8.41e-13    -0.94   0.352    -2.48e-12    8.98e-13
       itd455 |  -7.91e-13   8.41e-13    -0.94   0.352    -2.48e-12    8.98e-13
       itd456 |  -7.91e-13   8.41e-13    -0.94   0.352    -2.48e-12    8.98e-13
       itd457 |  -7.91e-13   8.41e-13    -0.94   0.352    -2.48e-12    8.98e-13
       itd458 |  -7.91e-13   8.41e-13    -0.94   0.352    -2.48e-12    8.98e-13
       itd459 |  -7.91e-13   8.41e-13    -0.94   0.352    -2.48e-12    8.98e-13
       itd460 |  -7.91e-13   8.41e-13    -0.94   0.352    -2.48e-12    8.98e-13
       itd461 |  -7.91e-13   8.41e-13    -0.94   0.352    -2.48e-12    8.98e-13
       itd462 |  -7.91e-13   8.41e-13    -0.94   0.352    -2.48e-12    8.98e-13
       itd463 |  -.0909091   3.22e-13 -2.8e+11   0.000    -.0909091   -.0909091
       itd464 |  -.0606061   3.08e-13 -2.0e+11   0.000    -.0606061   -.0606061
       itd465 |  -.0606061   3.08e-13 -2.0e+11   0.000    -.0606061   -.0606061
       itd466 |   .0909091   3.21e-13  2.8e+11   0.000     .0909091    .0909091
       itd467 |   .0606061   3.22e-13  1.9e+11   0.000     .0606061    .0606061
       itd468 |   -.030303   3.55e-13 -8.5e+10   0.000     -.030303    -.030303
       itd469 |          0  (omitted)
       itd470 |  -.0606061   3.08e-13 -2.0e+11   0.000    -.0606061   -.0606061
       itd471 |   -.030303   3.55e-13 -8.5e+10   0.000     -.030303    -.030303
       itd472 |  -2.34e-13   3.02e-13    -0.78   0.441    -8.40e-13    3.72e-13
       itd473 |  -2.34e-13   3.01e-13    -0.78   0.442    -8.39e-13    3.71e-13
       itd474 |   -.030303   3.56e-13 -8.5e+10   0.000     -.030303    -.030303
       itd475 |  -.0606061   3.08e-13 -2.0e+11   0.000    -.0606061   -.0606061
       itd476 |  -.0606061   3.08e-13 -2.0e+11   0.000    -.0606061   -.0606061
       itd477 |  -.0048591   .0001805   -26.91   0.000    -.0052218   -.0044965
       itd478 |   .0042117   .0000864    48.73   0.000     .0040381    .0043853
       itd479 |   .0086279   .0000962    89.71   0.000     .0084347    .0088211
       itd480 |    .026209    .000142   184.54   0.000     .0259238    .0264943
       itd481 |   .0132509   .0000193   684.97   0.000      .013212    .0132897
       itd482 |          0  (omitted)
       itd483 |   .0129827   .0000976   132.96   0.000     .0127866    .0131788
       itd484 |  -.0011439   .0003975    -2.88   0.006    -.0019422   -.0003455
       itd485 |  -.0100417   .0004377   -22.94   0.000    -.0109209   -.0091625
       itd486 |  -.0069342    .000961    -7.22   0.000    -.0088644    -.005004
       itd487 |   .0056748    .001176     4.83   0.000     .0033127    .0080369
       itd488 |   .0101702   .0010943     9.29   0.000     .0079722    .0123682
       itd489 |    .005862    .001052     5.57   0.000      .003749     .007975
       itd490 |   .0004437   .0014074     0.32   0.754    -.0023832    .0032706
       itd491 |   .0167131   9.16e-13  1.8e+10   0.000     .0167131    .0167131
       itd492 |   .0139276   9.48e-13  1.5e+10   0.000     .0139276    .0139276
       itd493 |  -8.74e-13   9.23e-13    -0.95   0.348    -2.73e-12    9.81e-13
       itd494 |   .0027855   9.33e-13  3.0e+09   0.000     .0027855    .0027855
       itd495 |   .0027855   9.37e-13  3.0e+09   0.000     .0027855    .0027855
       itd496 |    .005571   9.30e-13  6.0e+09   0.000      .005571     .005571
       itd497 |   .0027855   9.33e-13  3.0e+09   0.000     .0027855    .0027855
       itd498 |   .0027855   9.33e-13  3.0e+09   0.000     .0027855    .0027855
       itd499 |   .0027855   9.38e-13  3.0e+09   0.000     .0027855    .0027855
       itd500 |  -.0027855   9.53e-13 -2.9e+09   0.000    -.0027855   -.0027855
       itd501 |   .0111421   9.47e-13  1.2e+10   0.000     .0111421    .0111421
       itd502 |    .005571   9.36e-13  6.0e+09   0.000      .005571     .005571
       itd503 |    .005571   9.36e-13  6.0e+09   0.000      .005571     .005571
       itd504 |          0  (omitted)
       itd505 |  -.0235294   8.60e-14 -2.7e+11   0.000    -.0235294   -.0235294
       itd506 |          0  (omitted)
       itd507 |  -.0078431   8.57e-14 -9.1e+10   0.000    -.0078431   -.0078431
       itd508 |  -.0078431   8.55e-14 -9.2e+10   0.000    -.0078431   -.0078431
       itd509 |   .0078431   8.49e-14  9.2e+10   0.000     .0078431    .0078431
       itd510 |   .0352941   8.49e-14  4.2e+11   0.000     .0352941    .0352941
       itd511 |   .0666667   8.60e-14  7.8e+11   0.000     .0666667    .0666667
       itd512 |   .0666667   8.57e-14  7.8e+11   0.000     .0666667    .0666667
       itd513 |   .0156863   8.58e-14  1.8e+11   0.000     .0156863    .0156863
       itd514 |   -.027451   8.62e-14 -3.2e+11   0.000     -.027451    -.027451
       itd515 |  -.0431373   8.43e-14 -5.1e+11   0.000    -.0431373   -.0431373
       itd516 |   .0313725   8.49e-14  3.7e+11   0.000     .0313725    .0313725
       itd517 |   .0509804   8.52e-14  6.0e+11   0.000     .0509804    .0509804
       itd518 |   .1254902   8.24e-14  1.5e+12   0.000     .1254902    .1254902
       itd519 |   .3333333   1.95e-13  1.7e+12   0.000     .3333333    .3333333
       itd520 |   .1666667   1.96e-13  8.5e+11   0.000     .1666667    .1666667
       itd521 |          0  (omitted)
       itd522 |   .1666667   1.96e-13  8.5e+11   0.000     .1666667    .1666667
       itd523 |   .1666667   1.96e-13  8.5e+11   0.000     .1666667    .1666667
       itd524 |  -.1666667   1.95e-13 -8.6e+11   0.000    -.1666667   -.1666667
       itd525 |  -.3333333   1.95e-13 -1.7e+12   0.000    -.3333333   -.3333333
       itd526 |  -.1666667   1.95e-13 -8.6e+11   0.000    -.1666667   -.1666667
       itd527 |  -8.55e-15   1.95e-13    -0.04   0.965    -4.00e-13    3.83e-13
       itd528 |  -.1666667   1.95e-13 -8.6e+11   0.000    -.1666667   -.1666667
       itd529 |   .3333333   1.95e-13  1.7e+12   0.000     .3333333    .3333333
       itd530 |  -.1666667   1.95e-13 -8.6e+11   0.000    -.1666667   -.1666667
       itd531 |  -8.66e-15   1.95e-13    -0.04   0.965    -4.00e-13    3.83e-13
       itd532 |  -8.64e-15   1.95e-13    -0.04   0.965    -4.00e-13    3.83e-13
       itd533 |  -.0173739   .0005634   -30.84   0.000    -.0185054   -.0162423
       itd534 |  -.0408452   .0005962   -68.51   0.000    -.0420427   -.0396476
       itd535 |  -.0408051   .0006116   -66.72   0.000    -.0420334   -.0395767
       itd536 |  -.0231626   .0006019   -38.49   0.000    -.0243714   -.0219537
       itd537 |  -.0314359    .000591   -53.19   0.000     -.032623   -.0302489
       itd538 |  -.0127678    .000523   -24.41   0.000    -.0138183   -.0117173
       itd539 |  -.0305518   .0004786   -63.84   0.000     -.031513   -.0295905
       itd540 |  -.0070507   .0004571   -15.42   0.000    -.0079689   -.0061325
       itd541 |  -.0247872   .0004309   -57.53   0.000    -.0256526   -.0239218
       itd542 |  -.0310364   .0002931  -105.90   0.000    -.0316251   -.0304478
       itd543 |  -.0346728   .0002537  -136.66   0.000    -.0351824   -.0341633
       itd544 |  -.0042364   .0001818   -23.30   0.000    -.0046016   -.0038711
       itd545 |   .0037833   .0000956    39.57   0.000     .0035913    .0039754
       itd546 |          0  (omitted)
       itd547 |   .1210893   .0049427    24.50   0.000     .1111617    .1310169
       itd548 |   .0591868   .0048335    12.25   0.000     .0494785    .0688951
       itd549 |   .0590213   .0047841    12.34   0.000     .0494122    .0686304
       itd550 |   .1665794   .0047311    35.21   0.000     .1570767    .1760822
       itd551 |   .1049464   .0046915    22.37   0.000     .0955233    .1143696
       itd552 |   .0585464   .0045653    12.82   0.000     .0493768     .067716
       itd553 |   .0128605   .0047045     2.73   0.009     .0034113    .0223098
       itd554 |  -.0180437   .0046445    -3.88   0.000    -.0273725   -.0087149
       itd555 |   .0125956   .0045836     2.75   0.008     .0033892     .021802
       itd556 |   .0269937   .0041567     6.49   0.000     .0186447    .0353427
       itd557 |   .0397959   .0032237    12.34   0.000     .0333209     .046271
       itd558 |          0  (omitted)
       itd559 |   .0204372   .0017331    11.79   0.000     .0169562    .0239181
       itd560 |    .035376   .0015233    23.22   0.000     .0323164    .0384356
       itd561 |   .6089346   .0040548   150.18   0.000     .6007903    .6170789
       itd562 |   .8112871   .0051224   158.38   0.000     .8009984    .8215757
       itd563 |   .6107764   .0048907   124.89   0.000     .6009532    .6205995
       itd564 |     1.0077   .0034947   288.36   0.000     1.000681     1.01472
       itd565 |   .8080906   .0036718   220.08   0.000     .8007156    .8154655
       itd566 |   .0093527   .0042445     2.20   0.032     .0008273    .0178781
       itd567 |   .0095369   .0043282     2.20   0.032     .0008436    .0182303
       itd568 |     .20732   .0033221    62.41   0.000     .2006475    .2139926
       itd569 |   .0058273   .0026446     2.20   0.032     .0005154    .0111391
       itd570 |          0  (omitted)
       itd571 |    .000717   .0003254     2.20   0.032     .0000634    .0013705
       itd572 |   .0027991   .0012703     2.20   0.032     .0002476    .0053506
       itd573 |   .0103957   .0047179     2.20   0.032     .0009195    .0198719
       itd574 |   .0055489   .0025183     2.20   0.032     .0004908     .010607
       itd575 |  -.2488889   3.06e-13 -8.1e+11   0.000    -.2488889   -.2488889
       itd576 |  -.2622222   3.03e-13 -8.6e+11   0.000    -.2622222   -.2622222
       itd577 |  -.1911111   3.12e-13 -6.1e+11   0.000    -.1911111   -.1911111
       itd578 |       -.12   3.17e-13 -3.8e+11   0.000         -.12        -.12
       itd579 |  -.2088889   3.15e-13 -6.6e+11   0.000    -.2088889   -.2088889
       itd580 |  -.1822222   3.13e-13 -5.8e+11   0.000    -.1822222   -.1822222
       itd581 |  -.2355556   3.08e-13 -7.7e+11   0.000    -.2355556   -.2355556
       itd582 |  -.1688889   3.10e-13 -5.4e+11   0.000    -.1688889   -.1688889
       itd583 |  -.2888889   3.00e-13 -9.6e+11   0.000    -.2888889   -.2888889
       itd584 |  -.0844444   3.11e-13 -2.7e+11   0.000    -.0844444   -.0844444
       itd585 |  -.0977778   3.17e-13 -3.1e+11   0.000    -.0977778   -.0977778
       itd586 |  -.1066667   3.18e-13 -3.3e+11   0.000    -.1066667   -.1066667
       itd587 |  -.0133333   3.05e-13 -4.4e+10   0.000    -.0133333   -.0133333
       itd588 |          0  (omitted)
       itd589 |  -8.50e-13   9.00e-13    -0.95   0.349    -2.66e-12    9.57e-13
       itd590 |  -8.50e-13   9.00e-13    -0.95   0.349    -2.66e-12    9.56e-13
       itd591 |  -8.43e-13   8.92e-13    -0.94   0.349    -2.63e-12    9.49e-13
       itd592 |          0  (omitted)
       itd593 |  -8.43e-13   8.92e-13    -0.94   0.349    -2.63e-12    9.49e-13
       itd594 |  -8.43e-13   8.92e-13    -0.94   0.349    -2.63e-12    9.49e-13
       itd595 |  -8.43e-13   8.92e-13    -0.94   0.349    -2.63e-12    9.49e-13
       itd596 |  -8.43e-13   8.92e-13    -0.94   0.349    -2.63e-12    9.49e-13
       itd597 |  -8.43e-13   8.92e-13    -0.94   0.349    -2.63e-12    9.49e-13
       itd598 |  -8.43e-13   8.92e-13    -0.94   0.349    -2.63e-12    9.49e-13
       itd599 |  -8.43e-13   8.92e-13    -0.94   0.349    -2.63e-12    9.49e-13
       itd600 |  -8.43e-13   8.92e-13    -0.94   0.349    -2.63e-12    9.49e-13
       itd601 |  -8.43e-13   8.92e-13    -0.94   0.349    -2.63e-12    9.49e-13
       itd602 |  -8.43e-13   8.92e-13    -0.94   0.349    -2.63e-12    9.49e-13
       itd603 |          0  (omitted)
       itd604 |          0  (omitted)
       itd605 |          0  (omitted)
       itd606 |          0  (omitted)
       itd607 |          0  (omitted)
       itd608 |          0  (omitted)
       itd609 |          0  (omitted)
       itd610 |          0  (omitted)
       itd611 |          0  (omitted)
       itd612 |          0  (omitted)
       itd613 |          0  (omitted)
       itd614 |          0  (omitted)
       itd615 |          0  (omitted)
       itd616 |          0  (omitted)
       itd617 |   .0023256   1.28e-12  1.8e+09   0.000     .0023256    .0023256
       itd618 |  -.0023256   1.29e-12 -1.8e+09   0.000    -.0023256   -.0023256
       itd619 |   .0046512   1.27e-12  3.7e+09   0.000     .0046512    .0046512
       itd620 |   .0046512   1.27e-12  3.7e+09   0.000     .0046512    .0046512
       itd621 |  -.0069767   1.24e-12 -5.6e+09   0.000    -.0069767   -.0069767
       itd622 |  -.0023256   1.29e-12 -1.8e+09   0.000    -.0023256   -.0023256
       itd623 |   .0069767   1.25e-12  5.6e+09   0.000     .0069767    .0069767
       itd624 |   .0162791   1.25e-12  1.3e+10   0.000     .0162791    .0162791
       itd625 |   .0162791   1.25e-12  1.3e+10   0.000     .0162791    .0162791
       itd626 |   .0581395   1.20e-12  4.8e+10   0.000     .0581395    .0581395
       itd627 |   .0511628   1.21e-12  4.2e+10   0.000     .0511628    .0511628
       itd628 |   .0348837   1.21e-12  2.9e+10   0.000     .0348837    .0348837
       itd629 |   .0116279   1.25e-12  9.3e+09   0.000     .0116279    .0116279
       itd630 |          0  (omitted)
       itd631 |   .2186002   .0042841    51.03   0.000     .2099953    .2272051
       itd632 |   .1510001   .0040691    37.11   0.000     .1428271    .1591732
       itd633 |   .0172382   .0039704     4.34   0.000     .0092634     .025213
       itd634 |   .0171103   .0039409     4.34   0.000     .0091947    .0250259
       itd635 |   .0170598   .0039293     4.34   0.000     .0091676    .0249521
       itd636 |   .0173218   .0039897     4.34   0.000     .0093084    .0253353
       itd637 |   .0185437   .0042711     4.34   0.000      .009965    .0271224
       itd638 |   .0185305   .0042681     4.34   0.000     .0099579    .0271032
       itd639 |   .0852405    .004278    19.93   0.000     .0766478    .0938331
       itd640 |   .0182904   .0042128     4.34   0.000     .0098289     .026752
       itd641 |   .0143667    .003309     4.34   0.000     .0077203    .0210131
       itd642 |          0  (omitted)
       itd643 |    .009294   .0021406     4.34   0.000     .0049944    .0135936
       itd644 |   .0094962   .0021872     4.34   0.000      .005103    .0138894
       itd645 |   .0154751   .0001672    92.57   0.000     .0151394    .0158109
       itd646 |  -.0169096   .0002313   -73.11   0.000    -.0173741    -.016445
       itd647 |   -.000708   .0001902    -3.72   0.000    -.0010899    -.000326
       itd648 |  -.0175311   .0004183   -41.91   0.000    -.0183714   -.0166908
       itd649 |   -.017361   .0003912   -44.38   0.000    -.0181467   -.0165752
       itd650 |  -.0005088   .0001623    -3.13   0.003    -.0008348   -.0001828
       itd651 |          0  (omitted)
       itd652 |  -.0173561   .0004022   -43.15   0.000    -.0181639   -.0165483
       itd653 |  -.0213685   .0017705   -12.07   0.000    -.0249246   -.0178124
       itd654 |  -.0251101   .0029294    -8.57   0.000     -.030994   -.0192262
       itd655 |  -.0298033   .0045445    -6.56   0.000    -.0389312   -.0206754
       itd656 |   -.035298   .0064093    -5.51   0.000    -.0481716   -.0224245
       itd657 |  -.0108312    .003603    -3.01   0.004    -.0180681   -.0035943
       itd658 |   .0817117   .0050529    16.17   0.000     .0715627    .0918607
       itd659 |  -.0229863   .0000784  -293.37   0.000    -.0231437    -.022829
       itd660 |  -.0228687    .000025  -916.28   0.000    -.0229188   -.0228186
       itd661 |          0  (omitted)
       itd662 |   .0037675   .0000158   238.73   0.000     .0037358    .0037992
       itd663 |  -.0000737   .0000334    -2.20   0.032    -.0001408   -6.51e-06
       itd664 |  -.0193286   .0001439  -134.29   0.000    -.0196177   -.0190395
       itd665 |  -.0270923   .0002162  -125.33   0.000    -.0275265   -.0266581
       itd666 |   .0032492    .000251    12.94   0.000      .002745    .0037534
       itd667 |   .0145619   .0002937    49.57   0.000     .0139719    .0151519
       itd668 |  -.0087453   .0005177   -16.89   0.000    -.0097852   -.0077055
       itd669 |  -.0126886   .0005817   -21.81   0.000    -.0138571   -.0115202
       itd670 |   .0098676   .0006986    14.13   0.000     .0084645    .0112707
       itd671 |  -.0208595   .0008387   -24.87   0.000    -.0225442   -.0191749
       itd672 |  -.0173997   .0009941   -17.50   0.000    -.0193965   -.0154029
       itd673 |  -.1351351   4.65e-14 -2.9e+12   0.000    -.1351351   -.1351351
       itd674 |   4.41e-14   4.72e-14     0.93   0.355    -5.07e-14    1.39e-13
       itd675 |   -.027027   4.68e-14 -5.8e+11   0.000     -.027027    -.027027
       itd676 |  -.0405405   4.68e-14 -8.7e+11   0.000    -.0405405   -.0405405
       itd677 |   .0540541   4.76e-14  1.1e+12   0.000     .0540541    .0540541
       itd678 |   .0540541   4.73e-14  1.1e+12   0.000     .0540541    .0540541
       itd679 |   .0945946   4.81e-14  2.0e+12   0.000     .0945946    .0945946
       itd680 |   .2027027   4.97e-14  4.1e+12   0.000     .2027027    .2027027
       itd681 |   .0945946   4.77e-14  2.0e+12   0.000     .0945946    .0945946
       itd682 |   4.41e-14   4.72e-14     0.93   0.355    -5.07e-14    1.39e-13
       itd683 |  -.0810811   4.51e-14 -1.8e+12   0.000    -.0810811   -.0810811
       itd684 |          0  (omitted)
       itd685 |   .1351351   4.66e-14  2.9e+12   0.000     .1351351    .1351351
       itd686 |   .0540541   4.63e-14  1.2e+12   0.000     .0540541    .0540541
       itd687 |  -.0319901   .0037429    -8.55   0.000    -.0395078   -.0244723
       itd688 |  -.0355988   .0038511    -9.24   0.000    -.0433339   -.0278637
       itd689 |  -.0116342   .0039016    -2.98   0.004    -.0194707   -.0037977
       itd690 |  -.0248692   .0034586    -7.19   0.000     -.031816   -.0179223
       itd691 |  -.0131318   .0034044    -3.86   0.000    -.0199698   -.0062939
       itd692 |   .0022093   .0032437     0.68   0.499    -.0043058    .0087244
       itd693 |  -.0185235   .0029407    -6.30   0.000      -.02443   -.0126169
       itd694 |  -.0194423   .0026581    -7.31   0.000    -.0247812   -.0141033
       itd695 |   .0227456   .0021455    10.60   0.000     .0184363    .0270549
       itd696 |  -.0076775   .0012743    -6.02   0.000     -.010237   -.0051179
       itd697 |   .0027169   .0007929     3.43   0.001     .0011243    .0043095
       itd698 |  -.0142561   .0006264   -22.76   0.000    -.0155143   -.0129979
       itd699 |   .0186824   .0009498    19.67   0.000     .0167746    .0205902
       itd700 |          0  (omitted)
       itd701 |  -.0060256   .0005776   -10.43   0.000    -.0071858   -.0048654
       itd702 |  -.0001831   .0000688    -2.66   0.010    -.0003212   -.0000449
       itd703 |          0  (omitted)
       itd704 |   .0213018   .0002925    72.82   0.000     .0207142    .0218893
       itd705 |   .0349744   .0001551   225.50   0.000     .0346629    .0352859
       itd706 |  -.0005884   .0002322    -2.53   0.014    -.0010549    -.000122
       itd707 |  -.0010314   .0004007    -2.57   0.013    -.0018362   -.0002265
       itd708 |   .0013512   .0011261     1.20   0.236    -.0009106    .0036131
       itd709 |   .0134655   .0015423     8.73   0.000     .0103678    .0165633
       itd710 |   .0146385   .0027267     5.37   0.000     .0091618    .0201151
       itd711 |   .0145442   .0027708     5.25   0.000      .008979    .0201095
       itd712 |  -.0072992   .0026918    -2.71   0.009    -.0127059   -.0018924
       itd713 |   .0068727   .0023997     2.86   0.006     .0020529    .0116926
       itd714 |  -.0039618   .0031257    -1.27   0.211      -.01024    .0023164
       itd715 |  -.0508198   .0006172   -82.34   0.000    -.0520595   -.0495802
       itd716 |          0  (omitted)
       itd717 |  -.0196128   .0000866  -226.56   0.000    -.0197866   -.0194389
       itd718 |   .3365016   .0009171   366.92   0.000     .3346595    .3383437
       itd719 |   .2882421   .0009167   314.45   0.000      .286401    .2900833
       itd720 |   .3726744   .0017279   215.68   0.000     .3692038    .3761451
       itd721 |   .1560326   .0026099    59.78   0.000     .1507905    .1612748
       itd722 |   .1923874   .0033499    57.43   0.000     .1856591    .1991158
       itd723 |   .1423797   .0038062    37.41   0.000     .1347346    .1500247
       itd724 |   .0955955   .0061085    15.65   0.000     .0833263    .1078647
       itd725 |   .1022892   .0068279    14.98   0.000     .0885751    .1160034
       itd726 |   .3418197   .0077043    44.37   0.000     .3263452    .3572942
       itd727 |   .1374378   .0079648    17.26   0.000     .1214399    .1534356
       itd728 |   .2771176   .0097098    28.54   0.000     .2576149    .2966203
        _cons |   .0359486   .0096872     3.71   0.001     .0164913    .0554059
--------------+----------------------------------------------------------------
      sigma_u |  .18055342
      sigma_e |  .17729272
          rho |  .50911128   (fraction of variance due to u_i)
-------------------------------------------------------------------------------

. *
. keep if  condition_around == 1 /* prediction only on minerals with reliable prices */
(5,026 observations deleted)

. *
. cap drop benchLPM_nb

. predict  benchLPM_nb 
(option xb assumed; fitted values)
(331 missing values generated)

. sum benchLPM_nb, d

                      Linear prediction
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.1551625      -.4640514
 5%    -.0696442      -.4640514
10%    -.0354159      -.2973848       Obs             139,333
25%        .0176      -.2973848       Sum of Wgt.     139,333

50%     .0359486                      Mean           .0755822
                        Largest       Std. Dev.      .1615182
75%      .060118        1.76869
90%     .2826772       1.785565       Variance       .0260881
95%     .3754974       1.785565       Skewness        3.96723
99%     .6789799       1.797808       Kurtosis       28.12714

. *
. tsset cell year
       panel variable:  cell (strongly balanced)
        time variable:  year, 1997 to 2010
                delta:  1 unit

. /* counterfactual: put all prices to their 97 level */
. sort  mainmineral 

. merge mainmineral using  "$Output_data\tempzz", nokeep
(note: you are using old merge syntax; see [D] merge for new syntax)
variable mainmineral does not uniquely identify observations in the master data

. tab  _merge

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    137,494       98.45       98.45
          3 |      2,170        1.55      100.00
------------+-----------------------------------
      Total |    139,664      100.00

. drop _merge

. *
. rename mainmineral_around mainmineral_a

. sort  mainmineral_a

. merge mainmineral_a using "$Output_data\tempyy", nokeep
(note: you are using old merge syntax; see [D] merge for new syntax)
variable mainmineral_a does not uniquely identify observations in the master data

. tab  _merge

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    119,070       85.25       85.25
          3 |     20,594       14.75      100.00
------------+-----------------------------------
      Total |    139,664      100.00

. drop _merge

. *
. replace main_lprice         = main_lprice97   if main_lprice   != 0
(1,738 real changes made, 338 to missing)

. replace main_lprice_a       = main_lprice_a97 if main_lprice_a != 0
(21,685 real changes made, 2,562 to missing)

. *
. cap drop counterLPM_nb

. predict counterLPM_nb
(option xb assumed; fitted values)
(2,884 missing values generated)

. sum counterLPM_nb, d

                      Linear prediction
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.1551625      -.4640514
 5%    -.0696442      -.4640514
10%    -.0377866      -.2973848       Obs             136,780
25%     .0170042      -.2973848       Sum of Wgt.     136,780

50%     .0359486                      Mean           .0721891
                        Largest       Std. Dev.      .1569021
75%     .0569381       1.720842
90%     .2724923       1.727778       Variance       .0246183
95%     .3714556       1.727778       Skewness       3.983625
99%     .6596977       1.731428       Kurtosis       28.52558

. 
. /* how many events did not happen? */
. g diff = benchLPM_nb-counterLPM_nb
(2,884 missing values generated)

. sum diff, d

                            diff
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.0041449      -.0284839
 5%            0      -.0272895
10%            0      -.0263461       Obs             136,780
25%            0      -.0240282       Sum of Wgt.     136,780

50%            0                      Mean           .0012893
                        Largest       Std. Dev.      .0064324
75%            0       .1336057
90%            0       .1421989       Variance       .0000414
95%     .0115736       .1475955       Skewness       7.826734
99%     .0241233       .1577022       Kurtosis       93.16207

. /* drop 1997 (no change by definition) */
. drop if year == 1997
(9,976 observations deleted)

. /* keep if comparison can be made */
. replace counterLPM_nb = . if benchLPM_nb   ==.
(0 real changes made)

. replace benchLPM_nb   = . if counterLPM_nb ==.
(2,395 real changes made, 2,395 to missing)

. drop if counterLPM_nb == . | benchLPM_nb  == . | nb_acled == .
(2,678 observations deleted)

. save "$Output_data\tempzz", replace
file Data_Code_BCRT_AER\Data\tempzz.dta saved

. 
. *****************************
. * cell level effect for map *
. *****************************
. 
. use "$Output_data\tempzz", clear

. keep if year == 2010
(117,240 observations deleted)

. collapse (mean) benchLPM_nb counterLPM_nb, by(gid)

. g share = abs((counterLPM_nb-benchLPM_nb)/benchLPM_nb)

. keep gid share

. sum share if share>0, d

                            share
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0170913       .0170913
 5%     .0358606       .0170913
10%      .037866       .0170913       Obs               1,476
25%     .0609822       .0170913       Sum of Wgt.       1,476

50%     .0621541                      Mean           .0854413
                        Largest       Std. Dev.      .0535962
75%     .0997536       .2701473
90%      .208803       .2701473       Variance       .0028726
95%     .2172844       .2701473       Skewness       1.614707
99%     .2326792       .2701473       Kurtosis       4.763432

. drop if share == .
(0 observations deleted)

. g share_bin = . 
(9,770 missing values generated)

. replace share_bin = 0 if share == 0
(8,294 real changes made)

. replace share_bin = 1 if share > 0.000 & share <= 0.050
(218 real changes made)

. replace share_bin = 2 if share > 0.050 & share <= 0.075
(748 real changes made)

. replace share_bin = 3 if share > 0.075 & share <= 0.100
(154 real changes made)

. replace share_bin = 4 if share > 0.100
(356 real changes made)

. drop share

. sort gid

. save "$Output_data\Figure_A6", replace
(note: file Data_Code_BCRT_AER\Data\Figure_A6.dta not found)
file Data_Code_BCRT_AER\Data\Figure_A6.dta saved

. outsheet using "$Results\Figure_A6.csv", comma replace
(note: file Data_Code_BCRT_AER\results\Figure_A6.csv not found)

. *
. erase  "$Output_data\tempzz.dta"

. erase  "$Output_data\tempyy.dta"

. erase  "$Output_data\Figure_A6.dta"

. 
. * ------------------------------------------------------------------------------------------------- *
.         *  E - Figure A9.a: country-level quantification, permanent mining areas, PPML estimator  *
. * ------------------------------------------------------------------------------------------------- *
. 
. // Specification used similar to column 5 of Panel A, Table 11, augmented with surrounding cells
. // PPML estimator
. 
. /*get 97 mineral prices of the cell */
. use "$Output_data\BCRT_baseline", clear

. drop if main_lprice == . | main_lprice == 0
(141,470 observations deleted)

. keep if mines == 1
(780 observations deleted)

. collapse (mean) main_lprice, by(mainmineral year)

. keep if year == 1997
(180 observations deleted)

. rename main_lprice main_lprice97

. keep mainmineral main_lprice

. sort mainmineral

. save "$Output_data\tempzz", replace
(note: file Data_Code_BCRT_AER\Data\tempzz.dta not found)
file Data_Code_BCRT_AER\Data\tempzz.dta saved

. 
. /*get 97 mineral prices of the surrounding cells */
. use "$Output_data\BCRT_baseline", clear

. drop if main_lprice == . | main_lprice == 0
(141,470 observations deleted)

. keep if mines == 1
(780 observations deleted)

. collapse (mean) main_lprice, by(mainmineral year)

. keep if year == 1997
(180 observations deleted)

. rename main_lprice main_lprice_a97

. rename mainmineral mainmineral_a 

. keep mainmineral_a main_lprice_a97

. sort mainmineral_a

. save "$Output_data\tempyy", replace
(note: file Data_Code_BCRT_AER\Data\tempyy.dta not found)
file Data_Code_BCRT_AER\Data\tempyy.dta saved

. 
. /*start with baseline dataset*/
. use "$Output_data\BCRT_baseline", clear

. 
. /* trim top 5% of nb events */
. g nb_acled_pos          = nb_acled if nb_acled>0
(136,710 missing values generated)

. egen p95_nb_acled       = pctile(nb_acled_pos), p(95)

. keep if  nb_acled<p95_nb_acled
(415 observations deleted)

. 
. drop    main_lprice 

. rename  main_lprice_mines main_lprice

. 
. g condition_around = (mainmineral != "diamond" & mainmineral_around != "diamond" & mainmineral != "tantalum" & mainmineral_around != "tantalum")

. 
. /*estimation*/
. xtpoisson nb_acled   main_lprice main_lprice_a yeard* if sd_mines == 0  & sd_mines_a ==0  & condition_around == 1, fe
note: 6931 groups (97031 obs) dropped because of all zero outcomes
note: yeard14 omitted because of collinearity

Iteration 0:   log likelihood = -24530.189  
Iteration 1:   log likelihood = -24276.972  
Iteration 2:   log likelihood = -24274.923  
Iteration 3:   log likelihood = -24274.923  

Conditional fixed-effects Poisson regression    Number of obs     =     30,587
Group variable: cell                            Number of groups  =      2,207

                                                Obs per group:
                                                              min =          3
                                                              avg =       13.9
                                                              max =         14

                                                Wald chi2(15)     =     512.70
Log likelihood  = -24274.923                    Prob > chi2       =     0.0000

-------------------------------------------------------------------------------
     nb_acled |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
  main_lprice |     .13624   .0905821     1.50   0.133    -.0412977    .3137776
main_lprice_a |   .3580276   .0473683     7.56   0.000     .2651874    .4508679
       yeard1 |  -.3788629    .040822    -9.28   0.000    -.4588726   -.2988532
       yeard2 |  -.2033365   .0388737    -5.23   0.000    -.2795276   -.1271455
       yeard3 |  -.0949637   .0379242    -2.50   0.012    -.1692938   -.0206336
       yeard4 |  -.0337845   .0373176    -0.91   0.365    -.1069256    .0393566
       yeard5 |  -.2284451   .0396228    -5.77   0.000    -.3061044   -.1507859
       yeard6 |  -.0335946   .0376062    -0.89   0.372    -.1073015    .0401122
       yeard7 |  -.4848455   .0421554   -11.50   0.000    -.5674685   -.4022224
       yeard8 |   -.253428    .039193    -6.47   0.000    -.3302448   -.1766111
       yeard9 |  -.3042089   .0394817    -7.71   0.000    -.3815916   -.2268263
      yeard10 |  -.2942279   .0388721    -7.57   0.000    -.3704158     -.21804
      yeard11 |  -.3466917   .0394782    -8.78   0.000    -.4240675   -.2693159
      yeard12 |  -.1080606   .0370563    -2.92   0.004    -.1806896   -.0354317
      yeard13 |   .0080205   .0356354     0.23   0.822    -.0618236    .0778646
-------------------------------------------------------------------------------

. *
. keep if  condition_around == 1 /* prediction only on minerals with reliable prices */
(5,020 observations deleted)

. *
. cap drop benchLPM_nb

. predict  benchLPM_nb
(option xb assumed; linear prediction)
(324 missing values generated)

. sum benchLPM_nb, d

                      Linear prediction
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.4848455      -.4848455
 5%    -.4848455      -.4848455
10%    -.3788629      -.4848455       Obs             138,931
25%    -.2942279      -.4848455       Sum of Wgt.     138,931

50%    -.1080606                      Mean           .5037786
                        Largest       Std. Dev.      1.783471
75%            0       8.719014
90%      2.84088       8.719014       Variance        3.18077
95%     5.670088       8.719014       Skewness       2.460329
99%     6.217814       8.719014       Kurtosis       7.699667

. *
. tsset cell year
       panel variable:  cell (unbalanced)
        time variable:  year, 1997 to 2010, but with gaps
                delta:  1 unit

. /* counterfactual: put all prices to their 97 level */
. sort  mainmineral 

. merge mainmineral using  "$Output_data\tempzz", nokeep
(note: you are using old merge syntax; see [D] merge for new syntax)
variable mainmineral does not uniquely identify observations in the master data

. tab  _merge

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    137,123       98.47       98.47
          3 |      2,132        1.53      100.00
------------+-----------------------------------
      Total |    139,255      100.00

. drop _merge

. *
. rename mainmineral_around mainmineral_a

. sort  mainmineral_a

. merge mainmineral_a using "$Output_data\tempyy", nokeep
(note: you are using old merge syntax; see [D] merge for new syntax)
variable mainmineral_a does not uniquely identify observations in the master data

. tab  _merge

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    118,782       85.30       85.30
          3 |     20,473       14.70      100.00
------------+-----------------------------------
      Total |    139,255      100.00

. drop _merge

. *
. replace main_lprice         = main_lprice97   if main_lprice   != 0
(1,712 real changes made, 338 to missing)

. replace main_lprice_a       = main_lprice_a97 if main_lprice_a != 0
(21,559 real changes made, 2,554 to missing)

. *
. cap drop counterLPM_nb

. predict counterLPM_nb
(option xb assumed; linear prediction)
(2,873 missing values generated)

. sum counterLPM_nb, d

                      Linear prediction
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.4848455      -.4848455
 5%    -.4848455      -.4848455
10%    -.3788629      -.4848455       Obs             136,382
25%    -.2942279      -.4848455       Sum of Wgt.     136,382

50%    -.1080606                      Mean           .4690963
                        Largest       Std. Dev.      1.750166
75%            0       8.103227
90%     2.741587       8.103227       Variance        3.06308
95%      5.57229       8.103227       Skewness       2.485531
99%     5.808756       8.103227       Kurtosis       7.739808

. 
. /* how many events did not happen? */
. g diff = benchLPM_nb-counterLPM_nb
(2,873 missing values generated)

. sum diff, d

                            diff
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.0589697      -.1743131
 5%            0      -.1470459
10%            0      -.1470459       Obs             136,382
25%            0      -.1470459       Sum of Wgt.     136,382

50%            0                      Mean            .018675
                        Largest       Std. Dev.      .0793504
75%            0       .7799339
90%            0        .790354       Variance       .0062965
95%     .2001014       .8065596       Skewness       4.224104
99%     .4170785       .9650943       Kurtosis       22.15285

. /* drop 1997 (no change by definition) */
. drop if year == 1997
(9,957 observations deleted)

. /* keep if comparison can be made */
. replace counterLPM_nb = . if benchLPM_nb   ==.
(0 real changes made)

. replace benchLPM_nb   = . if counterLPM_nb ==.
(2,391 real changes made, 2,391 to missing)

. replace nb_acled      = . if counterLPM_nb ==.
(2,667 real changes made, 2,667 to missing)

. drop if counterLPM_nb == . | benchLPM_nb  == . | nb_acled == .
(2,667 observations deleted)

. save "$Output_data\tempzz", replace
file Data_Code_BCRT_AER\Data\tempzz.dta saved

. 
. **********************************************
. * country level effect for map (not reported *
. **********************************************
. 
. use "$Output_data\tempzz", clear

. /* sum events by year and country */
. collapse (sum) nb_acled diff counterLPM_nb benchLPM_nb, by(iso_1 year)

. /* sum events by country over the period */ 
. collapse (sum) nb_acled diff counterLPM_nb benchLPM_nb, by(iso_1)

. g share1 = diff/nb_acled 
(4 missing values generated)

. g share2 = diff/benchLPM_nb 

. 
. sum, d 

                          Iso code
-------------------------------------------------------------
no observations

                       (sum) nb_acled
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            8              0       Obs                  51
25%           41              0       Sum of Wgt.          51

50%          161                      Mean           361.0196
                        Largest       Std. Dev.      484.2297
75%          402           1402
90%         1097           1494       Variance       234478.4
95%         1494           1501       Skewness       1.854569
99%         2134           2134       Kurtosis       5.842144

                         (sum) diff
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs                  51
25%            0              0       Sum of Wgt.          51

50%     14.72039                      Mean           49.93993
                        Largest       Std. Dev.      63.87691
75%     90.58013       158.3541
90%     129.9024       174.0653       Variance        4080.26
95%     174.0653       226.7565       Skewness        1.28442
99%     249.9918       249.9918       Kurtosis       4.039923

                     (sum) counterLPM_nb
-------------------------------------------------------------
      Percentiles      Smallest
 1%     -1436.05       -1436.05
 5%     -793.211      -1021.951
10%    -479.9298       -793.211       Obs                  51
25%     -78.4597      -549.1923       Sum of Wgt.          51

50%     258.8682                      Mean           1199.522
                        Largest       Std. Dev.      2019.297
75%     2807.182       5129.403
90%     3377.471       5171.075       Variance        4077561
95%     5171.075       6406.765       Skewness       1.389246
99%     7799.505       7799.505       Kurtosis       4.401961

                      (sum) benchLPM_nb
-------------------------------------------------------------
      Percentiles      Smallest
 1%     -1436.05       -1436.05
 5%    -790.2396      -1021.951
10%    -479.9298      -790.2396       Obs                  51
25%     -78.4597      -549.1923       Sum of Wgt.          51

50%     271.5982                      Mean           1249.461
                        Largest       Std. Dev.      2078.155
75%      2923.69       5249.315
90%     3466.722       5289.133       Variance        4318728
95%     5289.133       6656.757       Skewness       1.382794
99%     8026.262       8026.262       Kurtosis       4.380636

                           share1
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs                  47
25%            0              0       Sum of Wgt.          47

50%     .0742053                      Mean           .6866239
                        Largest       Std. Dev.      2.205304
75%      .365781       1.510494
90%     1.495923       1.635599       Variance       4.863366
95%     1.635599       4.205217       Skewness       5.663868
99%     14.65739       14.65739       Kurtosis       35.92675

                           share2
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.0883541      -.0883541
 5%            0      -.0037602
10%            0              0       Obs                  51
25%            0              0       Sum of Wgt.          51

50%     .0232589                      Mean           .0366767
                        Largest       Std. Dev.      .1007841
75%      .041023        .066955
90%     .0593611       .0942737       Variance       .0101574
95%     .0942737        .104561       Skewness       5.984215
99%     .7102894       .7102894       Kurtosis       40.77225

. *
. rename iso_1 ISO3

. sort ISO3

. keep ISO3 diff nb_acled share1

. save "$Output_data\Figure_A9a", replace
(note: file Data_Code_BCRT_AER\Data\Figure_A9a.dta not found)
file Data_Code_BCRT_AER\Data\Figure_A9a.dta saved

. *
. use "$Output_data\BCRT_baseline", replace

. replace main_lprice = . if main_lprice == 0
(141,470 real changes made, 141,470 to missing)

. collapse (mean) main_lprice mines, by(iso_1)

. g noprice = (mines>0 & main_lprice == .)

. *drop main_lprice mines
. rename iso_1 ISO3

. sort ISO3

. merge ISO3 using "$Output_data\Figure_A9a", nokeep
(note: you are using old merge syntax; see [D] merge for new syntax)

. tab _merge

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          1        1.92        1.92
          3 |         51       98.08      100.00
------------+-----------------------------------
      Total |         52      100.00

. drop _merge

. *
. rename share1 share

. replace share = -1 if share == 0 & noprice == 1
(0 real changes made)

. drop noprice

. 
. g share_bin = . 
(52 missing values generated)

. replace share_bin = 1 if share >= 0.000 & share < 0.01 & share != .
(16 real changes made)

. replace share_bin = 2 if share >= 0.010 & share < 0.050 & share != .
(4 real changes made)

. replace share_bin = 3 if share >= 0.050 & share < 0.200 & share != .
(7 real changes made)

. replace share_bin = 4 if share >= 0.200 & share < 0.500 & share != .
(10 real changes made)

. replace share_bin = 5 if share >= 0.500 & share != . 
(10 real changes made)

. replace share_bin = 0 if mines == 0 | nb_acled == . | nb_acled == 0/* no observation in estimation */
(23 real changes made)

. 
. sort ISO3

. save "$Output_data\Figure_A9a", replace
file Data_Code_BCRT_AER\Data\Figure_A9a.dta saved

. outsheet using "$Results\Figure_A9a.csv", comma replace
(note: file Data_Code_BCRT_AER\results\Figure_A9a.csv not found)

. 
. **************************
. * Bar chart (Figure A9a) *
. **************************
. 
. rename share increase

. drop if increase == 0 | increase == . | increase == -1
(19 observations deleted)

. replace increase = 1 if increase > 1
(7 real changes made)

. graph hbar (sum) increase, over(ISO3, sort(increase) label(labsize(small))) bar(1, color(black)) legend(off) bgcolor(white) graphregion(color(white)) intensity(40)   lintensity(100) ytitle(Share of events explained by increase in mineral prices)  

. graph export $Results\Figure_A9a.eps, as(eps) replace
(note: file Data_Code_BCRT_AER\results\Figure_A9a.eps not found)
(file Data_Code_BCRT_AER\results\Figure_A9a.eps written in EPS format)

. 
. *****************************
. * Aggregate quantifications *
. *****************************
. 
. /*get total number of observed events */
. /*(to be able to drop countries with less than 50 events in total sample)*/
. 
. use "$Output_data\BCRT_baseline", replace

. drop if year == 1997
(10,335 observations deleted)

. collapse (sum) nb_acled, by(iso_1)

. sort iso_1

. save "$Output_data\tempzz.dta", replace
file Data_Code_BCRT_AER\Data\tempzz.dta saved

. 
. ///// AGGREGATE QUANTIFICATIONS /////
> 
. use "$Output_data\Figure_A9a", clear

. drop nb_acled

. rename ISO3 iso_1

. sort  iso_1

. merge iso_1 using "$Output_data\tempzz.dta", nokeep
(note: you are using old merge syntax; see [D] merge for new syntax)

. tab  _merge

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          3 |         52      100.00      100.00
------------+-----------------------------------
      Total |         52      100.00

. drop _merge

. 
. drop if share == 0 | share == . | share == -1 
(19 observations deleted)

. replace share = 1 if share > 1
(7 real changes made)

. 
. /* how many on average across countries with mines*/
. egen mean = mean(share)

. di mean 
.4039222

. /* how many on average across countries with mines, excluding countries with <50 events ?*/
. drop mean 

. egen mean = mean(share) if nb_acled>=50
(4 missing values generated)

. di mean 
.34406912

. *
. erase  "$Output_data\tempzz.dta"

. erase  "$Output_data\tempyy.dta"

. erase  "$Output_data\Figure_A9a.dta"

. 
. 
. * ------------------------------------------------------------------------------------------------- *
.         *  F - Figure A9.b: country-level quantification, permanent mining areas, LPM estimator  *
. * ------------------------------------------------------------------------------------------------- *
. 
. // Specification used similar to column 2 of Panel A, Table 11, augmented with surrounding cells
. // LPM estimator
. 
. /*get 97 mineral prices of the cell */
. use "$Output_data\BCRT_baseline", clear

. drop if main_lprice == . | main_lprice == 0
(141,470 observations deleted)

. keep if mines == 1
(780 observations deleted)

. collapse (mean) main_lprice, by(mainmineral year)

. keep if year == 1997
(180 observations deleted)

. rename main_lprice main_lprice97

. keep mainmineral main_lprice

. sort mainmineral

. save "$Output_data\tempzz", replace
(note: file Data_Code_BCRT_AER\Data\tempzz.dta not found)
file Data_Code_BCRT_AER\Data\tempzz.dta saved

. 
. /*get 97 mineral prices of the surrounding cells */
. use "$Output_data\BCRT_baseline", clear

. drop if main_lprice == . | main_lprice == 0
(141,470 observations deleted)

. keep if mines == 1
(780 observations deleted)

. collapse (mean) main_lprice, by(mainmineral year)

. keep if year == 1997
(180 observations deleted)

. rename main_lprice main_lprice_a97

. rename mainmineral mainmineral_a 

. keep mainmineral_a main_lprice_a97

. sort mainmineral_a

. save "$Output_data\tempyy", replace
(note: file Data_Code_BCRT_AER\Data\tempyy.dta not found)
file Data_Code_BCRT_AER\Data\tempyy.dta saved

. 
. /*start with baseline dataset*/
. use "$Output_data\BCRT_baseline", clear

. 
. /* trim top 5% of nb events */
. g nb_acled_pos          = nb_acled if nb_acled>0
(136,710 missing values generated)

. egen p95_nb_acled       = pctile(nb_acled_pos), p(95)

. keep if  nb_acled<p95_nb_acled
(415 observations deleted)

. 
. qui tab it, gen(itd)

. drop main_lprice 

. rename main_lprice_mines main_lprice

. 
. g condition_around = (mainmineral != "diamond" & mainmineral_around != "diamond" & mainmineral != "tantalum" & mainmineral_around != "tantalum")

. /*estimation*/
. xtreg nb_acled  main_lprice main_lprice_a itd* if  sd_mines == 0  & sd_mines_a ==0 & condition_around == 1, fe cluster(country_nb)
note: itd2 omitted because of collinearity
note: itd18 omitted because of collinearity
note: itd40 omitted because of collinearity
note: itd53 omitted because of collinearity
note: itd58 omitted because of collinearity
note: itd83 omitted because of collinearity
note: itd87 omitted because of collinearity
note: itd112 omitted because of collinearity
note: itd115 omitted because of collinearity
note: itd128 omitted because of collinearity
note: itd144 omitted because of collinearity
note: itd156 omitted because of collinearity
note: itd169 omitted because of collinearity
note: itd196 omitted because of collinearity
note: itd200 omitted because of collinearity
note: itd220 omitted because of collinearity
note: itd228 omitted because of collinearity
note: itd247 omitted because of collinearity
note: itd266 omitted because of collinearity
note: itd279 omitted because of collinearity
note: itd284 omitted because of collinearity
note: itd296 omitted because of collinearity
note: itd319 omitted because of collinearity
note: itd327 omitted because of collinearity
note: itd338 omitted because of collinearity
note: itd364 omitted because of collinearity
note: itd378 omitted because of collinearity
note: itd385 omitted because of collinearity
note: itd405 omitted because of collinearity
note: itd409 omitted because of collinearity
note: itd434 omitted because of collinearity
note: itd448 omitted because of collinearity
note: itd452 omitted because of collinearity
note: itd463 omitted because of collinearity
note: itd479 omitted because of collinearity
note: itd497 omitted because of collinearity
note: itd518 omitted because of collinearity
note: itd520 omitted because of collinearity
note: itd540 omitted because of collinearity
note: itd550 omitted because of collinearity
note: itd562 omitted because of collinearity
note: itd585 omitted because of collinearity
note: itd594 omitted because of collinearity
note: itd603 omitted because of collinearity
note: itd604 omitted because of collinearity
note: itd605 omitted because of collinearity
note: itd606 omitted because of collinearity
note: itd607 omitted because of collinearity
note: itd608 omitted because of collinearity
note: itd609 omitted because of collinearity
note: itd610 omitted because of collinearity
note: itd611 omitted because of collinearity
note: itd612 omitted because of collinearity
note: itd613 omitted because of collinearity
note: itd614 omitted because of collinearity
note: itd615 omitted because of collinearity
note: itd616 omitted because of collinearity
note: itd628 omitted because of collinearity
note: itd639 omitted because of collinearity
note: itd651 omitted because of collinearity
note: itd667 omitted because of collinearity
note: itd679 omitted because of collinearity
note: itd689 omitted because of collinearity
note: itd711 omitted because of collinearity
note: itd720 omitted because of collinearity

Fixed-effects (within) regression               Number of obs      =    127618
Group variable: cell                            Number of groups   =      9138

R-sq:  within  = 0.0568                         Obs per group: min =         3
       between = 0.0032                                        avg =      14.0
       overall = 0.0013                                        max =        14

                                                F(2,50)            =         .
corr(u_i, Xb)  = -0.5961                        Prob > F           =         .

                             (Std. Err. adjusted for 51 clusters in country_nb)
-------------------------------------------------------------------------------
              |               Robust
     nb_acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
  main_lprice |   .2562765   .1248673     2.05   0.045     .0054731    .5070798
main_lprice_a |   .0769876   .0400658     1.92   0.060    -.0034869     .157462
         itd1 |  -.2070085    .000061 -3391.15   0.000    -.2071311   -.2068859
         itd2 |          0  (omitted)
         itd3 |   .1170919   .0000104  1.1e+04   0.000     .1170711    .1171128
         itd4 |   -.078184   .0000312 -2507.46   0.000    -.0782466   -.0781213
         itd5 |  -.1932157    .000012 -1.6e+04   0.000    -.1932398   -.1931915
         itd6 |  -.5767749   .0000108 -5.4e+04   0.000    -.5767965   -.5767533
         itd7 |  -.5987198   .0000249 -2.4e+04   0.000    -.5987698   -.5986698
         itd8 |  -.6071089   .0001133 -5359.28   0.000    -.6073364   -.6068813
         itd9 |  -.6099416   .0001617 -3771.88   0.000    -.6102664   -.6096168
        itd10 |  -.6019677   .0002893 -2080.59   0.000    -.6025488   -.6013865
        itd11 |    -.56361   .0002885 -1953.34   0.000    -.5641895   -.5630304
        itd12 |  -.6019246   .0002669 -2255.18   0.000    -.6024607   -.6013885
        itd13 |  -.5990869   .0002159 -2774.50   0.000    -.5995206   -.5986532
        itd14 |  -.6101927   .0002924 -2087.06   0.000    -.6107799   -.6096055
        itd15 |   .9101928   1.64e-13  5.6e+12   0.000     .9101928    .9101928
        itd16 |  -.9231838   2.24e-13 -4.1e+12   0.000    -.9231838   -.9231838
        itd17 |  -.5934836   2.33e-13 -2.6e+12   0.000    -.5934836   -.5934836
        itd18 |          0  (omitted)
        itd19 |   1.626095   1.69e-13  9.6e+12   0.000     1.626095    1.626095
        itd20 |   3.902289   1.65e-13  2.4e+13   0.000     3.902289    3.902289
        itd21 |   .7834504   1.66e-13  4.7e+12   0.000     .7834504    .7834504
        itd22 |  -3.531116   1.67e-13 -2.1e+13   0.000    -3.531116   -3.531116
        itd23 |  -4.308894   1.68e-13 -2.6e+13   0.000    -4.308894   -4.308894
        itd24 |  -1.420005   1.29e-13 -1.1e+13   0.000    -1.420005   -1.420005
        itd25 |  -5.642227   1.65e-13 -3.4e+13   0.000    -5.642227   -5.642227
        itd26 |  -2.642227   1.54e-13 -1.7e+13   0.000    -2.642227   -2.642227
        itd27 |  -.4200048   1.52e-13 -2.8e+12   0.000    -.4200048   -.4200048
        itd28 |  -.9755604   1.34e-13 -7.3e+12   0.000    -.9755604   -.9755604
        itd29 |   .0452844   .0111759     4.05   0.000     .0228369    .0677319
        itd30 |   .1394448   .0106151    13.14   0.000     .1181238    .1607658
        itd31 |   .0199024   .0103576     1.92   0.060    -.0009014    .0407062
        itd32 |   .0197547   .0102807     1.92   0.060    -.0008947     .040404
        itd33 |   .0435059   .0102504     4.24   0.000     .0229174    .0640944
        itd34 |   .0199989   .0104078     1.92   0.060    -.0009058    .0409036
        itd35 |   .0452191    .011142     4.06   0.000     .0228399    .0675984
        itd36 |   .0690134    .011134     6.20   0.000     .0466501    .0913768
        itd37 |   .0214444     .01116     1.92   0.060    -.0009712      .04386
        itd38 |   .0211172   .0109898     1.92   0.060    -.0009564    .0431909
        itd39 |   .0642061   .0086322     7.44   0.000     .0468678    .0815444
        itd40 |          0  (omitted)
        itd41 |   .0107304   .0055843     1.92   0.060     -.000486    .0219467
        itd42 |   .1776305   .0057058    31.13   0.000     .1661701    .1890909
        itd43 |  -3.14e-13   9.53e-13    -0.33   0.743    -2.23e-12    1.60e-12
        itd44 |  -3.06e-13   1.02e-12    -0.30   0.766    -2.36e-12    1.75e-12
        itd45 |         .2   1.03e-12  1.9e+11   0.000           .2          .2
        itd46 |  -3.06e-13   1.02e-12    -0.30   0.766    -2.36e-12    1.75e-12
        itd47 |  -3.06e-13   1.02e-12    -0.30   0.766    -2.36e-12    1.75e-12
        itd48 |   .0666667   1.10e-12  6.1e+10   0.000     .0666667    .0666667
        itd49 |  -3.06e-13   1.02e-12    -0.30   0.766    -2.36e-12    1.75e-12
        itd50 |  -3.06e-13   1.02e-12    -0.30   0.766    -2.36e-12    1.75e-12
        itd51 |  -3.06e-13   1.02e-12    -0.30   0.766    -2.36e-12    1.75e-12
        itd52 |  -3.06e-13   1.02e-12    -0.30   0.766    -2.36e-12    1.75e-12
        itd53 |          0  (omitted)
        itd54 |   .1333333   1.02e-12  1.3e+11   0.000     .1333333    .1333333
        itd55 |  -3.06e-13   1.02e-12    -0.30   0.766    -2.36e-12    1.75e-12
        itd56 |   .0666667   1.10e-12  6.1e+10   0.000     .0666667    .0666667
        itd57 |  -.0032892   .0009064    -3.63   0.001    -.0051098   -.0014685
        itd58 |          0  (omitted)
        itd59 |   .0049823   .0006871     7.25   0.000     .0036022    .0063625
        itd60 |  -.0069624   .0020281    -3.43   0.001    -.0110359   -.0028889
        itd61 |   .0334016   .0013198    25.31   0.000     .0307507    .0360525
        itd62 |   .0168363   .0017793     9.46   0.000     .0132625    .0204101
        itd63 |  -.0088895   .0027305    -3.26   0.002    -.0143739   -.0034051
        itd64 |  -.0119205    .003614    -3.30   0.002    -.0191794   -.0046616
        itd65 |  -.0051803   .0039089    -1.33   0.191    -.0130316    .0026711
        itd66 |  -.0180435   .0055202    -3.27   0.002    -.0291311   -.0069559
        itd67 |  -.0144653   .0066795    -2.17   0.035    -.0278815   -.0010492
        itd68 |  -.0092516    .005443    -1.70   0.095    -.0201842    .0016809
        itd69 |   .0014568   .0045136     0.32   0.748     -.007609    .0105226
        itd70 |  -.0181616   .0059722    -3.04   0.004    -.0301571   -.0061661
        itd71 |  -.1331455   6.25e-13 -2.1e+11   0.000    -.1331455   -.1331455
        itd72 |   -.128195   6.25e-13 -2.0e+11   0.000     -.128195    -.128195
        itd73 |   -.147997   6.25e-13 -2.4e+11   0.000     -.147997    -.147997
        itd74 |  -.1529475   6.25e-13 -2.4e+11   0.000    -.1529475   -.1529475
        itd75 |   -.138096   6.25e-13 -2.2e+11   0.000     -.138096    -.138096
        itd76 |  -.0341356   6.44e-13 -5.3e+10   0.000    -.0341356   -.0341356
        itd77 |  -.0143336   6.25e-13 -2.3e+10   0.000    -.0143336   -.0143336
        itd78 |   -.108393   6.25e-13 -1.7e+11   0.000     -.108393    -.108393
        itd79 |  -.0935415   6.25e-13 -1.5e+11   0.000    -.0935415   -.0935415
        itd80 |   .0252703   6.25e-13  4.0e+10   0.000     .0252703    .0252703
        itd81 |   .0566616   6.19e-13  9.1e+10   0.000     .0566616    .0566616
        itd82 |   .0351713   6.26e-13  5.6e+10   0.000     .0351713    .0351713
        itd83 |          0  (omitted)
        itd84 |   .1935872   6.26e-13  3.1e+11   0.000     .1935872    .1935872
        itd85 |   .0426334   .0004624    92.20   0.000     .0417047    .0435621
        itd86 |   .0209985   .0002139    98.15   0.000     .0205688    .0214282
        itd87 |          0  (omitted)
        itd88 |    .166213   .0001536  1082.19   0.000     .1659045    .1665215
        itd89 |  -.1200085   .0003253  -368.91   0.000    -.1206619   -.1193551
        itd90 |  -.0755663   .0014008   -53.94   0.000      -.07838   -.0727527
        itd91 |   .1604523   .0021039    76.27   0.000     .1562266     .164678
        itd92 |  -.1262639    .002443   -51.68   0.000    -.1311709   -.1213569
        itd93 |  -.0560634   .0028588   -19.61   0.000    -.0618055   -.0503213
        itd94 |  -.1339307   .0050386   -26.58   0.000     -.144051   -.1238103
        itd95 |  -.2517167   .0057835   -43.52   0.000    -.2633331   -.2401002
        itd96 |  -.1389843   .0070247   -19.79   0.000    -.1530938   -.1248748
        itd97 |  -.2130071   .0085141   -25.02   0.000     -.230108   -.1959061
        itd98 |  -.0047694   .0096753    -0.49   0.624    -.0242028     .014664
        itd99 |   .0130719   1.74e-13  7.5e+10   0.000     .0130719    .0130719
       itd100 |  -.0326797   1.74e-13 -1.9e+11   0.000    -.0326797   -.0326797
       itd101 |  -.0588235   1.75e-13 -3.4e+11   0.000    -.0588235   -.0588235
       itd102 |  -.0261438   1.74e-13 -1.5e+11   0.000    -.0261438   -.0261438
       itd103 |  -.0457516   1.75e-13 -2.6e+11   0.000    -.0457516   -.0457516
       itd104 |  -.0588235   1.75e-13 -3.4e+11   0.000    -.0588235   -.0588235
       itd105 |  -.0522876   1.75e-13 -3.0e+11   0.000    -.0522876   -.0522876
       itd106 |   .0326797   1.76e-13  1.9e+11   0.000     .0326797    .0326797
       itd107 |   .0457516   1.75e-13  2.6e+11   0.000     .0457516    .0457516
       itd108 |  -.0392157   1.75e-13 -2.2e+11   0.000    -.0392157   -.0392157
       itd109 |   .0588235   1.75e-13  3.4e+11   0.000     .0588235    .0588235
       itd110 |   .0784314   1.76e-13  4.5e+11   0.000     .0784314    .0784314
       itd111 |   .0326797   1.76e-13  1.9e+11   0.000     .0326797    .0326797
       itd112 |          0  (omitted)
       itd113 |  -.1947605   .0007771  -250.63   0.000    -.1963213   -.1931997
       itd114 |  -.1847892    .000114 -1621.28   0.000    -.1850181   -.1845603
       itd115 |          0  (omitted)
       itd116 |  -.3049155   .0003805  -801.35   0.000    -.3056797   -.3041512
       itd117 |  -.1756569   .0002151  -816.62   0.000    -.1760889   -.1752248
       itd118 |  -.2098473   .0003862  -543.30   0.000    -.2106231   -.2090715
       itd119 |   -.340368   .0006454  -527.41   0.000    -.3416643   -.3390718
       itd120 |  -.3112767   .0015715  -198.07   0.000    -.3144332   -.3081202
       itd121 |  -.1837369   .0021178   -86.76   0.000    -.1879906   -.1794832
       itd122 |  -.2426974   .0037457   -64.79   0.000    -.2502209    -.235174
       itd123 |   -.322003   .0037959   -84.83   0.000    -.3296273   -.3143786
       itd124 |  -.2505204   .0037669   -66.51   0.000    -.2580865   -.2429543
       itd125 |   -.057556   .0034798   -16.54   0.000    -.0645454   -.0505667
       itd126 |  -.2655234    .004541   -58.47   0.000    -.2746442   -.2564026
       itd127 |   .1388889   2.24e-13  6.2e+11   0.000     .1388889    .1388889
       itd128 |          0  (omitted)
       itd129 |   .2777778   2.13e-13  1.3e+12   0.000     .2777778    .2777778
       itd130 |  -.0874014   2.90e-13 -3.0e+11   0.000    -.0874014   -.0874014
       itd131 |  -.0925926   2.60e-13 -3.6e+11   0.000    -.0925926   -.0925926
       itd132 |    .037037   2.58e-13  1.4e+11   0.000      .037037     .037037
       itd133 |  -.1149243   2.93e-13 -3.9e+11   0.000    -.1149243   -.1149243
       itd134 |  -.0690527   2.90e-13 -2.4e+11   0.000    -.0690527   -.0690527
       itd135 |  -.0231812   3.82e-13 -6.1e+10   0.000    -.0231812   -.0231812
       itd136 |  -.0965757   3.10e-13 -3.1e+11   0.000    -.0965757   -.0965757
       itd137 |  -.1149243   3.16e-13 -3.6e+11   0.000    -.1149243   -.1149243
       itd138 |  -.1516216   3.17e-13 -4.8e+11   0.000    -.1516216   -.1516216
       itd139 |   .0043418   3.07e-13  1.4e+10   0.000     .0043418    .0043418
       itd140 |  -.0874014   3.10e-13 -2.8e+11   0.000    -.0874014   -.0874014
       itd141 |   2.16e-12   2.56e-12     0.84   0.403    -2.98e-12    7.30e-12
       itd142 |   2.16e-12   2.56e-12     0.84   0.403    -2.98e-12    7.30e-12
       itd143 |   2.16e-12   2.56e-12     0.84   0.403    -2.98e-12    7.30e-12
       itd144 |          0  (omitted)
       itd145 |   2.16e-12   2.56e-12     0.84   0.403    -2.98e-12    7.30e-12
       itd146 |   2.16e-12   2.56e-12     0.84   0.403    -2.98e-12    7.30e-12
       itd147 |   2.16e-12   2.56e-12     0.84   0.403    -2.98e-12    7.30e-12
       itd148 |   2.16e-12   2.56e-12     0.84   0.403    -2.98e-12    7.30e-12
       itd149 |   2.16e-12   2.56e-12     0.84   0.403    -2.98e-12    7.30e-12
       itd150 |   2.16e-12   2.56e-12     0.84   0.403    -2.98e-12    7.30e-12
       itd151 |   2.16e-12   2.56e-12     0.84   0.403    -2.98e-12    7.30e-12
       itd152 |   2.16e-12   2.56e-12     0.84   0.403    -2.98e-12    7.30e-12
       itd153 |   2.16e-12   2.56e-12     0.84   0.403    -2.98e-12    7.30e-12
       itd154 |   2.16e-12   2.56e-12     0.84   0.403    -2.98e-12    7.30e-12
       itd155 |   6.77e-13   8.46e-13     0.80   0.428    -1.02e-12    2.38e-12
       itd156 |          0  (omitted)
       itd157 |   6.77e-13   8.46e-13     0.80   0.428    -1.02e-12    2.38e-12
       itd158 |   6.77e-13   8.46e-13     0.80   0.428    -1.02e-12    2.38e-12
       itd159 |   6.77e-13   8.46e-13     0.80   0.428    -1.02e-12    2.38e-12
       itd160 |   6.77e-13   8.46e-13     0.80   0.428    -1.02e-12    2.38e-12
       itd161 |   6.77e-13   8.46e-13     0.80   0.428    -1.02e-12    2.38e-12
       itd162 |   6.77e-13   8.46e-13     0.80   0.428    -1.02e-12    2.38e-12
       itd163 |   6.77e-13   8.46e-13     0.80   0.428    -1.02e-12    2.38e-12
       itd164 |   6.77e-13   8.46e-13     0.80   0.428    -1.02e-12    2.38e-12
       itd165 |   6.77e-13   8.46e-13     0.80   0.428    -1.02e-12    2.38e-12
       itd166 |   6.77e-13   8.46e-13     0.80   0.428    -1.02e-12    2.38e-12
       itd167 |   6.77e-13   8.46e-13     0.80   0.428    -1.02e-12    2.38e-12
       itd168 |   6.77e-13   8.46e-13     0.80   0.428    -1.02e-12    2.38e-12
       itd169 |          0  (omitted)
       itd170 |   5.95e-13   1.46e-12     0.41   0.686    -2.34e-12    3.53e-12
       itd171 |       .625   1.46e-12  4.3e+11   0.000         .625        .625
       itd172 |       .125   1.46e-12  8.6e+10   0.000         .125        .125
       itd173 |        .25   1.46e-12  1.7e+11   0.000          .25         .25
       itd174 |       .125   1.46e-12  8.6e+10   0.000         .125        .125
       itd175 |       .125   1.46e-12  8.6e+10   0.000         .125        .125
       itd176 |        .25   1.46e-12  1.7e+11   0.000          .25         .25
       itd177 |       .375   1.54e-12  2.4e+11   0.000         .375        .375
       itd178 |       .125   1.46e-12  8.6e+10   0.000         .125        .125
       itd179 |        .25   1.46e-12  1.7e+11   0.000          .25         .25
       itd180 |      1.625   1.46e-12  1.1e+12   0.000        1.625       1.625
       itd181 |   5.95e-13   1.46e-12     0.41   0.686    -2.34e-12    3.53e-12
       itd182 |          1   1.47e-12  6.8e+11   0.000            1           1
       itd183 |   .0324288   .0030474    10.64   0.000      .026308    .0385496
       itd184 |  -.0085711   .0031065    -2.76   0.008    -.0148108   -.0023315
       itd185 |  -.0253442   .0031906    -7.94   0.000    -.0317527   -.0189357
       itd186 |   .1168114   .0031741    36.80   0.000      .110436    .1231868
       itd187 |   .0266624   .0030459     8.75   0.000     .0205446    .0327803
       itd188 |  -.0187137   .0029257    -6.40   0.000    -.0245901   -.0128372
       itd189 |  -.0128385   .0028266    -4.54   0.000    -.0185159   -.0071611
       itd190 |   .0376453   .0024765    15.20   0.000     .0326712    .0426194
       itd191 |   -.038757    .002112   -18.35   0.000    -.0429991    -.034515
       itd192 |   .0215804   .0016123    13.38   0.000      .018342    .0248189
       itd193 |     .01654    .000754    21.94   0.000     .0150255    .0180545
       itd194 |    .024198   .0001207   200.53   0.000     .0239556    .0244404
       itd195 |   .0586901   .0006211    94.50   0.000     .0574426    .0599375
       itd196 |          0  (omitted)
       itd197 |   .0465288   .0001237   376.19   0.000     .0462804    .0467772
       itd198 |  -.0297271   .0000917  -324.02   0.000    -.0299114   -.0295428
       itd199 |  -.0533668   .0001688  -316.13   0.000    -.0537059   -.0530277
       itd200 |          0  (omitted)
       itd201 |  -.0089041   .0002599   -34.25   0.000    -.0094262   -.0083819
       itd202 |   .0116735   .0002095    55.73   0.000     .0112528    .0120942
       itd203 |  -.0392116   .0002619  -149.71   0.000    -.0397377   -.0386856
       itd204 |  -.0549796   .0005284  -104.05   0.000    -.0560409   -.0539183
       itd205 |   .0319877   .0019395    16.49   0.000     .0280922    .0358833
       itd206 |  -.0463862   .0020535   -22.59   0.000    -.0505107   -.0422617
       itd207 |  -.0171565   .0034748    -4.94   0.000    -.0241358   -.0101772
       itd208 |   .0608331   .0039234    15.51   0.000     .0529527    .0687134
       itd209 |   .0038774   .0022657     1.71   0.093    -.0006733    .0084282
       itd210 |    .061032   .0038374    15.90   0.000     .0533243    .0687396
       itd211 |  -.1836735   4.82e-13 -3.8e+11   0.000    -.1836735   -.1836735
       itd212 |   .8571429   4.83e-13  1.8e+12   0.000     .8571429    .8571429
       itd213 |   1.040816   4.83e-13  2.2e+12   0.000     1.040816    1.040816
       itd214 |   .6938776   4.82e-13  1.4e+12   0.000     .6938776    .6938776
       itd215 |  -.1836735   4.82e-13 -3.8e+11   0.000    -.1836735   -.1836735
       itd216 |  -.1020408   4.82e-13 -2.1e+11   0.000    -.1020408   -.1020408
       itd217 |  -.0204082   4.82e-13 -4.2e+10   0.000    -.0204082   -.0204082
       itd218 |  -.0408163   4.82e-13 -8.5e+10   0.000    -.0408163   -.0408163
       itd219 |  -.1020408   4.82e-13 -2.1e+11   0.000    -.1020408   -.1020408
       itd220 |          0  (omitted)
       itd221 |  -.1020408   4.82e-13 -2.1e+11   0.000    -.1020408   -.1020408
       itd222 |  -.0816327   4.82e-13 -1.7e+11   0.000    -.0816327   -.0816327
       itd223 |  -.0612245   4.82e-13 -1.3e+11   0.000    -.0612245   -.0612245
       itd224 |  -.1836735   4.82e-13 -3.8e+11   0.000    -.1836735   -.1836735
       itd225 |  -.1075634   .0000817 -1316.51   0.000    -.1077275   -.1073993
       itd226 |  -.0715218    .000014 -5091.66   0.000      -.07155   -.0714936
       itd227 |  -.1239473   .0000176 -7051.49   0.000    -.1239826    -.123912
       itd228 |          0  (omitted)
       itd229 |  -.0604927   .0000248 -2441.61   0.000    -.0605425    -.060443
       itd230 |   .2292935   .0001648  1391.31   0.000     .2289624    .2296245
       itd231 |  -.0305509   .0002563  -119.18   0.000    -.0310658   -.0300361
       itd232 |  -.0140612   .0003005   -46.79   0.000    -.0146648   -.0134576
       itd233 |  -.0070051   .0003545   -19.76   0.000    -.0077172    -.006293
       itd234 |   -.043563   .0006391   -68.16   0.000    -.0448467   -.0422793
       itd235 |  -.1391758   .0007195  -193.43   0.000     -.140621   -.1377306
       itd236 |  -.0510624   .0008676   -58.86   0.000     -.052805   -.0493199
       itd237 |  -.0072049   .0010452    -6.89   0.000    -.0093042   -.0051055
       itd238 |   .1885494   .0012421   151.80   0.000     .1860545    .1910442
       itd239 |    .010989   2.13e-12  5.2e+09   0.000      .010989     .010989
       itd240 |    .010989   2.13e-12  5.2e+09   0.000      .010989     .010989
       itd241 |    .021978   2.13e-12  1.0e+10   0.000      .021978     .021978
       itd242 |    .021978   2.13e-12  1.0e+10   0.000      .021978     .021978
       itd243 |    .032967   2.12e-12  1.6e+10   0.000      .032967     .032967
       itd244 |  -1.70e-12   2.12e-12    -0.80   0.427    -5.96e-12    2.56e-12
       itd245 |  -1.70e-12   2.12e-12    -0.80   0.427    -5.96e-12    2.56e-12
       itd246 |    .021978   2.13e-12  1.0e+10   0.000      .021978     .021978
       itd247 |          0  (omitted)
       itd248 |    .032967   2.12e-12  1.6e+10   0.000      .032967     .032967
       itd249 |   -.010989   1.99e-12 -5.5e+09   0.000     -.010989    -.010989
       itd250 |    .010989   2.13e-12  5.2e+09   0.000      .010989     .010989
       itd251 |   .0769231   1.99e-12  3.9e+10   0.000     .0769231    .0769231
       itd252 |    .021978   2.13e-12  1.0e+10   0.000      .021978     .021978
       itd253 |   .0784439   .0177404     4.42   0.000     .0428112    .1140766
       itd254 |   .0815271   .0185847     4.39   0.000     .0441986    .1188557
       itd255 |   .0466069   .0189806     2.46   0.018     .0084833    .0847306
       itd256 |   .1001224   .0186787     5.36   0.000     .0626053    .1376396
       itd257 |   .0626345    .018353     3.41   0.001     .0257713    .0994977
       itd258 |   .1284897   .0163886     7.84   0.000     .0955722    .1614071
       itd259 |   .1788519   .0152418    11.73   0.000     .1482377     .209466
       itd260 |   .0857473   .0146103     5.87   0.000     .0564017    .1150929
       itd261 |   .0467102    .013844     3.37   0.001     .0189036    .0745167
       itd262 |   .0689065   .0097624     7.06   0.000     .0492982    .0885148
       itd263 |   .0819108   .0080898    10.13   0.000     .0656619    .0981597
       itd264 |     .05216    .004229    12.33   0.000     .0436658    .0606542
       itd265 |   .0824403   .0027869    29.58   0.000     .0768427    .0880379
       itd266 |          0  (omitted)
       itd267 |  -.2585612   .0112561   -22.97   0.000    -.2811698   -.2359526
       itd268 |   .0257805   .0143544     1.80   0.079    -.0030511     .054612
       itd269 |    .195454   .0142743    13.69   0.000     .1667832    .2241248
       itd270 |   .2109312   .0113622    18.56   0.000     .1881096    .2337527
       itd271 |   .0810882   .0111931     7.24   0.000     .0586063    .1035701
       itd272 |  -.2595309   .0105841   -24.52   0.000    -.2807897   -.2382722
       itd273 |  -.1336531   .0095834   -13.95   0.000    -.1529019   -.1144044
       itd274 |  -.2042991   .0069457   -29.41   0.000      -.21825   -.1903482
       itd275 |  -.1031075   .0049106   -21.00   0.000    -.1129707   -.0932443
       itd276 |   -.252821   .0049812   -50.75   0.000    -.2628261    -.242816
       itd277 |   .3214989     .00523    61.47   0.000     .3109941    .3320038
       itd278 |  -.0384762    .004977    -7.73   0.000    -.0484728   -.0284797
       itd279 |          0  (omitted)
       itd280 |   .0444951   .0069504     6.40   0.000     .0305349    .0584554
       itd281 |       -1.5   1.46e-12 -1.0e+12   0.000         -1.5        -1.5
       itd282 |       -2.5   1.46e-12 -1.7e+12   0.000         -2.5        -2.5
       itd283 |         -1   1.46e-12 -6.8e+11   0.000           -1          -1
       itd284 |          0  (omitted)
       itd285 |          3   1.45e-12  2.1e+12   0.000            3           3
       itd286 |          2   1.45e-12  1.4e+12   0.000            2           2
       itd287 |          2   1.45e-12  1.4e+12   0.000            2           2
       itd288 |        -.5   1.46e-12 -3.4e+11   0.000          -.5         -.5
       itd289 |         -2   1.46e-12 -1.4e+12   0.000           -2          -2
       itd290 |         -1   1.46e-12 -6.8e+11   0.000           -1          -1
       itd291 |         -2   1.46e-12 -1.4e+12   0.000           -2          -2
       itd292 |       -1.5   1.46e-12 -1.0e+12   0.000         -1.5        -1.5
       itd293 |       -2.5   1.46e-12 -1.7e+12   0.000         -2.5        -2.5
       itd294 |         -3   1.45e-12 -2.1e+12   0.000           -3          -3
       itd295 |  -1.128162   .0016453  -685.68   0.000    -1.131466   -1.124857
       itd296 |          0  (omitted)
       itd297 |  -1.083966   .0003294 -3291.05   0.000    -1.084628   -1.083305
       itd298 |  -.2064965   .0023801   -86.76   0.000    -.2112771   -.2017159
       itd299 |  -1.282973   .0021478  -597.35   0.000    -1.287287   -1.278659
       itd300 |  -1.435376   .0013964 -1027.90   0.000     -1.43818   -1.432571
       itd301 |  -1.127472   .0012867  -876.24   0.000    -1.130057   -1.124888
       itd302 |  -1.283855   .0026065  -492.56   0.000     -1.28909   -1.278619
       itd303 |  -.7471007   .0034952  -213.75   0.000     -.754121   -.7400804
       itd304 |  -.5999206   .0069643   -86.14   0.000    -.6139088   -.5859324
       itd305 |    -1.5991   .0065375  -244.61   0.000    -1.612231    -1.58597
       itd306 |  -1.519796    .005298  -286.86   0.000    -1.530437   -1.509154
       itd307 |   -1.12649   .0007755 -1452.65   0.000    -1.128048   -1.124933
       itd308 |   -1.51665   .0036609  -414.28   0.000    -1.524003   -1.509297
       itd309 |   .0833333   5.23e-13  1.6e+11   0.000     .0833333    .0833333
       itd310 |   1.81e-13   5.21e-13     0.35   0.730    -8.66e-13    1.23e-12
       itd311 |  -.1666667   5.23e-13 -3.2e+11   0.000    -.1666667   -.1666667
       itd312 |   1.81e-13   5.21e-13     0.35   0.730    -8.66e-13    1.23e-12
       itd313 |  -.0833333   5.23e-13 -1.6e+11   0.000    -.0833333   -.0833333
       itd314 |  -.0833333   5.23e-13 -1.6e+11   0.000    -.0833333   -.0833333
       itd315 |  -.0833333   5.23e-13 -1.6e+11   0.000    -.0833333   -.0833333
       itd316 |  -.0833333   5.23e-13 -1.6e+11   0.000    -.0833333   -.0833333
       itd317 |  -.0833333   5.23e-13 -1.6e+11   0.000    -.0833333   -.0833333
       itd318 |  -.1666667   5.23e-13 -3.2e+11   0.000    -.1666667   -.1666667
       itd319 |          0  (omitted)
       itd320 |   1.87e-13   5.24e-13     0.36   0.723    -8.65e-13    1.24e-12
       itd321 |         .5   5.23e-13  9.6e+11   0.000           .5          .5
       itd322 |  -.0833333   5.26e-13 -1.6e+11   0.000    -.0833333   -.0833333
       itd323 |  -.0078657    .000046  -171.05   0.000    -.0079581   -.0077733
       itd324 |   .2596087   .0001081  2402.02   0.000     .2593916    .2598258
       itd325 |    .296788   .0001821  1629.71   0.000     .2964222    .2971538
       itd326 |    .222624   .0001353  1645.42   0.000     .2223522    .2228957
       itd327 |          0  (omitted)
       itd328 |   .2695125   .0002448  1100.77   0.000     .2690208    .2700043
       itd329 |  -.0642325   .0004591  -139.91   0.000    -.0651547   -.0633104
       itd330 |  -.0855952   .0005625  -152.17   0.000     -.086725   -.0844654
       itd331 |   .1892936   .0006892   274.65   0.000     .1879093    .1906779
       itd332 |  -.0236232   .0013536   -17.45   0.000     -.026342   -.0209045
       itd333 |   .5368586   .0015434   347.84   0.000     .5337585    .5399586
       itd334 |    .573435   .0017044   336.44   0.000     .5700115    .5768584
       itd335 |   .0592032   .0023058    25.68   0.000     .0545718    .0638345
       itd336 |   .1006454   .0027668    36.38   0.000     .0950882    .1062026
       itd337 |  -.1818182   7.70e-13 -2.4e+11   0.000    -.1818182   -.1818182
       itd338 |          0  (omitted)
       itd339 |   -.219697   7.22e-13 -3.0e+11   0.000     -.219697    -.219697
       itd340 |  -.1818182   7.70e-13 -2.4e+11   0.000    -.1818182   -.1818182
       itd341 |  -.0530303   7.23e-13 -7.3e+10   0.000    -.0530303   -.0530303
       itd342 |    .030303   7.22e-13  4.2e+10   0.000      .030303     .030303
       itd343 |   2.636364   7.59e-13  3.5e+12   0.000     2.636364    2.636364
       itd344 |    .280303   7.22e-13  3.9e+11   0.000      .280303     .280303
       itd345 |  -.6363636   7.19e-13 -8.9e+11   0.000    -.6363636   -.6363636
       itd346 |   .1969697   7.23e-13  2.7e+11   0.000     .1969697    .1969697
       itd347 |   -.219697   7.22e-13 -3.0e+11   0.000     -.219697    -.219697
       itd348 |    .030303   7.23e-13  4.2e+10   0.000      .030303     .030303
       itd349 |   -.469697   7.21e-13 -6.5e+11   0.000     -.469697    -.469697
       itd350 |  -.3030303   7.22e-13 -4.2e+11   0.000    -.3030303   -.3030303
       itd351 |  -.0066225   1.50e-12 -4.4e+09   0.000    -.0066225   -.0066225
       itd352 |  -.0016556   1.50e-12 -1.1e+09   0.000    -.0016556   -.0016556
       itd353 |  -.0033113   1.50e-12 -2.2e+09   0.000    -.0033113   -.0033113
       itd354 |  -.0066225   1.50e-12 -4.4e+09   0.000    -.0066225   -.0066225
       itd355 |  -.0033113   1.50e-12 -2.2e+09   0.000    -.0033113   -.0033113
       itd356 |  -.0049669   1.50e-12 -3.3e+09   0.000    -.0049669   -.0049669
       itd357 |  -.0082781   1.50e-12 -5.5e+09   0.000    -.0082781   -.0082781
       itd358 |  -.0082781   1.50e-12 -5.5e+09   0.000    -.0082781   -.0082781
       itd359 |  -.0082781   1.50e-12 -5.5e+09   0.000    -.0082781   -.0082781
       itd360 |  -.0016556   1.50e-12 -1.1e+09   0.000    -.0016556   -.0016556
       itd361 |  -.0082781   1.50e-12 -5.5e+09   0.000    -.0082781   -.0082781
       itd362 |  -.0033113   1.50e-12 -2.2e+09   0.000    -.0033113   -.0033113
       itd363 |  -.0066225   1.50e-12 -4.4e+09   0.000    -.0066225   -.0066225
       itd364 |          0  (omitted)
       itd365 |   .0448427    .023337     1.92   0.060     -.002031    .0917164
       itd366 |   .0474573   .0246976     1.92   0.060    -.0021494    .0970639
       itd367 |   .0486793   .0253336     1.92   0.060    -.0022047    .0995634
       itd368 |   .0479066   .0249315     1.92   0.060    -.0021697    .0979829
       itd369 |   .0470426   .0244819     1.92   0.060    -.0021306    .0962159
       itd370 |   .5416314   .0216657    25.00   0.000     .4981145    .5851483
       itd371 |   .0380942   .0198249     1.92   0.060    -.0017253    .0779138
       itd372 |   .0363876   .0189368     1.92   0.060     -.001648    .0744233
       itd373 |   .0342959   .0178482     1.92   0.060    -.0015533     .070145
       itd374 |   .0233286   .0121406     1.92   0.060    -.0010566    .0477138
       itd375 |   .0201948   .0105098     1.92   0.060    -.0009146    .0413043
       itd376 |   .0144739   .0075325     1.92   0.060    -.0006555    .0296033
       itd377 |   .0076098   .0039603     1.92   0.060    -.0003447    .0155643
       itd378 |          0  (omitted)
       itd379 |  -.0386673   .0008828   -43.80   0.000    -.0404404   -.0368942
       itd380 |   -.017797   .0012381   -14.37   0.000    -.0202839   -.0153101
       itd381 |  -.0397334    .001251   -31.76   0.000    -.0422462   -.0372207
       itd382 |    .003961   .0010946     3.62   0.001     .0017625    .0061595
       itd383 |  -.0738001   .0004109  -179.63   0.000    -.0746253   -.0729749
       itd384 |  -.0442501   .0002317  -190.99   0.000    -.0447155   -.0437848
       itd385 |          0  (omitted)
       itd386 |  -.0866136   .0030521   -28.38   0.000    -.0927439   -.0804833
       itd387 |  -.0173305   .0043008    -4.03   0.000    -.0259688   -.0086921
       itd388 |  -.0678926   .0100296    -6.77   0.000    -.0880376   -.0477476
       itd389 |  -.0385493   .0130365    -2.96   0.005    -.0647338   -.0123648
       itd390 |   -.094666   .0146599    -6.46   0.000    -.1241114   -.0652207
       itd391 |  -.1015213   .0119629    -8.49   0.000    -.1255494   -.0774932
       itd392 |  -.0502261   .0147693    -3.40   0.001    -.0798911   -.0205611
       itd393 |  -.0582314   1.43e-12 -4.1e+10   0.000    -.0582314   -.0582314
       itd394 |  -.0582314   1.43e-12 -4.1e+10   0.000    -.0582314   -.0582314
       itd395 |  -.0712184   1.42e-12 -5.0e+10   0.000    -.0712184   -.0712184
       itd396 |  -.0582314   1.43e-12 -4.1e+10   0.000    -.0582314   -.0582314
       itd397 |  -.0495734   1.61e-12 -3.1e+10   0.000    -.0495734   -.0495734
       itd398 |   .1130435   1.43e-12  7.9e+10   0.000     .1130435    .1130435
       itd399 |   .0023747   1.60e-12  1.5e+09   0.000     .0023747    .0023747
       itd400 |   .0196907   1.43e-12  1.4e+10   0.000     .0196907    .0196907
       itd401 |  -.0279284   1.51e-12 -1.8e+10   0.000    -.0279284   -.0279284
       itd402 |  -.0322574   1.52e-12 -2.1e+10   0.000    -.0322574   -.0322574
       itd403 |  -.0019543   1.61e-12 -1.2e+09   0.000    -.0019543   -.0019543
       itd404 |  -.0712184   1.42e-12 -5.0e+10   0.000    -.0712184   -.0712184
       itd405 |          0  (omitted)
       itd406 |  -.0106123   1.52e-12 -7.0e+09   0.000    -.0106123   -.0106123
       itd407 |  -.0191986   .0003284   -58.47   0.000    -.0198581   -.0185391
       itd408 |  -.0187686   .0001046  -179.44   0.000    -.0189787   -.0185585
       itd409 |          0  (omitted)
       itd410 |  -.0133897   .0000661  -202.45   0.000    -.0135225   -.0132568
       itd411 |  -.0135318   .0001401   -96.60   0.000    -.0138131   -.0132504
       itd412 |  -.0197267   .0006032   -32.70   0.000    -.0209383   -.0185151
       itd413 |  -.0176559   .0009059   -19.49   0.000    -.0194755   -.0158363
       itd414 |  -.0179366    .001052   -17.05   0.000    -.0200496   -.0158236
       itd415 |  -.0235856    .001231   -19.16   0.000    -.0260582    -.021113
       itd416 |  -.0068216   .0021697    -3.14   0.003    -.0111795   -.0024637
       itd417 |   -.007337   .0024379    -3.01   0.004    -.0122336   -.0024404
       itd418 |   .0129423   .0029275     4.42   0.000     .0070623    .0188224
       itd419 |  -.0120592    .003515    -3.43   0.001    -.0191192   -.0049991
       itd420 |  -.0159632   .0041663    -3.83   0.000    -.0243314    -.007595
       itd421 |  -.0100131   .0040409    -2.48   0.017    -.0181294   -.0018968
       itd422 |   -.044731   .0044768    -9.99   0.000    -.0537229   -.0357391
       itd423 |  -.0357373   .0045314    -7.89   0.000    -.0448388   -.0266358
       itd424 |  -.0095253   .0042948    -2.22   0.031    -.0181515    -.000899
       itd425 |  -.0449665   .0043543   -10.33   0.000    -.0537123   -.0362207
       itd426 |  -.0279489   .0039586    -7.06   0.000    -.0359001   -.0199978
       itd427 |    .011394   .0036167     3.15   0.003     .0041297    .0186583
       itd428 |   .0549614   .0031603    17.39   0.000     .0486139     .061309
       itd429 |   .0010352   .0028517     0.36   0.718    -.0046926    .0067631
       itd430 |  -.0413857   .0015918   -26.00   0.000     -.044583   -.0381883
       itd431 |  -.0330355   .0013115   -25.19   0.000    -.0356697   -.0304013
       itd432 |    .002112   .0010991     1.92   0.060    -.0000957    .0043198
       itd433 |   .1260606   .0008411   149.88   0.000     .1243712      .12775
       itd434 |          0  (omitted)
       itd435 |   .0166202   .0056449     2.94   0.005     .0052821    .0279583
       itd436 |   .0107923   .0056809     1.90   0.063    -.0006181    .0222027
       itd437 |   .0172167   .0059352     2.90   0.006     .0052955    .0291379
       itd438 |   .0110308   .0057709     1.91   0.062    -.0005604     .022622
       itd439 |   .0104046   .0055422     1.88   0.066    -.0007273    .0215365
       itd440 |    .009788   .0052072     1.88   0.066    -.0006709     .020247
       itd441 |   .0092179    .004933     1.87   0.068    -.0006903     .019126
       itd442 |   .0084649   .0046417     1.82   0.074    -.0008582    .0177879
       itd443 |   .0082783   .0035767     2.31   0.025     .0010942    .0154624
       itd444 |   .0037203   .0027515     1.35   0.182    -.0018062    .0092467
       itd445 |   .0005114   .0016189     0.32   0.753    -.0027403    .0037631
       itd446 |   .0017435   .0009419     1.85   0.070    -.0001484    .0036354
       itd447 |   .0069807   .0015521     4.50   0.000     .0038633    .0100982
       itd448 |          0  (omitted)
       itd449 |   2.52e-12   2.88e-12     0.88   0.385    -3.26e-12    8.30e-12
       itd450 |   2.52e-12   2.88e-12     0.88   0.385    -3.26e-12    8.30e-12
       itd451 |   2.52e-12   2.88e-12     0.88   0.385    -3.26e-12    8.30e-12
       itd452 |          0  (omitted)
       itd453 |   2.53e-12   2.88e-12     0.88   0.385    -3.26e-12    8.32e-12
       itd454 |   2.53e-12   2.88e-12     0.88   0.385    -3.26e-12    8.32e-12
       itd455 |   2.53e-12   2.88e-12     0.88   0.385    -3.26e-12    8.32e-12
       itd456 |   2.53e-12   2.88e-12     0.88   0.385    -3.26e-12    8.32e-12
       itd457 |   2.53e-12   2.88e-12     0.88   0.385    -3.26e-12    8.32e-12
       itd458 |   2.53e-12   2.88e-12     0.88   0.385    -3.26e-12    8.32e-12
       itd459 |   2.53e-12   2.88e-12     0.88   0.385    -3.26e-12    8.32e-12
       itd460 |   2.53e-12   2.88e-12     0.88   0.385    -3.26e-12    8.32e-12
       itd461 |   2.53e-12   2.88e-12     0.88   0.385    -3.26e-12    8.32e-12
       itd462 |   2.53e-12   2.88e-12     0.88   0.385    -3.26e-12    8.32e-12
       itd463 |          0  (omitted)
       itd464 |   .1212121   8.38e-13  1.4e+11   0.000     .1212121    .1212121
       itd465 |    .030303   8.38e-13  3.6e+10   0.000      .030303     .030303
       itd466 |   .4242424   8.38e-13  5.1e+11   0.000     .4242424    .4242424
       itd467 |   .5454545   8.38e-13  6.5e+11   0.000     .5454545    .5454545
       itd468 |   .2424242   8.38e-13  2.9e+11   0.000     .2424242    .2424242
       itd469 |   .3636364   8.38e-13  4.3e+11   0.000     .3636364    .3636364
       itd470 |   .0606061   8.38e-13  7.2e+10   0.000     .0606061    .0606061
       itd471 |   .1515152   8.38e-13  1.8e+11   0.000     .1515152    .1515152
       itd472 |   .1212121   8.38e-13  1.4e+11   0.000     .1212121    .1212121
       itd473 |   .2121212   8.38e-13  2.5e+11   0.000     .2121212    .2121212
       itd474 |   .0909091   8.38e-13  1.1e+11   0.000     .0909091    .0909091
       itd475 |    .030303   8.38e-13  3.6e+10   0.000      .030303     .030303
       itd476 |    .030303   8.38e-13  3.6e+10   0.000      .030303     .030303
       itd477 |   -.047571   .0003664  -129.84   0.000    -.0483069   -.0468352
       itd478 |  -.0378936   .0000398  -951.79   0.000    -.0379736   -.0378136
       itd479 |          0  (omitted)
       itd480 |   .0589796    .000203   290.60   0.000      .058572    .0593873
       itd481 |  -.0283231   .0003205   -88.37   0.000    -.0289669   -.0276794
       itd482 |  -.0326677   .0004009   -81.48   0.000    -.0334729   -.0318624
       itd483 |  -.0249331   .0000922  -270.37   0.000    -.0251183   -.0247479
       itd484 |  -.0458772   .0012911   -35.53   0.000    -.0484705   -.0432839
       itd485 |   -.054889   .0014571   -37.67   0.000    -.0578157   -.0519623
       itd486 |  -.0554255   .0036729   -15.09   0.000    -.0628027   -.0480484
       itd487 |  -.0447012   .0045826    -9.75   0.000    -.0539056   -.0354968
       itd488 |  -.0267856   .0042384    -6.32   0.000    -.0352987   -.0182724
       itd489 |  -.0219181   .0040595    -5.40   0.000    -.0300718   -.0137645
       itd490 |  -.0478193   .0055638    -8.59   0.000    -.0589945   -.0366441
       itd491 |   .0306407   4.98e-13  6.1e+10   0.000     .0306407    .0306407
       itd492 |   .0250696   4.99e-13  5.0e+10   0.000     .0250696    .0250696
       itd493 |  -.0027855   4.99e-13 -5.6e+09   0.000    -.0027855   -.0027855
       itd494 |   4.63e-13   5.01e-13     0.92   0.360    -5.43e-13    1.47e-12
       itd495 |  -.0027855   4.98e-13 -5.6e+09   0.000    -.0027855   -.0027855
       itd496 |   .0557103   4.84e-13  1.2e+11   0.000     .0557103    .0557103
       itd497 |          0  (omitted)
       itd498 |   4.60e-13   4.98e-13     0.92   0.360    -5.41e-13    1.46e-12
       itd499 |   4.68e-13   5.06e-13     0.93   0.359    -5.48e-13    1.48e-12
       itd500 |  -.0083565   5.04e-13 -1.7e+10   0.000    -.0083565   -.0083565
       itd501 |   .0083565   5.14e-13  1.6e+10   0.000     .0083565    .0083565
       itd502 |   .0027855   5.27e-13  5.3e+09   0.000     .0027855    .0027855
       itd503 |    .005571   5.15e-13  1.1e+10   0.000      .005571     .005571
       itd504 |   -.005571   5.04e-13 -1.1e+10   0.000     -.005571    -.005571
       itd505 |  -.5418229   5.89e-13 -9.2e+11   0.000    -.5418229   -.5418229
       itd506 |  -.3836902   7.16e-13 -5.4e+11   0.000    -.3836902   -.3836902
       itd507 |  -.3685946   5.82e-13 -6.3e+11   0.000    -.3685946   -.3685946
       itd508 |  -.5680039   6.11e-13 -9.3e+11   0.000    -.5680039   -.5680039
       itd509 |  -.5170235   6.12e-13 -8.4e+11   0.000    -.5170235   -.5170235
       itd510 |  -.3797686   7.19e-13 -5.3e+11   0.000    -.3797686   -.3797686
       itd511 |  -.3213505   5.81e-13 -5.5e+11   0.000    -.3213505   -.3213505
       itd512 |  -.1728774   5.91e-13 -2.9e+11   0.000    -.1728774   -.1728774
       itd513 |  -.2557322   5.82e-13 -4.4e+11   0.000    -.2557322   -.2557322
       itd514 |  -.5195117   5.82e-13 -8.9e+11   0.000    -.5195117   -.5195117
       itd515 |  -.6061259   5.95e-13 -1.0e+12   0.000    -.6061259   -.6061259
       itd516 |  -.4407715   5.82e-13 -7.6e+11   0.000    -.4407715   -.4407715
       itd517 |  -.2911652   5.81e-13 -5.0e+11   0.000    -.2911652   -.2911652
       itd518 |          0  (omitted)
       itd519 |   1.666667   6.16e-13  2.7e+12   0.000     1.666667    1.666667
       itd520 |          0  (omitted)
       itd521 |  -1.433333   6.42e-13 -2.2e+12   0.000    -1.433333   -1.433333
       itd522 |  -.7666667   6.63e-13 -1.2e+12   0.000    -.7666667   -.7666667
       itd523 |   1.316667   6.95e-13  1.9e+12   0.000     1.316667    1.316667
       itd524 |  -.4333333   6.64e-13 -6.5e+11   0.000    -.4333333   -.4333333
       itd525 |  -1.933333   6.39e-13 -3.0e+12   0.000    -1.933333   -1.933333
       itd526 |  -1.283333   6.67e-13 -1.9e+12   0.000    -1.283333   -1.283333
       itd527 |  -1.083333   6.67e-13 -1.6e+12   0.000    -1.083333   -1.083333
       itd528 |  -1.283333   6.67e-13 -1.9e+12   0.000    -1.283333   -1.283333
       itd529 |   .7166667   6.86e-13  1.0e+12   0.000     .7166667    .7166667
       itd530 |  -1.283333   6.67e-13 -1.9e+12   0.000    -1.283333   -1.283333
       itd531 |  -.4333333   6.63e-13 -6.5e+11   0.000    -.4333333   -.4333333
       itd532 |        -.1   6.59e-13 -1.5e+11   0.000          -.1         -.1
       itd533 |  -.0538188   .0004495  -119.73   0.000    -.0547217    -.052916
       itd534 |  -.1006088   .0005887  -170.91   0.000    -.1017911   -.0994264
       itd535 |   -.101635   .0006537  -155.47   0.000     -.102948    -.100322
       itd536 |  -.0640395   .0006126  -104.54   0.000    -.0652699   -.0628091
       itd537 |  -.0967821   .0005675  -170.54   0.000    -.0979219   -.0956422
       itd538 |  -.0457777   .0002792  -163.97   0.000    -.0463385    -.045217
       itd539 |  -.1029481   .0000903 -1140.28   0.000    -.1031294   -.1027667
       itd540 |          0  (omitted)
       itd541 |    -.06455   .0001119  -576.87   0.000    -.0647747   -.0643252
       itd542 |  -.0505983   .0006957   -72.73   0.000    -.0519956    -.049201
       itd543 |  -.0957456   .0008625  -111.01   0.000    -.0974779   -.0940133
       itd544 |  -.0185039   .0011693   -15.82   0.000    -.0208526   -.0161552
       itd545 |   .0000738    .001534     0.05   0.962    -.0030074    .0031549
       itd546 |   .0077564   .0019374     4.00   0.000      .003865    .0116478
       itd547 |  -.2514583   .0008378  -300.13   0.000    -.2531412   -.2497755
       itd548 |  -.5297846    .000368 -1439.49   0.000    -.5305238   -.5290454
       itd549 |   -.484269   .0001578 -3069.30   0.000    -.4845859   -.4839521
       itd550 |          0  (omitted)
       itd551 |   -.514516   .0001009 -5098.14   0.000    -.5147188   -.5143133
       itd552 |  -.4967191   .0007268  -683.44   0.000    -.4981789   -.4952593
       itd553 |  -.6996098    .000336 -2082.08   0.000    -.7002847   -.6989348
       itd554 |  -.7462663   .0005423 -1376.08   0.000    -.7473555    -.745177
       itd555 |  -.7159777   .0007886  -907.87   0.000    -.7175617   -.7143936
       itd556 |   -.581199   .0025832  -224.99   0.000    -.5863874   -.5760105
       itd557 |  -.6833164   .0064818  -105.42   0.000    -.6963354   -.6702974
       itd558 |  -.6714875   .0201017   -33.40   0.000     -.711863   -.6311121
       itd559 |  -.6675926   .0127954   -52.17   0.000     -.693293   -.6418922
       itd560 |   -.592316   .0137063   -43.21   0.000    -.6198459   -.5647861
       itd561 |   -2.64729   .0045516  -581.62   0.000    -2.656432   -2.638148
       itd562 |          0  (omitted)
       itd563 |  -.7912456   .0009881  -800.77   0.000    -.7932302   -.7892609
       itd564 |   3.947318   .0069396   568.81   0.000      3.93338    3.961257
       itd565 |  -2.050428   .0061846  -331.54   0.000     -2.06285   -2.038006
       itd566 |  -3.445735   .0037426  -920.67   0.000    -3.453253   -3.438218
       itd567 |   -3.44505   .0033861 -1017.40   0.000    -3.451852   -3.438249
       itd568 |  -3.253292   .0076754  -423.86   0.000    -3.268709   -3.237876
       itd569 |  -3.458842   .0105636  -327.43   0.000     -3.48006   -3.437625
       itd570 |  -3.480507   .0218383  -159.38   0.000     -3.52437   -3.436643
       itd571 |  -3.477841   .0204511  -170.06   0.000    -3.518919   -3.436764
       itd572 |    -3.4701   .0164226  -211.30   0.000    -3.503086   -3.437115
       itd573 |  -3.441858   .0017246 -1995.77   0.000    -3.445322   -3.438394
       itd574 |  -3.459877   .0111022  -311.64   0.000    -3.482177   -3.437578
       itd575 |  -.5855822   2.95e-13 -2.0e+12   0.000    -.5855822   -.5855822
       itd576 |  -.5678044   2.94e-13 -1.9e+12   0.000    -.5678044   -.5678044
       itd577 |  -.4711727   1.71e-13 -2.8e+12   0.000    -.4711727   -.4711727
       itd578 |  -.3682211   2.80e-13 -1.3e+12   0.000    -.3682211   -.3682211
       itd579 |  -.5155425   2.86e-13 -1.8e+12   0.000    -.5155425   -.5155425
       itd580 |  -.4532355   1.71e-13 -2.7e+12   0.000    -.4532355   -.4532355
       itd581 |  -.4351854   2.85e-13 -1.5e+12   0.000    -.4351854   -.4351854
       itd582 |  -.2317034   1.31e-13 -1.8e+12   0.000    -.2317034   -.2317034
       itd583 |  -.6700266   2.93e-13 -2.3e+12   0.000    -.6700266   -.6700266
       itd584 |   .0658234   6.42e-14  1.0e+12   0.000     .0658234    .0658234
       itd585 |          0  (omitted)
       itd586 |   .0160496   6.24e-14  2.6e+11   0.000     .0160496    .0160496
       itd587 |   .4150313   8.55e-14  4.9e+12   0.000     .4150313    .4150313
       itd588 |   .4471877   1.14e-13  3.9e+12   0.000     .4471877    .4471877
       itd589 |   2.65e-12   3.00e-12     0.89   0.380    -3.37e-12    8.68e-12
       itd590 |   2.65e-12   3.00e-12     0.89   0.380    -3.37e-12    8.68e-12
       itd591 |   2.63e-12   2.98e-12     0.88   0.381    -3.35e-12    8.62e-12
       itd592 |   2.63e-12   2.98e-12     0.88   0.381    -3.35e-12    8.62e-12
       itd593 |   2.63e-12   2.98e-12     0.88   0.381    -3.35e-12    8.62e-12
       itd594 |          0  (omitted)
       itd595 |   2.63e-12   2.98e-12     0.88   0.381    -3.35e-12    8.62e-12
       itd596 |   2.63e-12   2.98e-12     0.88   0.381    -3.35e-12    8.62e-12
       itd597 |   2.63e-12   2.98e-12     0.88   0.381    -3.35e-12    8.62e-12
       itd598 |   2.63e-12   2.98e-12     0.88   0.381    -3.35e-12    8.62e-12
       itd599 |   2.63e-12   2.98e-12     0.88   0.381    -3.35e-12    8.62e-12
       itd600 |   2.63e-12   2.98e-12     0.88   0.381    -3.35e-12    8.62e-12
       itd601 |   2.63e-12   2.98e-12     0.88   0.381    -3.35e-12    8.62e-12
       itd602 |   2.63e-12   2.98e-12     0.88   0.381    -3.35e-12    8.62e-12
       itd603 |          0  (omitted)
       itd604 |          0  (omitted)
       itd605 |          0  (omitted)
       itd606 |          0  (omitted)
       itd607 |          0  (omitted)
       itd608 |          0  (omitted)
       itd609 |          0  (omitted)
       itd610 |          0  (omitted)
       itd611 |          0  (omitted)
       itd612 |          0  (omitted)
       itd613 |          0  (omitted)
       itd614 |          0  (omitted)
       itd615 |          0  (omitted)
       itd616 |          0  (omitted)
       itd617 |   -.088345   2.49e-12 -3.5e+10   0.000     -.088345    -.088345
       itd618 |  -.1069496   2.35e-12 -4.6e+10   0.000    -.1069496   -.1069496
       itd619 |  -.0976473   2.34e-12 -4.2e+10   0.000    -.0976473   -.0976473
       itd620 |  -.0929962   2.44e-12 -3.8e+10   0.000    -.0929962   -.0929962
       itd621 |  -.1046241   2.34e-12 -4.5e+10   0.000    -.1046241   -.1046241
       itd622 |  -.0929962   2.48e-12 -3.7e+10   0.000    -.0929962   -.0929962
       itd623 |  -.0813682   2.49e-12 -3.3e+10   0.000    -.0813682   -.0813682
       itd624 |  -.0278799   2.48e-12 -1.1e+10   0.000    -.0278799   -.0278799
       itd625 |  -.0627636   2.41e-12 -2.6e+10   0.000    -.0627636   -.0627636
       itd626 |   .0652681   2.18e-12  3.0e+10   0.000     .0652681    .0652681
       itd627 |   .0651434   2.33e-12  2.8e+10   0.000     .0651434    .0651434
       itd628 |          0  (omitted)
       itd629 |  -.0767171   2.47e-12 -3.1e+10   0.000    -.0767171   -.0767171
       itd630 |  -.0929962   2.49e-12 -3.7e+10   0.000    -.0929962   -.0929962
       itd631 |   .3085888   .0029682   103.96   0.000     .3026269    .3145507
       itd632 |    .304903   .0028686   106.29   0.000     .2991413    .3106648
       itd633 |  -.0967892   .0029332   -33.00   0.000    -.1026807   -.0908977
       itd634 |  -.0306278   .0029654   -10.33   0.000     -.036584   -.0246715
       itd635 |   -.030827   .0029797   -10.35   0.000     -.036812   -.0248421
       itd636 |   -.096459   .0029153   -33.09   0.000    -.1023145   -.0906035
       itd637 |  -.0916343   .0029531   -31.03   0.000    -.0975657   -.0857028
       itd638 |  -.0916863   .0029497   -31.08   0.000     -.097611   -.0857617
       itd639 |          0  (omitted)
       itd640 |  -.2259677   .0028991   -77.94   0.000    -.2317908   -.2201446
       itd641 |  -.2414613   .0046404   -52.03   0.000    -.2507819   -.2321407
       itd642 |  -.1648575   .0189346    -8.71   0.000    -.2028888   -.1268262
       itd643 |  -.0614918   .0094172    -6.53   0.000    -.0804068   -.0425769
       itd644 |  -.0923896   .0109085    -8.47   0.000       -.1143   -.0704792
       itd645 |  -.0186857   .0007314   -25.55   0.000    -.0201547   -.0172166
       itd646 |  -.0514018   .0009867   -52.09   0.000    -.0533837     -.04942
       itd647 |  -.0350146   .0008226   -42.56   0.000    -.0366669   -.0333624
       itd648 |  -.0215413   .0017835   -12.08   0.000    -.0251237    -.017959
       itd649 |  -.0047313   .0016605    -2.85   0.006    -.0080665   -.0013961
       itd650 |   .0464338   .0006888    67.41   0.000     .0450502    .0478174
       itd651 |          0  (omitted)
       itd652 |  -.0047001   .0017049    -2.76   0.008    -.0081245   -.0012757
       itd653 |   .0767561    .007499    10.24   0.000     .0616939    .0918184
       itd654 |  -.0989314     .01242    -7.97   0.000    -.1238777   -.0739851
       itd655 |  -.1168339   .0192562    -6.07   0.000    -.1555111   -.0781568
       itd656 |  -.1378193   .0271538    -5.08   0.000    -.1923593   -.0832794
       itd657 |   -.089824   .0152665    -5.88   0.000    -.1204877   -.0591603
       itd658 |   .1843517   .0214053     8.61   0.000     .1413579    .2273455
       itd659 |   -.052785   .0009176   -57.53   0.000     -.054628    -.050942
       itd660 |  -.0751613   .0011452   -65.63   0.000    -.0774615   -.0728611
       itd661 |  -.0559454   .0012516   -44.70   0.000    -.0584593   -.0534315
       itd662 |  -.0142496   .0011843   -12.03   0.000    -.0166284   -.0118708
       itd663 |   .0350355   .0011091    31.59   0.000     .0328078    .0372632
       itd664 |  -.0685314    .000638  -107.42   0.000    -.0698128     -.06725
       itd665 |  -.0729254     .00033  -220.99   0.000    -.0735882   -.0722626
       itd666 |   .0408575   .0001814   225.23   0.000     .0404931    .0412218
       itd667 |          0  (omitted)
       itd668 |  -.0145592   .0009556   -15.24   0.000    -.0164786   -.0126399
       itd669 |  -.0721177   .0012284   -58.71   0.000    -.0745851   -.0696503
       itd670 |   .0067731   .0017265     3.92   0.000     .0033052    .0102409
       itd671 |  -.0742232   .0023242   -31.94   0.000    -.0788915    -.069555
       itd672 |  -.0869032   .0029867   -29.10   0.000    -.0929022   -.0809042
       itd673 |  -.7219103   1.19e-12 -6.1e+11   0.000    -.7219103   -.7219103
       itd674 |  -.0022482   1.16e-12 -1.9e+09   0.000    -.0022482   -.0022482
       itd675 |  -.2744001   1.15e-12 -2.4e+11   0.000    -.2744001   -.2744001
       itd676 |  -.5867752   1.19e-12 -4.9e+11   0.000    -.5867752   -.5867752
       itd677 |  -.2074731   1.15e-12 -1.8e+11   0.000    -.2074731   -.2074731
       itd678 |   .2856776   1.15e-12  2.5e+11   0.000     .2856776    .2856776
       itd679 |          0  (omitted)
       itd680 |   .5028775   1.04e-12  4.8e+11   0.000     .5028775    .5028775
       itd681 |    .554871   1.05e-12  5.3e+11   0.000      .554871     .554871
       itd682 |  -.1948833   1.36e-12 -1.4e+11   0.000    -.1948833   -.1948833
       itd683 |  -.6036426   1.19e-12 -5.1e+11   0.000    -.6036426   -.6036426
       itd684 |  -.5077521   1.19e-12 -4.3e+11   0.000    -.5077521   -.5077521
       itd685 |  -.1241905   1.17e-12 -1.1e+11   0.000    -.1241905   -.1241905
       itd686 |  -.4666563   1.18e-12 -3.9e+11   0.000    -.4666563   -.4666563
       itd687 |  -.0297588   .0006752   -44.07   0.000     -.031115   -.0284026
       itd688 |  -.0204356   .0002141   -95.45   0.000    -.0208657   -.0200056
       itd689 |          0  (omitted)
       itd690 |   .0068165   .0018778     3.63   0.001     .0030447    .0105882
       itd691 |  -.0096985   .0021078    -4.60   0.000    -.0139321    -.005465
       itd692 |   .0358696   .0027902    12.86   0.000     .0302654    .0414738
       itd693 |  -.0259596   .0040634    -6.39   0.000    -.0341211   -.0177981
       itd694 |  -.0425007   .0052737    -8.06   0.000    -.0530932   -.0319081
       itd695 |   .0987545   .0074471    13.26   0.000     .0837966    .1137124
       itd696 |  -.0264517   .0111464    -2.37   0.022    -.0488399   -.0040636
       itd697 |   .0669569   .0131928     5.08   0.000     .0404583    .0934554
       itd698 |  -.0366521    .013951    -2.63   0.011    -.0646735   -.0086307
       itd699 |   .0195643   .0125393     1.56   0.125    -.0056216    .0447501
       itd700 |   .0008946   .0165538     0.05   0.957    -.0323546    .0341438
       itd701 |  -.0670875   .0092865    -7.22   0.000      -.08574   -.0484351
       itd702 |  -.0484243   .0114376    -4.23   0.000    -.0713974   -.0254513
       itd703 |  -.0698552   .0117289    -5.96   0.000    -.0934134    -.046297
       itd704 |  -.0331594   .0104928    -3.16   0.003    -.0542348    -.012084
       itd705 |   .0347311   .0110726     3.14   0.003     .0124912    .0569711
       itd706 |  -.0728098   .0106732    -6.82   0.000    -.0942475    -.051372
       itd707 |  -.0483212    .010033    -4.82   0.000     -.068473   -.0281694
       itd708 |  -.0605537   .0069608    -8.70   0.000    -.0745348   -.0465726
       itd709 |   .0061469   .0052065     1.18   0.243    -.0043106    .0166045
       itd710 |   .0027341   .0004776     5.72   0.000     .0017748    .0036935
       itd711 |          0  (omitted)
       itd712 |  -.0691918   .0006064  -114.10   0.000    -.0704099   -.0679737
       itd713 |  -.0107094   .0016751    -6.39   0.000    -.0140739    -.007345
       itd714 |  -.0573789   .0015207   -37.73   0.000    -.0604332   -.0543246
       itd715 |  -2.635626    .004781  -551.27   0.000    -2.645229   -2.626023
       itd716 |  -2.332788   .0074262  -314.13   0.000    -2.347704   -2.317872
       itd717 |   -2.52982    .007407  -341.55   0.000    -2.544697   -2.514943
       itd718 |   -1.18267   .0033836  -349.53   0.000    -1.189466   -1.175874
       itd719 |  -1.345173   .0035185  -382.31   0.000     -1.35224   -1.338106
       itd720 |          0  (omitted)
       itd721 |  -1.921206   .0041293  -465.26   0.000      -1.9295   -1.912912
       itd722 |  -1.690788   .0072091  -234.53   0.000    -1.705268   -1.676308
       itd723 |  -1.862595    .009227  -201.86   0.000    -1.881128   -1.844063
       itd724 |  -2.039837   .0189898  -107.42   0.000    -2.077979   -2.001695
       itd725 |  -2.072863   .0220867   -93.85   0.000    -2.117225     -2.0285
       itd726 |  -.9440422   .0259363   -36.40   0.000    -.9961367   -.8919476
       itd727 |  -1.878083   .0268416   -69.97   0.000    -1.931996    -1.82417
       itd728 |  -1.312856   .0343687   -38.20   0.000    -1.381888   -1.243824
        _cons |   .1215569    .040255     3.02   0.004     .0407023    .2024115
--------------+----------------------------------------------------------------
      sigma_u |  .74153195
      sigma_e |  .67352189
          rho |  .54795105   (fraction of variance due to u_i)
-------------------------------------------------------------------------------

. *
. keep if  condition_around == 1  /* prediction only on minerals with reliable prices */
(5,020 observations deleted)

. *
. cap drop benchLPM_nb

. predict  benchLPM_nb 
(option xb assumed; fitted values)
(324 missing values generated)

. sum benchLPM_nb, d

                      Linear prediction
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.6003534       -5.52067
 5%    -.4082277       -5.52067
10%    -.1341753       -5.52067       Obs             138,931
25%     .0500351       -5.52067       Sum of Wgt.     138,931

50%      .114352                      Mean           .2106416
                        Largest       Std. Dev.       .596733
75%     .1539857       6.055965
90%     .7213525       6.055965       Variance       .3560903
95%     1.370546       6.271325       Skewness       3.481656
99%       1.8997       6.357431       Kurtosis       31.92828

. *
. tsset cell year
       panel variable:  cell (unbalanced)
        time variable:  year, 1997 to 2010, but with gaps
                delta:  1 unit

. /* counterfactual: put all prices to their 97 level */
. sort  mainmineral 

. merge mainmineral using  "$Output_data\tempzz", nokeep
(note: you are using old merge syntax; see [D] merge for new syntax)
variable mainmineral does not uniquely identify observations in the master data

. tab  _merge

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    137,123       98.47       98.47
          3 |      2,132        1.53      100.00
------------+-----------------------------------
      Total |    139,255      100.00

. drop _merge

. *
. rename mainmineral_around mainmineral_a

. sort  mainmineral_a

. merge mainmineral_a using "$Output_data\tempyy", nokeep
(note: you are using old merge syntax; see [D] merge for new syntax)
variable mainmineral_a does not uniquely identify observations in the master data

. tab  _merge

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    118,782       85.30       85.30
          3 |     20,473       14.70      100.00
------------+-----------------------------------
      Total |    139,255      100.00

. drop _merge

. *
. replace main_lprice         = main_lprice97   if main_lprice   != 0
(1,712 real changes made, 338 to missing)

. replace main_lprice_a       = main_lprice_a97 if main_lprice_a != 0
(21,559 real changes made, 2,554 to missing)

. *
. cap drop counterLPM_nb

. predict counterLPM_nb
(option xb assumed; fitted values)
(2,873 missing values generated)

. sum counterLPM_nb, d

                      Linear prediction
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.5617595       -5.52067
 5%    -.3979548       -5.52067
10%    -.1439665       -5.52067       Obs             136,382
25%     .0487471       -5.52067       Sum of Wgt.     136,382

50%     .1132788                      Mean           .1998122
                        Largest       Std. Dev.      .5744714
75%     .1482193       5.842574
90%     .6915664       5.842574       Variance       .3300174
95%     1.356844       6.057933       Skewness       3.454368
99%     1.600846        6.09451       Kurtosis       32.69463

. 
. /* how many events did not happen? */
. g diff = benchLPM_nb-counterLPM_nb
(2,873 missing values generated)

. sum diff, d

                            diff
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.0154099       -.117532
 5%            0      -.1138418
10%            0      -.1105485       Obs             136,382
25%            0      -.0991468       Sum of Wgt.     136,382

50%            0                      Mean           .0048992
                        Largest       Std. Dev.      .0253622
75%            0       .5611367
90%            0       .5930846       Variance       .0006432
95%     .0430283       .6131481       Skewness       8.598806
99%     .0896854        .650723       Kurtosis       110.8926

. /* drop 1997 (no change by definition) */
. drop if year == 1997
(9,957 observations deleted)

. /* keep if comparison can be made */
. replace counterLPM_nb = . if benchLPM_nb   ==.
(0 real changes made)

. replace benchLPM_nb   = . if counterLPM_nb ==.
(2,391 real changes made, 2,391 to missing)

. replace nb_acled      = . if counterLPM_nb ==.
(2,667 real changes made, 2,667 to missing)

. drop if counterLPM_nb == . | benchLPM_nb  == . | nb_acled == .
(2,667 observations deleted)

. save "$Output_data\tempzz", replace
file Data_Code_BCRT_AER\Data\tempzz.dta saved

. 
. ***********************************************
. * country level effect for map (not reported) *
. ***********************************************
. 
. use "$Output_data\tempzz", clear

. /* sum events by year and country */
. collapse (sum) nb_acled diff counterLPM_nb benchLPM_nb, by(iso_1 year)

. /* sum events by country over the period */ 
. collapse (sum) nb_acled diff counterLPM_nb benchLPM_nb, by(iso_1)

. g share1 = diff/nb_acled 
(4 missing values generated)

. g share2 = diff/benchLPM_nb 

. 
. sum, d 

                          Iso code
-------------------------------------------------------------
no observations

                       (sum) nb_acled
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            8              0       Obs                  51
25%           41              0       Sum of Wgt.          51

50%          161                      Mean           361.0196
                        Largest       Std. Dev.      484.2297
75%          402           1402
90%         1097           1494       Variance       234478.4
95%         1494           1501       Skewness       1.854569
99%         2134           2134       Kurtosis       5.842144

                         (sum) diff
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs                  51
25%            0              0       Sum of Wgt.          51

50%     3.670922                      Mean           13.10125
                        Largest       Std. Dev.       17.5636
75%      23.4632       42.70097
90%     33.09464       44.59381       Variance         308.48
95%     44.59381       69.32211       Skewness       1.559394
99%     70.86765       70.86765       Kurtosis       5.226371

                     (sum) counterLPM_nb
-------------------------------------------------------------
      Percentiles      Smallest
 1%     -1428.01       -1428.01
 5%    -490.3092      -621.9601
10%    -124.8761      -490.3092       Obs                  51
25%     3.160479      -272.9677       Sum of Wgt.          51

50%     231.7767                      Mean           501.7063
                        Largest       Std. Dev.       773.896
75%     985.0297         1572.2
90%     1392.879       2094.216       Variance         598915
95%     2094.216        2461.62       Skewness       .6945883
99%     2743.161       2743.161       Kurtosis        3.93006

                      (sum) benchLPM_nb
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -1427.371      -1427.371
 5%    -466.8095      -615.1594
10%    -124.4776      -466.8095       Obs                  51
25%     3.160479      -272.9677       Sum of Wgt.          51

50%     231.7767                      Mean           514.8076
                        Largest       Std. Dev.      785.1346
75%     990.3039        1590.72
90%     1421.374       2128.749       Variance       616436.3
95%     2128.749       2532.487       Skewness       .7165332
99%     2785.862       2785.862       Kurtosis       3.939777

                           share1
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs                  47
25%            0              0       Sum of Wgt.          47

50%     .0208968                      Mean           .1815458
                        Largest       Std. Dev.      .5932513
75%     .0961606       .4015464
90%      .351707       .4442477       Variance       .3519471
95%     .4442477       1.173536       Skewness       5.654393
99%     3.934733       3.934733       Kurtosis       35.76186

                           share2
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.1806843      -.1806843
 5%    -.0132394      -.0503411
10%    -.0023636      -.0132394       Obs                  51
25%            0      -.0110553       Sum of Wgt.          51

50%     .0047007                      Mean           .0135034
                        Largest       Std. Dev.      .0559383
75%     .0208526       .0409954
90%     .0289227       .0546979       Variance       .0031291
95%     .0546979       .1178303       Skewness       2.596644
99%     .3204832       .3204832       Kurtosis        21.7579

. *
. rename iso_1 ISO3

. sort ISO3

. keep ISO3 diff nb_acled share1

. save "$Output_data\Figure_A9b", replace
(note: file Data_Code_BCRT_AER\Data\Figure_A9b.dta not found)
file Data_Code_BCRT_AER\Data\Figure_A9b.dta saved

. *
. use "$Output_data\BCRT_baseline", replace

. g condition_around = (mainmineral != "diamond" & mainmineral_around != "diamond" & mainmineral != "tantalum" & mainmineral_around != "tantalum")

. keep if  condition_around == 1 /* only predictions on minerals with reliable prices */
(5,026 observations deleted)

. *
. replace main_lprice = . if main_lprice == 0
(137,158 real changes made, 137,158 to missing)

. collapse (mean) main_lprice mines, by(iso_1)

. g noprice = (mines>0 & main_lprice == .)

. 
. rename iso_1 ISO3

. sort ISO3

. merge ISO3 using "$Output_data\Figure_A9b", nokeep
(note: you are using old merge syntax; see [D] merge for new syntax)

. tab _merge

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          1        1.92        1.92
          3 |         51       98.08      100.00
------------+-----------------------------------
      Total |         52      100.00

. drop _merge

. *
. rename share1 share

. replace share = -1 if share == 0 & noprice == 1
(0 real changes made)

. drop noprice

. 
. g share_bin = . 
(52 missing values generated)

. replace share_bin = 1 if share >= 0.000 & share < 0.01 & share != .
(20 real changes made)

. replace share_bin = 2 if share >= 0.010 & share < 0.050 & share != .
(7 real changes made)

. replace share_bin = 3 if share >= 0.050 & share < 0.200 & share != .
(11 real changes made)

. replace share_bin = 4 if share >= 0.200 & share < 0.500 & share != .
(7 real changes made)

. replace share_bin = 5 if share >= 0.500 & share != . 
(2 real changes made)

. replace share_bin = 0 if mines == 0 | nb_acled == . | nb_acled == 0/* no observation in estimation */
(26 real changes made)

. 
. sort ISO3

. 
. save "$Output_data\Figure_A9b", replace
file Data_Code_BCRT_AER\Data\Figure_A9b.dta saved

. outsheet using "$Results\Figure_A9b.csv", comma replace
(note: file Data_Code_BCRT_AER\results\Figure_A9b.csv not found)

. 
. *************************
. * Bar chart (Figure A9b) *
. *************************
. 
. rename share increase

. drop if increase == 0 | increase == . | increase == -1
(19 observations deleted)

. replace increase = 1 if increase > 1
(2 real changes made)

. graph hbar (sum) increase, over(ISO3, sort(increase) label(labsize(small))) bar(1, color(black)) legend(off) bgcolor(white) graphregion(color(white)) intensity(40)   lintensity(100) ytitle(Share of events explained by increase in mineral prices)  

. graph export $Results\Figure_A9b.eps, as(eps) replace
(note: file Data_Code_BCRT_AER\results\Figure_A9b.eps not found)
(file Data_Code_BCRT_AER\results\Figure_A9b.eps written in EPS format)

. 
. *****************************
. * aggregate quantifications *
. *****************************
. 
. /*get total number of observed events */
. /*(to be able to drop countries with less than 50 events in total sample)*/
. 
. use "$Output_data\BCRT_baseline", replace

. drop if year == 1997
(10,335 observations deleted)

. collapse (sum) nb_acled, by(iso_1)

. sort iso_1

. save "$Output_data\tempzz.dta", replace
file Data_Code_BCRT_AER\Data\tempzz.dta saved

. 
. ///// AGGREGATE QUANTIFICATIONS /////
> 
. use "$Output_data\Figure_A9b", clear

. drop nb_acled

. rename ISO3 iso_1

. sort  iso_1

. merge iso_1 using "$Output_data\tempzz.dta", nokeep
(note: you are using old merge syntax; see [D] merge for new syntax)

. tab  _merge

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          3 |         52      100.00      100.00
------------+-----------------------------------
      Total |         52      100.00

. drop _merge

. 
. drop if share == 0 | share == . | share == -1 
(19 observations deleted)

. replace share = 1 if share > 1
(2 real changes made)

. 
. /* how many on average across countries with mines */
. egen mean = mean(share)

. di mean 
.1643752

. /* how many on average across countries with mines, excluding countries with <50 events ? */
. drop mean 

. egen mean = mean(share) if nb_acled>=50
(4 missing values generated)

. di mean 
.10334849

. *
. erase  "$Output_data\tempzz.dta"

. erase  "$Output_data\tempyy.dta"

. erase "$Output_data\Figure_A9b.dta"

. 
. 
. log close
      name:  <unnamed>
       log:  D:\Travail\Dropbox\mining_conflict\Data_Code_BCRT_AER\results\Results_quantifications.log
  log type:  text
 closed on:  14 Dec 2016, 09:57:24
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
