----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\Travail\Dropbox\mining_conflict\Data_Code_BCRT_AER\results\Tables_A17_to_A20.log
  log type:  text
 opened on:  14 Dec 2016, 12:03:02

. 
. *-----------------------------*
. * Table A19 : log differences *
. *-----------------------------*
. 
. use "$Output_data\BCRT_baseline", clear

. 
. /* drop diamonds for baseline */
. drop if mainmineral == "diamond" | mainmineral == "tantalum"
(588 observations deleted)

. 
. /*linear trends by mineral*/
. g trend = year-1996

. replace mainmineral = "nomineral" if mainmineral == ""
(141,372 real changes made)

. tab mainmineral, gen(mainminerald)

       Main |
 mineral of |
   the cell |      Freq.     Percent        Cum.
------------+-----------------------------------
   aluminum |         56        0.04        0.04
       coal |        448        0.31        0.35
     copper |        378        0.26        0.61
       gold |      1,162        0.81        1.42
       iron |        196        0.14        1.55
       lead |         28        0.02        1.57
     nickel |         70        0.05        1.62
  nomineral |    141,372       98.11       99.73
  phosphate |         98        0.07       99.80
   platinum |        140        0.10       99.89
     silver |         14        0.01       99.90
        tin |         28        0.02       99.92
       zinc |        112        0.08      100.00
------------+-----------------------------------
      Total |    144,102      100.00

. forvalues x=1(1)13{
  2. gen trend_mainmineral`x' = trend*mainminerald`x'
  3. }

. /*column 1: price levels */
. eststo: my_reg2hdfespatial acled  main_lprice_mines   if sd_mines == 0                                                                                                                  , timevar(it) panelvar(cell) lat(latitude) lon(longitude) distcu
> toff(500) lagcutoff(100000) 
 
OLS REGRESSION
 
SE CORRECTED FOR CROSS-SECTIONAL SPATIAL DEPENDANCE
             AND PANEL-SPECIFIC SERIAL CORRELATION
 
DEPENDANT VARIABLE: acled
INDEPENDANT VARIABLES:  main_lprice_mines
 
SPATIAL CORRELATION KERNAL CUTOFF: 500 KM
(NOTE: LINEAR BARTLETT WINDOW USED FOR SPATIAL KERNAL)
SERIAL CORRELATION KERNAL CUTOFF: 100000 PERIODS
-----------------------------------------------------------------------------------
            acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
main_lprice_mines |   .0716129   .0198858     3.60   0.000     .0326372    .1105886
-----------------------------------------------------------------------------------
D:\Travail\Dropbox\mining_conflict
(est1 stored)

. /*column 2: first log difference */
. eststo: my_reg2hdfespatial acled  main_dlprice_mines  if sd_mines == 0                                                                                                                  , timevar(it) panelvar(cell) lat(latitude) lon(longitude) distcu
> toff(500) lagcutoff(100000) 
 
OLS REGRESSION
 
SE CORRECTED FOR CROSS-SECTIONAL SPATIAL DEPENDANCE
             AND PANEL-SPECIFIC SERIAL CORRELATION
 
DEPENDANT VARIABLE: acled
INDEPENDANT VARIABLES:  main_dlprice_mines
 
SPATIAL CORRELATION KERNAL CUTOFF: 500 KM
(NOTE: LINEAR BARTLETT WINDOW USED FOR SPATIAL KERNAL)
SERIAL CORRELATION KERNAL CUTOFF: 100000 PERIODS
------------------------------------------------------------------------------------
             acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------+----------------------------------------------------------------
main_dlprice_mines |   .0171067   .0421166     0.41   0.685     -.065441    .0996545
------------------------------------------------------------------------------------
D:\Travail\Dropbox\mining_conflict
(est2 stored)

. /*column 3: second differences */
. eststo: my_reg2hdfespatial acled  main_d2lprice_mines if sd_mines == 0                                                                                                                  , timevar(it) panelvar(cell) lat(latitude) lon(longitude) distcu
> toff(500) lagcutoff(100000) 
 
OLS REGRESSION
 
SE CORRECTED FOR CROSS-SECTIONAL SPATIAL DEPENDANCE
             AND PANEL-SPECIFIC SERIAL CORRELATION
 
DEPENDANT VARIABLE: acled
INDEPENDANT VARIABLES:  main_d2lprice_mines
 
SPATIAL CORRELATION KERNAL CUTOFF: 500 KM
(NOTE: LINEAR BARTLETT WINDOW USED FOR SPATIAL KERNAL)
SERIAL CORRELATION KERNAL CUTOFF: 100000 PERIODS
-------------------------------------------------------------------------------------
              acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
main_d2lprice_mines |   .0780511   .0291083     2.68   0.007     .0209995    .1351028
-------------------------------------------------------------------------------------
D:\Travail\Dropbox\mining_conflict
(est3 stored)

. /*column 4: third differences */
. eststo: my_reg2hdfespatial acled  main_d3lprice_mines if sd_mines == 0                                                                                                                  , timevar(it) panelvar(cell) lat(latitude) lon(longitude) distcu
> toff(500) lagcutoff(100000) 
 
OLS REGRESSION
 
SE CORRECTED FOR CROSS-SECTIONAL SPATIAL DEPENDANCE
             AND PANEL-SPECIFIC SERIAL CORRELATION
 
DEPENDANT VARIABLE: acled
INDEPENDANT VARIABLES:  main_d3lprice_mines
 
SPATIAL CORRELATION KERNAL CUTOFF: 500 KM
(NOTE: LINEAR BARTLETT WINDOW USED FOR SPATIAL KERNAL)
SERIAL CORRELATION KERNAL CUTOFF: 100000 PERIODS
-------------------------------------------------------------------------------------
              acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
main_d3lprice_mines |   .0610285   .0260231     2.35   0.019     .0100236    .1120334
-------------------------------------------------------------------------------------
D:\Travail\Dropbox\mining_conflict
(est4 stored)

. 
. set linesize 250

. esttab, mtitles drop() b(%5.3f) se(%5.3f) compress r2 starlevels(c 0.1 b 0.05 a 0.01)  se 

------------------------------------------------------
                 (1)        (2)        (3)        (4) 
                est1       est2       est3       est4 
------------------------------------------------------
main_lpr~s     0.072a                                 
             (0.020)                                  

main_dlp~s                0.017                       
                        (0.042)                       

main_d2l~s                           0.078a           
                                   (0.029)            

main_d3l~s                                      0.061b
                                              (0.026) 
------------------------------------------------------
N             142296     142296     142296     142296 
R-sq           0.000      0.000      0.000      0.000 
------------------------------------------------------
Standard errors in parentheses
c p<0.1, b p<0.05, a p<0.01

. esttab, mtitles drop() b(%5.3f) se(%5.3f) r2  starlevels({$^c$} 0.1 {$^b$} 0.05 {$^a$} 0.01) se tex label  title() 

{
\def\sym#1{\ifmmode^{#1}\else\(^{#1}\)\fi}
\begin{tabular}{l*{4}{c}}
\hline\hline
                    &\multicolumn{1}{c}{(1)}&\multicolumn{1}{c}{(2)}&\multicolumn{1}{c}{(3)}&\multicolumn{1}{c}{(4)}\\
                    &\multicolumn{1}{c}{est1}&\multicolumn{1}{c}{est2}&\multicolumn{1}{c}{est3}&\multicolumn{1}{c}{est4}\\
\hline
$\ln$ price $\times$ mines $>0$&       0.072{$^a$}&                  &                  &                  \\
                    &     (0.020)      &                  &                  &                  \\
[1em]
$\Delta\_{t,t-1} \ln$ price $\times$ mines $>0$&                  &       0.017      &                  &                  \\
                    &                  &     (0.042)      &                  &                  \\
[1em]
$\Delta\_{t,t-2} \ln$ price $\times$ mines $>0$&                  &                  &       0.078{$^a$}&                  \\
                    &                  &                  &     (0.029)      &                  \\
[1em]
$\Delta\_{t,t-3} \ln$ price $\times$ mines $>0$&                  &                  &                  &       0.061{$^b$}\\
                    &                  &                  &                  &     (0.026)      \\
\hline
Observations        &      142296      &      142296      &      142296      &      142296      \\
\(R^{2}\)           &       0.000      &       0.000      &       0.000      &       0.000      \\
\hline\hline
\multicolumn{5}{l}{\footnotesize Standard errors in parentheses}\\
\multicolumn{5}{l}{\footnotesize {$^c$} p<0.1, {$^b$} p<0.05, {$^a$} p<0.01}\\
\end{tabular}
}

. eststo clear

. 
. *------------------------------*
. * Table A20 :short vs long run *
. *------------------------------*
. 
. use "$Output_data\BCRT_baseline", clear

. 
. /* drop diamonds and tantalum for baseline */
. drop if mainmineral == "diamond" | mainmineral == "tantalum"
(588 observations deleted)

. 
. /*condition for estimation with spatial lags of mines*/
. global condition_around "(mainmineral != "diamond" & mainmineral_around != "diamond" & mainmineral != "tantalum" & mainmineral_around != "tantalum")"

. 
. drop main_lprice_mines_l1

. sort cell year

. 
. g main_lprice_mines_l1  = l.main_lprice_mines 
(10,610 missing values generated)

. g main_lprice_mines_l2  = l2.main_lprice_mines 
(20,886 missing values generated)

. g main_lprice_mines_d1  = d.main_lprice_mines 
(10,610 missing values generated)

. g main_lprice_mines_d1f = f.main_lprice_mines_d1 
(10,610 missing values generated)

. g main_lprice_mines_f1  = f.main_lprice_mines 
(10,578 missing values generated)

. 
. *ONLY LAG
. eststo: my_reg2hdfespatial acled  main_lprice_mines_l1                                                                                          if sd_mines == 0        , timevar(it) panelvar(cell) lat(latitude) lon(longitude) distcutoff(500) lagcut
> off(100000) 
 
OLS REGRESSION
 
SE CORRECTED FOR CROSS-SECTIONAL SPATIAL DEPENDANCE
             AND PANEL-SPECIFIC SERIAL CORRELATION
 
DEPENDANT VARIABLE: acled
INDEPENDANT VARIABLES:  main_lprice_mines_l1
 
SPATIAL CORRELATION KERNAL CUTOFF: 500 KM
(NOTE: LINEAR BARTLETT WINDOW USED FOR SPATIAL KERNAL)
SERIAL CORRELATION KERNAL CUTOFF: 100000 PERIODS
--------------------------------------------------------------------------------------
               acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
main_lprice_mines_l1 |   .0776467   .0238018     3.26   0.001     .0309955    .1242979
--------------------------------------------------------------------------------------
D:\Travail\Dropbox\mining_conflict
(est1 stored)

. *LAG AND CURRENT
. eststo: my_reg2hdfespatial acled  main_lprice_mines_l1 main_lprice_mines                                                        if sd_mines == 0        , timevar(it) panelvar(cell) lat(latitude) lon(longitude) distcutoff(500) lagcutoff(100000) 
 
OLS REGRESSION
 
SE CORRECTED FOR CROSS-SECTIONAL SPATIAL DEPENDANCE
             AND PANEL-SPECIFIC SERIAL CORRELATION
 
DEPENDANT VARIABLE: acled
INDEPENDANT VARIABLES:  main_lprice_mines_l1 main_lprice_mines
 
SPATIAL CORRELATION KERNAL CUTOFF: 500 KM
(NOTE: LINEAR BARTLETT WINDOW USED FOR SPATIAL KERNAL)
SERIAL CORRELATION KERNAL CUTOFF: 100000 PERIODS
--------------------------------------------------------------------------------------
               acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
main_lprice_mines_l1 |   .0516003   .0506381     1.02   0.308    -.0476495    .1508501
   main_lprice_mines |   .0281033   .0443406     0.63   0.526    -.0588034    .1150101
--------------------------------------------------------------------------------------
D:\Travail\Dropbox\mining_conflict
(est2 stored)

. lincom main_lprice_mines_l1+main_lprice_mines                                           // sum coeffs

 ( 1)  main_lprice_mines_l1 + main_lprice_mines = 0

------------------------------------------------------------------------------
       acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0797036   .0233301     3.42   0.001     .0339771    .1254302
------------------------------------------------------------------------------

. *CURRENT AND TWO LAGS 
. eststo: my_reg2hdfespatial acled  main_lprice_mines_l2 main_lprice_mines_l1 main_lprice_mines           if sd_mines == 0        , timevar(it) panelvar(cell) lat(latitude) lon(longitude) distcutoff(500) lagcutoff(100000) 
 
OLS REGRESSION
 
SE CORRECTED FOR CROSS-SECTIONAL SPATIAL DEPENDANCE
             AND PANEL-SPECIFIC SERIAL CORRELATION
 
DEPENDANT VARIABLE: acled
INDEPENDANT VARIABLES:  main_lprice_mines_l2 main_lprice_mines_l1 main_lprice_mines
 
SPATIAL CORRELATION KERNAL CUTOFF: 500 KM
(NOTE: LINEAR BARTLETT WINDOW USED FOR SPATIAL KERNAL)
SERIAL CORRELATION KERNAL CUTOFF: 100000 PERIODS
--------------------------------------------------------------------------------------
               acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
main_lprice_mines_l2 |  -.0914034   .0301419    -3.03   0.002    -.1504811   -.0323257
main_lprice_mines_l1 |   .1151551   .0580581     1.98   0.047     .0013621     .228948
   main_lprice_mines |   .0403289   .0451456     0.89   0.372    -.0481557    .1288135
--------------------------------------------------------------------------------------
D:\Travail\Dropbox\mining_conflict
(est3 stored)

. lincom main_lprice_mines_l2+main_lprice_mines_l1+main_lprice_mines      // sum coeffs

 ( 1)  main_lprice_mines_l2 + main_lprice_mines_l1 + main_lprice_mines = 0

------------------------------------------------------------------------------
       acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0640806   .0217239     2.95   0.003      .021502    .1066591
------------------------------------------------------------------------------

. *ONLY LEAD
. eststo: my_reg2hdfespatial acled  main_lprice_mines_f1                                                                                          if sd_mines == 0        , timevar(it) panelvar(cell) lat(latitude) lon(longitude) distcutoff(500) lagcut
> off(100000) 
 
OLS REGRESSION
 
SE CORRECTED FOR CROSS-SECTIONAL SPATIAL DEPENDANCE
             AND PANEL-SPECIFIC SERIAL CORRELATION
 
DEPENDANT VARIABLE: acled
INDEPENDANT VARIABLES:  main_lprice_mines_f1
 
SPATIAL CORRELATION KERNAL CUTOFF: 500 KM
(NOTE: LINEAR BARTLETT WINDOW USED FOR SPATIAL KERNAL)
SERIAL CORRELATION KERNAL CUTOFF: 100000 PERIODS
--------------------------------------------------------------------------------------
               acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
main_lprice_mines_f1 |   .0795013   .0221026     3.60   0.000     .0361806    .1228219
--------------------------------------------------------------------------------------
D:\Travail\Dropbox\mining_conflict
(est4 stored)

. *LEAD AND CURRENT
. eststo: my_reg2hdfespatial acled  main_lprice_mines_f1 main_lprice_mines                                                        if sd_mines == 0        , timevar(it) panelvar(cell) lat(latitude) lon(longitude) distcutoff(500) lagcutoff(100000) 
 
OLS REGRESSION
 
SE CORRECTED FOR CROSS-SECTIONAL SPATIAL DEPENDANCE
             AND PANEL-SPECIFIC SERIAL CORRELATION
 
DEPENDANT VARIABLE: acled
INDEPENDANT VARIABLES:  main_lprice_mines_f1 main_lprice_mines
 
SPATIAL CORRELATION KERNAL CUTOFF: 500 KM
(NOTE: LINEAR BARTLETT WINDOW USED FOR SPATIAL KERNAL)
SERIAL CORRELATION KERNAL CUTOFF: 100000 PERIODS
--------------------------------------------------------------------------------------
               acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
main_lprice_mines_f1 |   .0351471   .0422313     0.83   0.405    -.0476255    .1179198
   main_lprice_mines |   .0570861   .0446185     1.28   0.201    -.0303654    .1445376
--------------------------------------------------------------------------------------
D:\Travail\Dropbox\mining_conflict
(est5 stored)

. lincom main_lprice_mines_f1+main_lprice_mines                                           // sum coeffs    

 ( 1)  main_lprice_mines_f1 + main_lprice_mines = 0

------------------------------------------------------------------------------
       acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0922332   .0236139     3.91   0.000     .0459504     .138516
------------------------------------------------------------------------------

. *LAG AND FIRST DIFF
. eststo: my_reg2hdfespatial acled  main_lprice_mines main_lprice_mines_d1                                                        if sd_mines == 0        , timevar(it) panelvar(cell) lat(latitude) lon(longitude) distcutoff(500) lagcutoff(100000) 
 
OLS REGRESSION
 
SE CORRECTED FOR CROSS-SECTIONAL SPATIAL DEPENDANCE
             AND PANEL-SPECIFIC SERIAL CORRELATION
 
DEPENDANT VARIABLE: acled
INDEPENDANT VARIABLES:  main_lprice_mines main_lprice_mines_d1
 
SPATIAL CORRELATION KERNAL CUTOFF: 500 KM
(NOTE: LINEAR BARTLETT WINDOW USED FOR SPATIAL KERNAL)
SERIAL CORRELATION KERNAL CUTOFF: 100000 PERIODS
--------------------------------------------------------------------------------------
               acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
   main_lprice_mines |   .0797036   .0233301     3.42   0.001     .0339771    .1254302
main_lprice_mines_d1 |  -.0516003   .0506381    -1.02   0.308    -.1508501    .0476495
--------------------------------------------------------------------------------------
D:\Travail\Dropbox\mining_conflict
(est6 stored)

. *CURRENT AND FIRST DIFF LEAD AND LAG
. eststo: my_reg2hdfespatial acled  main_lprice_mines main_lprice_mines_d1 main_lprice_mines_d1f          if sd_mines == 0        , timevar(it) panelvar(cell) lat(latitude) lon(longitude) distcutoff(500) lagcutoff(100000) 
 
OLS REGRESSION
 
SE CORRECTED FOR CROSS-SECTIONAL SPATIAL DEPENDANCE
             AND PANEL-SPECIFIC SERIAL CORRELATION
 
DEPENDANT VARIABLE: acled
INDEPENDANT VARIABLES:  main_lprice_mines main_lprice_mines_d1 main_lprice_mines_d1f
 
SPATIAL CORRELATION KERNAL CUTOFF: 500 KM
(NOTE: LINEAR BARTLETT WINDOW USED FOR SPATIAL KERNAL)
SERIAL CORRELATION KERNAL CUTOFF: 100000 PERIODS
---------------------------------------------------------------------------------------
                acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
    main_lprice_mines |   .0997234   .0271322     3.68   0.000     .0465448    .1529019
 main_lprice_mines_d1 |  -.0534225   .0490147    -1.09   0.276    -.1494906    .0426456
main_lprice_mines_d1f |   .0203704   .0434401     0.47   0.639    -.0647714    .1055122
---------------------------------------------------------------------------------------
D:\Travail\Dropbox\mining_conflict
(est7 stored)

. 
. set linesize 250

. esttab, mtitles drop() b(%5.3f) se(%5.3f) compress r2 starlevels(c 0.1 b 0.05 a 0.01)  se 

---------------------------------------------------------------------------------------
                 (1)        (2)        (3)        (4)        (5)        (6)        (7) 
                est1       est2       est3       est4       est5       est6       est7 
---------------------------------------------------------------------------------------
main_lp~l1     0.078a     0.052      0.115b                                            
             (0.024)    (0.051)    (0.058)                                             

main_lpr~s                0.028      0.040                 0.057      0.080a     0.100a
                        (0.044)    (0.045)               (0.045)    (0.023)    (0.027) 

main_lpr~2                          -0.091a                                            
                                   (0.030)                                             

main_lp~f1                                      0.080a     0.035                       
                                              (0.022)    (0.042)                       

main_lp~d1                                                           -0.052     -0.053 
                                                                    (0.051)    (0.049) 

main_lp~1f                                                                       0.020 
                                                                               (0.043) 
---------------------------------------------------------------------------------------
N             132132     132132     121968     132132     132132     132132     121968 
R-sq           0.000      0.000      0.000      0.000      0.000      0.000      0.000 
---------------------------------------------------------------------------------------
Standard errors in parentheses
c p<0.1, b p<0.05, a p<0.01

. esttab, mtitles drop() b(%5.3f) se(%5.3f) r2  starlevels({$^c$} 0.1 {$^b$} 0.05 {$^a$} 0.01) se tex label  title() 

{
\def\sym#1{\ifmmode^{#1}\else\(^{#1}\)\fi}
\begin{tabular}{l*{7}{c}}
\hline\hline
                    &\multicolumn{1}{c}{(1)}&\multicolumn{1}{c}{(2)}&\multicolumn{1}{c}{(3)}&\multicolumn{1}{c}{(4)}&\multicolumn{1}{c}{(5)}&\multicolumn{1}{c}{(6)}&\multicolumn{1}{c}{(7)}\\
                    &\multicolumn{1}{c}{est1}&\multicolumn{1}{c}{est2}&\multicolumn{1}{c}{est3}&\multicolumn{1}{c}{est4}&\multicolumn{1}{c}{est5}&\multicolumn{1}{c}{est6}&\multicolumn{1}{c}{est7}\\
\hline
main\_lprice\_mines\_l1&       0.078{$^a$}&       0.052      &       0.115{$^b$}&                  &                  &                  &                  \\
                    &     (0.024)      &     (0.051)      &     (0.058)      &                  &                  &                  &                  \\
[1em]
$\ln$ price $\times$ mines $>0$&                  &       0.028      &       0.040      &                  &       0.057      &       0.080{$^a$}&       0.100{$^a$}\\
                    &                  &     (0.044)      &     (0.045)      &                  &     (0.045)      &     (0.023)      &     (0.027)      \\
[1em]
main\_lprice\_mines\_l2&                  &                  &      -0.091{$^a$}&                  &                  &                  &                  \\
                    &                  &                  &     (0.030)      &                  &                  &                  &                  \\
[1em]
main\_lprice\_mines\_f1&                  &                  &                  &       0.080{$^a$}&       0.035      &                  &                  \\
                    &                  &                  &                  &     (0.022)      &     (0.042)      &                  &                  \\
[1em]
main\_lprice\_mines\_d1&                  &                  &                  &                  &                  &      -0.052      &      -0.053      \\
                    &                  &                  &                  &                  &                  &     (0.051)      &     (0.049)      \\
[1em]
main\_lprice\_mines\_d1f&                  &                  &                  &                  &                  &                  &       0.020      \\
                    &                  &                  &                  &                  &                  &                  &     (0.043)      \\
\hline
Observations        &      132132      &      132132      &      121968      &      132132      &      132132      &      132132      &      121968      \\
\(R^{2}\)           &       0.000      &       0.000      &       0.000      &       0.000      &       0.000      &       0.000      &       0.000      \\
\hline\hline
\multicolumn{8}{l}{\footnotesize Standard errors in parentheses}\\
\multicolumn{8}{l}{\footnotesize {$^c$} p<0.1, {$^b$} p<0.05, {$^a$} p<0.01}\\
\end{tabular}
}

. eststo clear

. 
. 
. *---------------------------------*
.             * UNIT ROOT TESTS    *
. *---------------------------------*
. 
. // Start with raw WB data
. // Mineral prices from 1960 to 2012
. 
. use "$Output_data\wb_prices", clear 

. 
. rename aluminum_price_wb                price_1 

. rename copper_price_wb                  price_2

. rename lead_price_wb                    price_3

. rename tin_price_wb                     price_4

. rename nickel_price_wb                  price_5

. rename zinc_price_wb                    price_6

. rename gold_price_wb                    price_7 

. rename platinum_price_wb                price_8

. rename silver_price_wb                  price_9

. rename iron_price_wb                    price_10

. rename coal_price_wb                    price_11

. rename phosphate_price_wb               price_12

. 
. reshape long price_, i(year) j(mineral)
(note: j = 1 2 3 4 5 6 7 8 9 10 11 12)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                       53   ->     636
Number of variables                  13   ->       3
j variable (12 values)                    ->   mineral
xij variables:
           price_1 price_2 ... price_12   ->   price_
-----------------------------------------------------------------------------

. tsset mineral year
       panel variable:  mineral (strongly balanced)
        time variable:  year, 1960 to 2012
                delta:  1 unit

. rename price_ price

. 
. g lprice     = log(price)
(24 missing values generated)

. g dlprice    = d.lprice
(36 missing values generated)

. g d2lprice   = lprice-l2.lprice
(48 missing values generated)

. g d3lprice   = lprice-l3.lprice
(60 missing values generated)

. 
. /*purge from mineral and year dummies*/
. tab year, gen(yeard)

       Year |      Freq.     Percent        Cum.
------------+-----------------------------------
       1960 |         12        1.89        1.89
       1961 |         12        1.89        3.77
       1962 |         12        1.89        5.66
       1963 |         12        1.89        7.55
       1964 |         12        1.89        9.43
       1965 |         12        1.89       11.32
       1966 |         12        1.89       13.21
       1967 |         12        1.89       15.09
       1968 |         12        1.89       16.98
       1969 |         12        1.89       18.87
       1970 |         12        1.89       20.75
       1971 |         12        1.89       22.64
       1972 |         12        1.89       24.53
       1973 |         12        1.89       26.42
       1974 |         12        1.89       28.30
       1975 |         12        1.89       30.19
       1976 |         12        1.89       32.08
       1977 |         12        1.89       33.96
       1978 |         12        1.89       35.85
       1979 |         12        1.89       37.74
       1980 |         12        1.89       39.62
       1981 |         12        1.89       41.51
       1982 |         12        1.89       43.40
       1983 |         12        1.89       45.28
       1984 |         12        1.89       47.17
       1985 |         12        1.89       49.06
       1986 |         12        1.89       50.94
       1987 |         12        1.89       52.83
       1988 |         12        1.89       54.72
       1989 |         12        1.89       56.60
       1990 |         12        1.89       58.49
       1991 |         12        1.89       60.38
       1992 |         12        1.89       62.26
       1993 |         12        1.89       64.15
       1994 |         12        1.89       66.04
       1995 |         12        1.89       67.92
       1996 |         12        1.89       69.81
       1997 |         12        1.89       71.70
       1998 |         12        1.89       73.58
       1999 |         12        1.89       75.47
       2000 |         12        1.89       77.36
       2001 |         12        1.89       79.25
       2002 |         12        1.89       81.13
       2003 |         12        1.89       83.02
       2004 |         12        1.89       84.91
       2005 |         12        1.89       86.79
       2006 |         12        1.89       88.68
       2007 |         12        1.89       90.57
       2008 |         12        1.89       92.45
       2009 |         12        1.89       94.34
       2010 |         12        1.89       96.23
       2011 |         12        1.89       98.11
       2012 |         12        1.89      100.00
------------+-----------------------------------
      Total |        636      100.00

. tab mineral, gen(minerald)

    mineral |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         53        8.33        8.33
          2 |         53        8.33       16.67
          3 |         53        8.33       25.00
          4 |         53        8.33       33.33
          5 |         53        8.33       41.67
          6 |         53        8.33       50.00
          7 |         53        8.33       58.33
          8 |         53        8.33       66.67
          9 |         53        8.33       75.00
         10 |         53        8.33       83.33
         11 |         53        8.33       91.67
         12 |         53        8.33      100.00
------------+-----------------------------------
      Total |        636      100.00

. 
. foreach var in lprice dlprice d2lprice d3lprice{
  2. qui reg `var' yeard* 
  3. predict `var'_res_y, res
  4. }
(24 missing values generated)
(36 missing values generated)
(48 missing values generated)
(60 missing values generated)

. save "$Output_data\price_stationarity", replace
(note: file Data_Code_BCRT_AER\Data\price_stationarity.dta not found)
file Data_Code_BCRT_AER\Data\price_stationarity.dta saved

. 
. *--------------------------------------------------*
. * Table A17 - Dickey Fuller tests, for each series *
. *--------------------------------------------------*
. 
. /* Dickey fuller test - null is unit root (non stationary)*/
. forvalues x=1(1)12{
  2. use "$Output_data\price_stationarity", clear
  3. qui keep if mineral == `x'
  4. qui dfuller lprice_res_y, drift
  5. di r(p)
  6. }
.21979494
.03505229
.00007176
.04269807
.00399095
.00518365
.17769994
.06261551
.01675725
.00939145
.00018588
.00005984

. 
. *----------------------------------------*
. * Table A18 - Panel data unit root tests *
. *----------------------------------------*
. 
. * WITH LOG PRICE PURGED FROM YEAR DUMMIES
. 
. /* Im Pesaran Shin*/
. use "$Output_data\price_stationarity", clear

. xtunitroot ips lprice_res_y

Im-Pesaran-Shin unit-root test for lprice_res_y
-----------------------------------------------
Ho: All panels contain unit roots           Number of panels       =     12
Ha: Some panels are stationary              Avg. number of periods =  51.00

AR parameter: Panel-specific                Asymptotics: T,N -> Infinity
Panel means:  Included                                        sequentially
Time trend:   Not included

ADF regressions: No lags included
------------------------------------------------------------------------------
                                              Fixed-N exact critical values
                    Statistic      p-value         1%      5%      10%
------------------------------------------------------------------------------
 t-bar               -2.4415                          (Not available)
 t-tilde-bar         -2.2335
 Z-t-tilde-bar       -3.2478        0.0006
------------------------------------------------------------------------------

. 
. /*Levin Lin Chu test*/
. use "$Output_data\price_stationarity", clear

. drop if mineral == 11 /*requires balanced panel*/
(53 observations deleted)

. xtunitroot llc lprice_res_y 

Levin-Lin-Chu unit-root test for lprice_res_y
---------------------------------------------
Ho: Panels contain unit roots               Number of panels  =     11
Ha: Panels are stationary                   Number of periods =     53

AR parameter: Common                        Asymptotics: N/T -> 0
Panel means:  Included
Time trend:   Not included

ADF regressions: 1 lag
LR variance:     Bartlett kernel, 12.00 lags average (chosen by LLC)
------------------------------------------------------------------------------
                    Statistic      p-value
------------------------------------------------------------------------------
 Unadjusted t        -6.4498
 Adjusted t*         -2.3024        0.0107
------------------------------------------------------------------------------

. 
. /*Harris–Tzavalis test*/
. use "$Output_data\price_stationarity", clear

. drop if mineral == 11 /*requires balanced panel*/
(53 observations deleted)

. xtunitroot ht lprice_res_y 

Harris-Tzavalis unit-root test for lprice_res_y
-----------------------------------------------
Ho: Panels contain unit roots               Number of panels  =     11
Ha: Panels are stationary                   Number of periods =     53

AR parameter: Common                        Asymptotics: N -> Infinity
Panel means:  Included                                   T Fixed
Time trend:   Not included
------------------------------------------------------------------------------
                    Statistic         z         p-value
------------------------------------------------------------------------------
 rho                  0.8321       -6.3676       0.0000
------------------------------------------------------------------------------

. 
. /*Breitung test*/
. use "$Output_data\price_stationarity", clear

. drop if mineral == 11 /*requires balanced panel*/
(53 observations deleted)

. xtunitroot breitung lprice_res_y

Breitung unit-root test for lprice_res_y
------------------------------------------
Ho: Panels contain unit roots               Number of panels  =     11
Ha: Panels are stationary                   Number of periods =     53

AR parameter: Common                        Asymptotics:  T,N -> Infinity
Panel means:  Included                                        sequentially
Time trend:   Not included                  Prewhitening: Not performed
------------------------------------------------------------------------------
                    Statistic      p-value
------------------------------------------------------------------------------
 lambda              -2.5196        0.0059
------------------------------------------------------------------------------

. 
. /*Fisher type (combined Dickey Fuller)*/
. use "$Output_data\price_stationarity", clear

. drop if mineral == 11 /*requires balanced panel*/
(53 observations deleted)

. xtunitroot fisher lprice_res_y, pp lags(3)

Fisher-type unit-root test for lprice_res_y
Based on Phillips-Perron tests
-------------------------------------------
Ho: All panels contain unit roots           Number of panels  =     11
Ha: At least one panel is stationary        Number of periods =     53

AR parameter:    Panel-specific             Asymptotics: T -> Infinity
Panel means:     Included
Time trend:      Not included
Newey-West lags: 3 lags
------------------------------------------------------------------------------
                                  Statistic      p-value
------------------------------------------------------------------------------
 Inverse chi-squared(22)   P        52.4823       0.0003
 Inverse normal            Z        -3.1354       0.0009
 Inverse logit t(59)       L*       -3.5786       0.0003
 Modified inv. chi-squared Pm        4.5954       0.0000
------------------------------------------------------------------------------
 P statistic requires number of panels to be finite.
 Other statistics are suitable for finite or infinite number of panels.
------------------------------------------------------------------------------

. 
. /*Hadri test*/
. use "$Output_data\price_stationarity", clear

. drop if mineral == 11 /*requires balanced panel*/
(53 observations deleted)

. xtunitroot hadri lprice_res_y

Hadri LM test for lprice_res_y
--------------------------------
Ho: All panels are stationary               Number of panels  =     11
Ha: Some panels contain unit roots          Number of periods =     53

Time trend:         Not included            Asymptotics: T, N -> Infinity
Heteroskedasticity: Not robust                                sequentially
LR variance:        (not used)
------------------------------------------------------------------------------
                    Statistic      p-value
------------------------------------------------------------------------------
 z                   45.1337        0.0000
------------------------------------------------------------------------------

. 
. *clean 
. erase "$Output_data\price_stationarity.dta"

. log close
      name:  <unnamed>
       log:  D:\Travail\Dropbox\mining_conflict\Data_Code_BCRT_AER\results\Tables_A17_to_A20.log
  log type:  text
 closed on:  14 Dec 2016, 12:11:05
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
