-----------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\Travail\Dropbox\mining_conflict\Data_Code_BCRT_AER\results\Table_5.log
  log type:  text
 opened on:  13 Dec 2016, 11:45:03

. 
. // Table 5
. 
. use "$Output_data\BCRT_rebel", clear

. 
. sort id year 

. 
. sort id year 

. eststo: reghdfe acled nb_battle_all                                                                            
>                                                                  if l.acled == 0 & ldistance_battle != ., vce(c
> luster actor_g) absorb(id it)
(dropped 32465 singleton observations)
(converged in 23 iterations)

HDFE Linear regression                            Number of obs   =    168,887
Absorbing 2 HDFE groups                           F(   1,     72) =       1.17
Statistics robust to heteroskedasticity           Prob > F        =     0.2836
                                                  R-squared       =     0.3142
                                                  Adj R-squared   =     0.0917
                                                  Within R-sq.    =     0.0002
Number of clusters (actor_g) =         73         Root MSE        =     0.0889

                                (Std. Err. adjusted for 73 clusters in actor_g)
-------------------------------------------------------------------------------
              |               Robust
        acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
nb_battle_all |   .0019361   .0017922     1.08   0.284    -.0016366    .0055087
-------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------------+
  Absorbed FE |  Num. Coefs.  =   Categories  -   Redundant     | 
--------------+-------------------------------------------------|
           id |            0           41170          41170 *   | 
           it |          213             214              1     | 
----------------------------------------------------------------+
* = fixed effect nested within cluster; treated as redundant for DoF computation
(est1 stored)

. sort id year 

. eststo: reghdfe acled battle_a battle_m                                                                        
>                                                                  if l.acled == 0 & ldistance_battle != ., vce(c
> luster actor_g) absorb(id it)
(dropped 32465 singleton observations)
(converged in 23 iterations)

HDFE Linear regression                            Number of obs   =    168,887
Absorbing 2 HDFE groups                           F(   2,     72) =       5.50
Statistics robust to heteroskedasticity           Prob > F        =     0.0060
                                                  R-squared       =     0.3148
                                                  Adj R-squared   =     0.0924
                                                  Within R-sq.    =     0.0010
Number of clusters (actor_g) =         73         Root MSE        =     0.0889

                               (Std. Err. adjusted for 73 clusters in actor_g)
------------------------------------------------------------------------------
             |               Robust
       acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    battle_a |   .0004103   .0024115     0.17   0.865    -.0043969    .0052175
    battle_m |   .0397278   .0119829     3.32   0.001     .0158403    .0636152
------------------------------------------------------------------------------

Absorbed degrees of freedom:
---------------------------------------------------------------+
 Absorbed FE |  Num. Coefs.  =   Categories  -   Redundant     | 
-------------+-------------------------------------------------|
          id |            0           41170          41170 *   | 
          it |          213             214              1     | 
---------------------------------------------------------------+
* = fixed effect nested within cluster; treated as redundant for DoF computation
(est2 stored)

. lincom battle_m - battle_a

 ( 1)  - battle_a + battle_m = 0

------------------------------------------------------------------------------
       acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0393175   .0120783     3.26   0.002     .0152399    .0633951
------------------------------------------------------------------------------

. sort id year    

. eststo: reghdfe acled nb_battle_a nb_battle_m                                                                  
>                                                          if l.acled == 0 & ldistance_battle != ., vce(cluster a
> ctor_g) absorb(id it)
(dropped 32465 singleton observations)
(converged in 23 iterations)

HDFE Linear regression                            Number of obs   =    168,887
Absorbing 2 HDFE groups                           F(   2,     72) =       5.87
Statistics robust to heteroskedasticity           Prob > F        =     0.0043
                                                  R-squared       =     0.3148
                                                  Adj R-squared   =     0.0924
                                                  Within R-sq.    =     0.0009
Number of clusters (actor_g) =         73         Root MSE        =     0.0889

                               (Std. Err. adjusted for 73 clusters in actor_g)
------------------------------------------------------------------------------
             |               Robust
       acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 nb_battle_a |   .0005112    .001661     0.31   0.759    -.0027999    .0038223
 nb_battle_m |   .0531877   .0159176     3.34   0.001     .0214566    .0849187
------------------------------------------------------------------------------

Absorbed degrees of freedom:
---------------------------------------------------------------+
 Absorbed FE |  Num. Coefs.  =   Categories  -   Redundant     | 
-------------+-------------------------------------------------|
          id |            0           41170          41170 *   | 
          it |          213             214              1     | 
---------------------------------------------------------------+
* = fixed effect nested within cluster; treated as redundant for DoF computation
(est3 stored)

. lincom nb_battle_m - nb_battle_a

 ( 1)  - nb_battle_a + nb_battle_m = 0

------------------------------------------------------------------------------
       acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0526765   .0162234     3.25   0.002     .0203357    .0850173
------------------------------------------------------------------------------

. sort id year    

. eststo: reghdfe acled nb_battle_a nb_battle_m  nb_battle_an nb_battle_mn                                       
>                                  if l.acled == 0 & ldistance_battle != ., vce(cluster actor_g) absorb(id it)
(dropped 32465 singleton observations)
(converged in 23 iterations)

HDFE Linear regression                            Number of obs   =    168,887
Absorbing 2 HDFE groups                           F(   4,     72) =       9.26
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.3150
                                                  Adj R-squared   =     0.0926
                                                  Within R-sq.    =     0.0012
Number of clusters (actor_g) =         73         Root MSE        =     0.0889

                               (Std. Err. adjusted for 73 clusters in actor_g)
------------------------------------------------------------------------------
             |               Robust
       acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 nb_battle_a |  -.0009511   .0016855    -0.56   0.574    -.0043112     .002409
 nb_battle_m |   .0412076   .0167654     2.46   0.016     .0077864    .0746287
nb_battle_an |   .0014275   .0007671     1.86   0.067    -.0001016    .0029567
nb_battle_mn |   .0082162   .0025578     3.21   0.002     .0031173    .0133151
------------------------------------------------------------------------------

Absorbed degrees of freedom:
---------------------------------------------------------------+
 Absorbed FE |  Num. Coefs.  =   Categories  -   Redundant     | 
-------------+-------------------------------------------------|
          id |            0           41170          41170 *   | 
          it |          213             214              1     | 
---------------------------------------------------------------+
* = fixed effect nested within cluster; treated as redundant for DoF computation
(est4 stored)

. lincom nb_battle_m  - nb_battle_a

 ( 1)  - nb_battle_a + nb_battle_m = 0

------------------------------------------------------------------------------
       acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0421587   .0165974     2.54   0.013     .0090725    .0752449
------------------------------------------------------------------------------

. lincom nb_battle_mn - nb_battle_an

 ( 1)  - nb_battle_an + nb_battle_mn = 0

------------------------------------------------------------------------------
       acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0067887   .0027935     2.43   0.018       .00122    .0123574
------------------------------------------------------------------------------

. 
. sort id year

. eststo: reghdfe acled nb_battle_a nb_battle_m nb_battle_a_l1 nb_battle_m_l1                                    
>                          if l.acled == 0 & ldistance_battle != ., vce(cluster actor_g) absorb(id it)
(dropped 32465 singleton observations)
(converged in 23 iterations)

HDFE Linear regression                            Number of obs   =    168,887
Absorbing 2 HDFE groups                           F(   4,     72) =      11.53
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.3149
                                                  Adj R-squared   =     0.0925
                                                  Within R-sq.    =     0.0011
Number of clusters (actor_g) =         73         Root MSE        =     0.0889

                                 (Std. Err. adjusted for 73 clusters in actor_g)
--------------------------------------------------------------------------------
               |               Robust
         acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
   nb_battle_a |   .0000138   .0016557     0.01   0.993    -.0032869    .0033145
   nb_battle_m |   .0615508    .013285     4.63   0.000     .0350677    .0880339
nb_battle_a_l1 |   -.000496   .0009134    -0.54   0.589    -.0023169    .0013249
nb_battle_m_l1 |   .0226332   .0087828     2.58   0.012      .005125    .0401415
--------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------------------+
   Absorbed FE |  Num. Coefs.  =   Categories  -   Redundant     | 
---------------+-------------------------------------------------|
            id |            0           41170          41170 *   | 
            it |          213             214              1     | 
-----------------------------------------------------------------+
* = fixed effect nested within cluster; treated as redundant for DoF computation
(est5 stored)

. lincom nb_battle_m    - nb_battle_a 

 ( 1)  - nb_battle_a + nb_battle_m = 0

------------------------------------------------------------------------------
       acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .061537     .01356     4.54   0.000     .0345057    .0885683
------------------------------------------------------------------------------

. lincom nb_battle_m_l1 - nb_battle_a_l1

 ( 1)  - nb_battle_a_l1 + nb_battle_m_l1 = 0

------------------------------------------------------------------------------
       acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0231292    .009218     2.51   0.014     .0047536    .0415049
------------------------------------------------------------------------------

. sort id year

. eststo: reghdfe acled nb_battle_a nb_battle_m nb_battle_a_l1 nb_battle_m_l1 nb_battle_a_l2 nb_battle_m_l2      
>  if l.acled == 0 & ldistance_battle != ., vce(cluster actor_g) absorb(id it)
(dropped 31404 singleton observations)
(converged in 23 iterations)

HDFE Linear regression                            Number of obs   =    158,040
Absorbing 2 HDFE groups                           F(   6,     70) =      12.75
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.3172
                                                  Adj R-squared   =     0.0911
                                                  Within R-sq.    =     0.0015
Number of clusters (actor_g) =         71         Root MSE        =     0.0885

                                 (Std. Err. adjusted for 71 clusters in actor_g)
--------------------------------------------------------------------------------
               |               Robust
         acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
   nb_battle_a |   .0004552   .0016922     0.27   0.789    -.0029198    .0038302
   nb_battle_m |   .0535431   .0130432     4.11   0.000     .0275292     .079557
nb_battle_a_l1 |    .000292   .0008865     0.33   0.743    -.0014762    .0020601
nb_battle_m_l1 |     .02072   .0076724     2.70   0.009     .0054178    .0360222
nb_battle_a_l2 |  -.0040357   .0007436    -5.43   0.000    -.0055187   -.0025527
nb_battle_m_l2 |   .0299238   .0162521     1.84   0.070      -.00249    .0623376
--------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------------------+
   Absorbed FE |  Num. Coefs.  =   Categories  -   Redundant     | 
---------------+-------------------------------------------------|
            id |            0           39101          39101 *   | 
            it |          199             200              1     | 
-----------------------------------------------------------------+
* = fixed effect nested within cluster; treated as redundant for DoF computation
(est6 stored)

. lincom nb_battle_m    - nb_battle_a

 ( 1)  - nb_battle_a + nb_battle_m = 0

------------------------------------------------------------------------------
       acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0530879   .0130396     4.07   0.000     .0270814    .0790945
------------------------------------------------------------------------------

. lincom nb_battle_m_l1 - nb_battle_a_l1

 ( 1)  - nb_battle_a_l1 + nb_battle_m_l1 = 0

------------------------------------------------------------------------------
       acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .020428    .008114     2.52   0.014     .0042452    .0366109
------------------------------------------------------------------------------

. lincom nb_battle_m_l2 - nb_battle_a_l2

 ( 1)  - nb_battle_a_l2 + nb_battle_m_l2 = 0

------------------------------------------------------------------------------
       acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0339595   .0164213     2.07   0.042     .0012082    .0667107
------------------------------------------------------------------------------

. 
. sort id year 

. eststo: reghdfe acled nb_battle_all ldistance_battle nb_battle_all_dist                                        
>                                  if l.acled == 0 & ldistance_battle != ., vce(cluster actor_g) absorb(id it)
(dropped 32465 singleton observations)
(converged in 23 iterations)

HDFE Linear regression                            Number of obs   =    168,887
Absorbing 2 HDFE groups                           F(   3,     72) =       2.88
Statistics robust to heteroskedasticity           Prob > F        =     0.0418
                                                  R-squared       =     0.3146
                                                  Adj R-squared   =     0.0921
                                                  Within R-sq.    =     0.0007
Number of clusters (actor_g) =         73         Root MSE        =     0.0889

                                     (Std. Err. adjusted for 73 clusters in actor_g)
------------------------------------------------------------------------------------
                   |               Robust
             acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------+----------------------------------------------------------------
     nb_battle_all |   .0331493   .0145713     2.27   0.026     .0041021    .0621966
  ldistance_battle |  -.0007457   .0030593    -0.24   0.808    -.0068444     .005353
nb_battle_all_dist |  -.0047093   .0021002    -2.24   0.028    -.0088961   -.0005226
------------------------------------------------------------------------------------

Absorbed degrees of freedom:
---------------------------------------------------------------------+
       Absorbed FE |  Num. Coefs.  =   Categories  -   Redundant     | 
-------------------+-------------------------------------------------|
                id |            0           41170          41170 *   | 
                it |          213             214              1     | 
---------------------------------------------------------------------+
* = fixed effect nested within cluster; treated as redundant for DoF computation
(est7 stored)

. sort id year 

. eststo: reghdfe acled nb_battle_a nb_battle_m ldistance_battle nb_battle_a_dist nb_battle_m_dist               
>          if l.acled == 0 & ldistance_battle != ., vce(cluster actor_g) absorb(id it)
(dropped 32465 singleton observations)
(converged in 23 iterations)

HDFE Linear regression                            Number of obs   =    168,887
Absorbing 2 HDFE groups                           F(   5,     72) =       5.00
Statistics robust to heteroskedasticity           Prob > F        =     0.0005
                                                  R-squared       =     0.3156
                                                  Adj R-squared   =     0.0934
                                                  Within R-sq.    =     0.0021
Number of clusters (actor_g) =         73         Root MSE        =     0.0888

                                   (Std. Err. adjusted for 73 clusters in actor_g)
----------------------------------------------------------------------------------
                 |               Robust
           acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
     nb_battle_a |   .0287053   .0144176     1.99   0.050    -.0000358    .0574463
     nb_battle_m |   .5998738   .1842423     3.26   0.002     .2325935    .9671541
ldistance_battle |  -.0008746   .0030897    -0.28   0.778    -.0070338    .0052846
nb_battle_a_dist |  -.0041973   .0021019    -2.00   0.050    -.0083873   -7.30e-06
nb_battle_m_dist |  -.0842176   .0269971    -3.12   0.003    -.1380353   -.0303999
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------------------+
     Absorbed FE |  Num. Coefs.  =   Categories  -   Redundant     | 
-----------------+-------------------------------------------------|
              id |            0           41170          41170 *   | 
              it |          213             214              1     | 
-------------------------------------------------------------------+
* = fixed effect nested within cluster; treated as redundant for DoF computation
(est8 stored)

. 
. // Figure 2
. 
. *  Numbers correspond to 100*ln(x) with x in [100,1500]*
. *  Ex: log(100km) = 4.6 
. 
. foreach number in 460 529 570 599 621 639 655 668 680 690 700 709 717 724 731{
  2.         lincom nb_battle_a+nb_battle_a_dist*`number'/100
  3.         g beta_m0_`number' = r(estimate)
  4.         g se_m0_`number'   = r(se)
  5.         lincom nb_battle_m+nb_battle_m_dist*`number'/100
  6.         g beta_m1_`number' = r(estimate)
  7.         g se_m1_`number'   = r(se)
  8.         }

 ( 1)  nb_battle_a + 4.6*nb_battle_a_dist = 0

------------------------------------------------------------------------------
       acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0093978   .0049196     1.91   0.060    -.0004093    .0192049
------------------------------------------------------------------------------

 ( 1)  nb_battle_m + 4.6*nb_battle_m_dist = 0

------------------------------------------------------------------------------
       acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .2124729   .0606004     3.51   0.001     .0916683    .3332776
------------------------------------------------------------------------------

 ( 1)  nb_battle_a + 5.29*nb_battle_a_dist = 0

------------------------------------------------------------------------------
       acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0065017   .0035747     1.82   0.073    -.0006243    .0136277
------------------------------------------------------------------------------

 ( 1)  nb_battle_m + 5.29*nb_battle_m_dist = 0

------------------------------------------------------------------------------
       acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .1543628     .04233     3.65   0.000     .0699794    .2387462
------------------------------------------------------------------------------

 ( 1)  nb_battle_a + 5.7*nb_battle_a_dist = 0

------------------------------------------------------------------------------
       acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0047808   .0028253     1.69   0.095    -.0008514    .0104129
------------------------------------------------------------------------------

 ( 1)  nb_battle_m + 5.7*nb_battle_m_dist = 0

------------------------------------------------------------------------------
       acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .1198336   .0316717     3.78   0.000     .0566973      .18297
------------------------------------------------------------------------------

 ( 1)  nb_battle_a + 5.99*nb_battle_a_dist = 0

------------------------------------------------------------------------------
       acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0035636   .0023424     1.52   0.133     -.001106    .0082331
------------------------------------------------------------------------------

 ( 1)  nb_battle_m + 5.99*nb_battle_m_dist = 0

------------------------------------------------------------------------------
       acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0954105    .024355     3.92   0.000     .0468598    .1439613
------------------------------------------------------------------------------

 ( 1)  nb_battle_a + 6.21*nb_battle_a_dist = 0

------------------------------------------------------------------------------
       acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0026402   .0020223     1.31   0.196    -.0013911    .0066715
------------------------------------------------------------------------------

 ( 1)  nb_battle_m + 6.21*nb_battle_m_dist = 0

------------------------------------------------------------------------------
       acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0768827   .0190777     4.03   0.000      .038852    .1149133
------------------------------------------------------------------------------

 ( 1)  nb_battle_a + 6.39*nb_battle_a_dist = 0

------------------------------------------------------------------------------
       acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0018847   .0018067     1.04   0.300     -.001717    .0054863
------------------------------------------------------------------------------

 ( 1)  nb_battle_m + 6.39*nb_battle_m_dist = 0

------------------------------------------------------------------------------
       acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0617235   .0151295     4.08   0.000     .0315634    .0918836
------------------------------------------------------------------------------

 ( 1)  nb_battle_a + 6.55*nb_battle_a_dist = 0

------------------------------------------------------------------------------
       acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0012131   .0016646     0.73   0.469    -.0021053    .0045315
------------------------------------------------------------------------------

 ( 1)  nb_battle_m + 6.55*nb_battle_m_dist = 0

------------------------------------------------------------------------------
       acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0482487   .0121861     3.96   0.000     .0239561    .0725413
------------------------------------------------------------------------------

 ( 1)  nb_battle_a + 6.68*nb_battle_a_dist = 0

------------------------------------------------------------------------------
       acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0006675   .0015927     0.42   0.676    -.0025076    .0038425
------------------------------------------------------------------------------

 ( 1)  nb_battle_m + 6.68*nb_battle_m_dist = 0

------------------------------------------------------------------------------
       acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0373004   .0105192     3.55   0.001     .0163308      .05827
------------------------------------------------------------------------------

 ( 1)  nb_battle_a + 6.8*nb_battle_a_dist = 0

------------------------------------------------------------------------------
       acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0001638   .0015662     0.10   0.917    -.0029585     .003286
------------------------------------------------------------------------------

 ( 1)  nb_battle_m + 6.8*nb_battle_m_dist = 0

------------------------------------------------------------------------------
       acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0271943   .0098783     2.75   0.007     .0075022    .0468864
------------------------------------------------------------------------------

 ( 1)  nb_battle_a + 6.9*nb_battle_a_dist = 0

------------------------------------------------------------------------------
       acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   -.000256    .001575    -0.16   0.871    -.0033956    .0028837
------------------------------------------------------------------------------

 ( 1)  nb_battle_m + 6.9*nb_battle_m_dist = 0

------------------------------------------------------------------------------
       acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0187725   .0101352     1.85   0.068    -.0014317    .0389768
------------------------------------------------------------------------------

 ( 1)  nb_battle_a + 7*nb_battle_a_dist = 0

------------------------------------------------------------------------------
       acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0006757   .0016113    -0.42   0.676    -.0038878    .0025365
------------------------------------------------------------------------------

 ( 1)  nb_battle_m + 7*nb_battle_m_dist = 0

------------------------------------------------------------------------------
       acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0103508   .0110653     0.94   0.353    -.0117076    .0324091
------------------------------------------------------------------------------

 ( 1)  nb_battle_a + 7.09*nb_battle_a_dist = 0

------------------------------------------------------------------------------
       acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0010534   .0016662    -0.63   0.529    -.0043749    .0022681
------------------------------------------------------------------------------

 ( 1)  nb_battle_m + 7.09*nb_battle_m_dist = 0

------------------------------------------------------------------------------
       acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0027712   .0123552     0.22   0.823    -.0218585    .0274009
------------------------------------------------------------------------------

 ( 1)  nb_battle_a + 7.17*nb_battle_a_dist = 0

------------------------------------------------------------------------------
       acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0013892   .0017309    -0.80   0.425    -.0048398    .0020613
------------------------------------------------------------------------------

 ( 1)  nb_battle_m + 7.17*nb_battle_m_dist = 0

------------------------------------------------------------------------------
       acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0039662   .0137629    -0.29   0.774     -.031402    .0234696
------------------------------------------------------------------------------

 ( 1)  nb_battle_a + 7.24*nb_battle_a_dist = 0

------------------------------------------------------------------------------
       acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   -.001683   .0017986    -0.94   0.353    -.0052684    .0019024
------------------------------------------------------------------------------

 ( 1)  nb_battle_m + 7.24*nb_battle_m_dist = 0

------------------------------------------------------------------------------
       acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0098614   .0151407    -0.65   0.517    -.0400438    .0203209
------------------------------------------------------------------------------

 ( 1)  nb_battle_a + 7.31*nb_battle_a_dist = 0

------------------------------------------------------------------------------
       acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0019768   .0018754    -1.05   0.295    -.0057153    .0017616
------------------------------------------------------------------------------

 ( 1)  nb_battle_m + 7.31*nb_battle_m_dist = 0

------------------------------------------------------------------------------
       acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0157567   .0166194    -0.95   0.346    -.0488868    .0173735
------------------------------------------------------------------------------

.         keep if _n == 1
(1,290,603 observations deleted)

.         collapse (mean) beta_m0_* beta_m1_* se_m0_* se_m1_*

. 
.         foreach type in m0 m1{ 
  2.         rename beta_`type'_460 beta_`type'_1
  3.         rename beta_`type'_529 beta_`type'_2
  4.         rename beta_`type'_570 beta_`type'_3
  5.         rename beta_`type'_599 beta_`type'_4
  6.         rename beta_`type'_621 beta_`type'_5
  7.         rename beta_`type'_639 beta_`type'_6
  8.         rename beta_`type'_655 beta_`type'_7
  9.         rename beta_`type'_668 beta_`type'_8
 10.         rename beta_`type'_680 beta_`type'_9
 11.         rename beta_`type'_690 beta_`type'_10
 12.         rename beta_`type'_700 beta_`type'_11
 13.         rename beta_`type'_709 beta_`type'_12
 14.         rename beta_`type'_717 beta_`type'_13
 15.         rename beta_`type'_724 beta_`type'_14
 16.         rename beta_`type'_731 beta_`type'_15
 17.         *
.         rename se_`type'_460 se_`type'_1
 18.         rename se_`type'_529 se_`type'_2
 19.         rename se_`type'_570 se_`type'_3
 20.         rename se_`type'_599 se_`type'_4
 21.         rename se_`type'_621 se_`type'_5
 22.         rename se_`type'_639 se_`type'_6
 23.         rename se_`type'_655 se_`type'_7
 24.         rename se_`type'_668 se_`type'_8
 25.         rename se_`type'_680 se_`type'_9
 26.         rename se_`type'_690 se_`type'_10
 27.         rename se_`type'_700 se_`type'_11
 28.         rename se_`type'_709 se_`type'_12
 29.         rename se_`type'_717 se_`type'_13
 30.         rename se_`type'_724 se_`type'_14
 31.         rename se_`type'_731 se_`type'_15
 32. }

. g obs = 1

. reshape long beta_m0_ beta_m1_ se_m0_ se_m1_, i(obs) j(distance_cat)
(note: j = 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                        1   ->      15
Number of variables                  61   ->       6
j variable (15 values)                    ->   distance_cat
xij variables:
     beta_m0_1 beta_m0_2 ... beta_m0_15   ->   beta_m0_
     beta_m1_1 beta_m1_2 ... beta_m1_15   ->   beta_m1_
           se_m0_1 se_m0_2 ... se_m0_15   ->   se_m0_
           se_m1_1 se_m1_2 ... se_m1_15   ->   se_m1_
-----------------------------------------------------------------------------

. 
. foreach var in beta_m0 beta_m1 se_m0 se_m1{
  2.         rename `var'_ `var'
  3. }

. g beta_m0_min = beta_m0-1.96*se_m0

. g beta_m0_max = beta_m0+1.96*se_m0

. *
. g beta_m1_min = beta_m1-1.96*se_m1

. g beta_m1_max = beta_m1+1.96*se_m1

. 
. g zero     = 0

. local zero = 0 

. 
. global bandwidth  = 0.66

. gen    beta_bench = 0

. local  beta_bench = beta_bench

. 
. drop if distance_cat>10
(5 observations deleted)

. 
. label define distance_cat 1 "100" 2 "200" 3 "300" 4 "400" 5 "500" 6 "600" 7 "700" 8 "800" 9 "900" 10 "1000"

. label values distance_cat distance_cat

. label list
distance_cat:
           1 100
           2 200
           3 300
           4 400
           5 500
           6 600
           7 700
           8 800
           9 900
          10 1000
sex2:
           1 F
           2 MF

. 
. twoway rarea beta_m0_min beta_m0_max distance_cat, fintensity(inten30) bsty(ci) sort  xlabel(1 2 3 4 5 6 7 8 9 
> 10,  valuelabel)  yscale(range(0.00 0.10)) ylabel(0 0.05 0.10,  valuelabel) ///
> || scatter beta_m0 distance_cat, scheme(s2color) c(l) xtitle("Distance to previous year's battles (km)") ///
> || line beta_bench distance_cat, color(gs5) ///
> title("Effect of # battles won in t-1 on conflict outbreak in t", pos(11) ring(0) size(medium)) legend(off) bgc
> olor(white) graphregion(color(white)) ysize(4) xsize(4) scale(0.8)

. graph export $Results\Figure_2a.eps, as(eps) replace
(file Data_Code_BCRT_AER\results\Figure_2a.eps written in EPS format)

. *
. twoway rarea beta_m1_min beta_m1_max distance_cat,  fintensity(inten30) bsty(ci) sort  xlabel(1 2 3 4 5 6 7 8 9
>  10,  valuelabel) yscale(range(0.00 0.20)) ylabel(0 0.05 0.10 0.15 0.20 0.25 0.30,  valuelabel) ///
> || scatter beta_m1 distance_cat, scheme(s2color) c(l) xtitle("Distance to previous year's battles (km)") ///
> || line beta_bench distance_cat, color(gs5) ///
> title("Effect of # battles won in t-1 on conflict outbreak in t", pos(11) ring(0) size(medium)) bgcolor(white) 
> graphregion(color(white))  legend(off)  ysize(4) xsize(4) scale(0.8)

. graph export $Results\Figure_2b.eps, as(eps) replace
(file Data_Code_BCRT_AER\results\Figure_2b.eps written in EPS format)

. *
. set linesize 250

. esttab, mtitles drop() b(%5.3f) se(%5.3f) compress r2 starlevels(c 0.1 b 0.05 a 0.01)  se 

--------------------------------------------------------------------------------------------------
                 (1)        (2)        (3)        (4)        (5)        (6)        (7)        (8) 
                est1       est2       est3       est4       est5       est6       est7       est8 
--------------------------------------------------------------------------------------------------
nb_battl~l     0.002                                                             0.033b           
             (0.002)                                                           (0.015)            

battle_a                  0.000                                                                   
                        (0.002)                                                                   

battle_m                  0.040a                                                                  
                        (0.012)                                                                   

nb_battl~a                           0.001     -0.001      0.000      0.000                 0.029c
                                   (0.002)    (0.002)    (0.002)    (0.002)               (0.014) 

nb_battl~m                           0.053a     0.041b     0.062a     0.054a                0.600a
                                   (0.016)    (0.017)    (0.013)    (0.013)               (0.184) 

nb_battl~n                                      0.001c                                            
                                              (0.001)                                             

nb_battl~n                                      0.008a                                            
                                              (0.003)                                             

nb_battl~1                                                -0.000      0.000                       
                                                         (0.001)    (0.001)                       

nb_battl~1                                                 0.023b     0.021a                      
                                                         (0.009)    (0.008)                       

nb_battl~2                                                           -0.004a                      
                                                                    (0.001)                       

nb_battl~2                                                            0.030c                      
                                                                    (0.016)                       

ldistanc~e                                                                      -0.001     -0.001 
                                                                               (0.003)    (0.003) 

nb_battl~t                                                                      -0.005b           
                                                                               (0.002)            

nb_battl~t                                                                                 -0.004b
                                                                                          (0.002) 

nb_battl~t                                                                                 -0.084a
                                                                                          (0.027) 
--------------------------------------------------------------------------------------------------
N             168887     168887     168887     168887     168887     158040     168887     168887 
R-sq           0.314      0.315      0.315      0.315      0.315      0.317      0.315      0.316 
--------------------------------------------------------------------------------------------------
Standard errors in parentheses
c p<0.1, b p<0.05, a p<0.01

. esttab, mtitles drop() b(%5.3f) se(%5.3f) r2  starlevels({$^c$} 0.1 {$^b$} 0.05 {$^a$} 0.01) se tex label  title(Table 5) 

\begin{table}[htbp]\centering
\def\sym#1{\ifmmode^{#1}\else\(^{#1}\)\fi}
\caption{Table 5}
\begin{tabular}{l*{8}{c}}
\hline\hline
                    &\multicolumn{1}{c}{(1)}&\multicolumn{1}{c}{(2)}&\multicolumn{1}{c}{(3)}&\multicolumn{1}{c}{(4)}&\multicolumn{1}{c}{(5)}&\multicolumn{1}{c}{(6)}&\multicolumn{1}{c}{(7)}&\multicolumn{1}{c}{(8)}\\
                    &\multicolumn{1}{c}{est1}&\multicolumn{1}{c}{est2}&\multicolumn{1}{c}{est3}&\multicolumn{1}{c}{est4}&\multicolumn{1}{c}{est5}&\multicolumn{1}{c}{est6}&\multicolumn{1}{c}{est7}&\multicolumn{1}{c}{est8}\\
\hline
nb\_battle\_all       &       0.002      &                  &                  &                  &                  &                  &       0.033{$^b$}&                  \\
                    &     (0.002)      &                  &                  &                  &                  &                  &     (0.015)      &                  \\
[1em]
battle\_a            &                  &       0.000      &                  &                  &                  &                  &                  &                  \\
                    &                  &     (0.002)      &                  &                  &                  &                  &                  &                  \\
[1em]
battle\_m            &                  &       0.040{$^a$}&                  &                  &                  &                  &                  &                  \\
                    &                  &     (0.012)      &                  &                  &                  &                  &                  &                  \\
[1em]
nb\_battle\_a         &                  &                  &       0.001      &      -0.001      &       0.000      &       0.000      &                  &       0.029{$^c$}\\
                    &                  &                  &     (0.002)      &     (0.002)      &     (0.002)      &     (0.002)      &                  &     (0.014)      \\
[1em]
nb\_battle\_m         &                  &                  &       0.053{$^a$}&       0.041{$^b$}&       0.062{$^a$}&       0.054{$^a$}&                  &       0.600{$^a$}\\
                    &                  &                  &     (0.016)      &     (0.017)      &     (0.013)      &     (0.013)      &                  &     (0.184)      \\
[1em]
nb\_battle\_an        &                  &                  &                  &       0.001{$^c$}&                  &                  &                  &                  \\
                    &                  &                  &                  &     (0.001)      &                  &                  &                  &                  \\
[1em]
nb\_battle\_mn        &                  &                  &                  &       0.008{$^a$}&                  &                  &                  &                  \\
                    &                  &                  &                  &     (0.003)      &                  &                  &                  &                  \\
[1em]
nb\_battle\_a\_l1      &                  &                  &                  &                  &      -0.000      &       0.000      &                  &                  \\
                    &                  &                  &                  &                  &     (0.001)      &     (0.001)      &                  &                  \\
[1em]
nb\_battle\_m\_l1      &                  &                  &                  &                  &       0.023{$^b$}&       0.021{$^a$}&                  &                  \\
                    &                  &                  &                  &                  &     (0.009)      &     (0.008)      &                  &                  \\
[1em]
nb\_battle\_a\_l2      &                  &                  &                  &                  &                  &      -0.004{$^a$}&                  &                  \\
                    &                  &                  &                  &                  &                  &     (0.001)      &                  &                  \\
[1em]
nb\_battle\_m\_l2      &                  &                  &                  &                  &                  &       0.030{$^c$}&                  &                  \\
                    &                  &                  &                  &                  &                  &     (0.016)      &                  &                  \\
[1em]
ldistance\_battle    &                  &                  &                  &                  &                  &                  &      -0.001      &      -0.001      \\
                    &                  &                  &                  &                  &                  &                  &     (0.003)      &     (0.003)      \\
[1em]
nb\_battle\_all\_dist  &                  &                  &                  &                  &                  &                  &      -0.005{$^b$}&                  \\
                    &                  &                  &                  &                  &                  &                  &     (0.002)      &                  \\
[1em]
nb\_battle\_a\_dist    &                  &                  &                  &                  &                  &                  &                  &      -0.004{$^b$}\\
                    &                  &                  &                  &                  &                  &                  &                  &     (0.002)      \\
[1em]
nb\_battle\_m\_dist    &                  &                  &                  &                  &                  &                  &                  &      -0.084{$^a$}\\
                    &                  &                  &                  &                  &                  &                  &                  &     (0.027)      \\
\hline
Observations        &      168887      &      168887      &      168887      &      168887      &      168887      &      158040      &      168887      &      168887      \\
\(R^{2}\)           &       0.314      &       0.315      &       0.315      &       0.315      &       0.315      &       0.317      &       0.315      &       0.316      \\
\hline\hline
\multicolumn{9}{l}{\footnotesize Standard errors in parentheses}\\
\multicolumn{9}{l}{\footnotesize {$^c$} p<0.1, {$^b$} p<0.05, {$^a$} p<0.01}\\
\end{tabular}
\end{table}

. eststo clear

. 
. /* QUANTIF */
. 
. use "$Output_data\BCRT_rebel.dta", clear

. g test = 1 

. collapse (sum) nb_acled nb_gid=test, by(actor_country year)

. sum nb_gid 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      nb_gid |      3,850    335.2218    298.1008          2        864

. scalar mean_nb_gid   = r(mean) 

. sum nb_acled 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    nb_acled |      3,850    3.825974    28.44337          0       1199

. scalar mean_nb_acled = r(mean) 

. 
. 
. ******************************************
. di "quantif"
quantif

. di 0.040*mean_nb_gid*100/mean_nb_acled   
350.46952

. ******************************************
. 
. log close
      name:  <unnamed>
       log:  D:\Travail\Dropbox\mining_conflict\Data_Code_BCRT_AER\results\Table_5.log
  log type:  text
 closed on:  13 Dec 2016, 11:46:38
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
