----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\Travail\Dropbox\mining_conflict\Data_Code_BCRT_AER\results\Table_A13.log
  log type:  text
 opened on:  14 Dec 2016, 11:44:34

. 
. use "$Output_data\BCRT_baseline", clear

. 
. tab mainmineral 

       Main |
 mineral of |
   the cell |      Freq.     Percent        Cum.
------------+-----------------------------------
   aluminum |         56        1.69        1.69
       coal |        448       13.50       15.19
     copper |        378       11.39       26.58
    diamond |        560       16.88       43.46
       gold |      1,162       35.02       78.48
       iron |        196        5.91       84.39
       lead |         28        0.84       85.23
     nickel |         70        2.11       87.34
  phosphate |         98        2.95       90.30
   platinum |        140        4.22       94.51
     silver |         14        0.42       94.94
   tantalum |         28        0.84       95.78
        tin |         28        0.84       96.62
       zinc |        112        3.38      100.00
------------+-----------------------------------
      Total |      3,318      100.00

. 
. /* drop diamonds and tantalum for baseline */
. drop if mainmineral == "diamond" | mainmineral == "tantalum" 
(588 observations deleted)

. 
. /*condition for estimation with spatial lags of mines*/
. global condition_around "(mainmineral != "diamond" & mainmineral_around != "diamond" & mainmineral != "tantalum" & mainmineral_around != "tantalum")"

. 
. levelsof mainmineral, local(name)
`"aluminum"' `"coal"' `"copper"' `"gold"' `"iron"' `"lead"' `"nickel"' `"phosphate"' `"platinum"' `"silver"' `"tin"' `"zinc"'

. 
. foreach x of local name {
  2. eststo, title("`x'"): my_reg2hdfespatial acled  main_lprice_mines if sd_mines == 0      &  mainmineral != "`x'"                                                                                                 , timevar(it) panelvar(cell) lat(lati
> tude) lon(longitude) distcutoff(500) lagcutoff(100000) 
  3. }
 
OLS REGRESSION
 
SE CORRECTED FOR CROSS-SECTIONAL SPATIAL DEPENDANCE
             AND PANEL-SPECIFIC SERIAL CORRELATION
 
DEPENDANT VARIABLE: acled
INDEPENDANT VARIABLES:  main_lprice_mines
 
SPATIAL CORRELATION KERNAL CUTOFF: 500 KM
(NOTE: LINEAR BARTLETT WINDOW USED FOR SPATIAL KERNAL)
SERIAL CORRELATION KERNAL CUTOFF: 100000 PERIODS
-----------------------------------------------------------------------------------
            acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
main_lprice_mines |   .0727692   .0198727     3.66   0.000     .0338191    .1117193
-----------------------------------------------------------------------------------
D:\Travail\Dropbox\mining_conflict
(est1 stored)
 
OLS REGRESSION
 
SE CORRECTED FOR CROSS-SECTIONAL SPATIAL DEPENDANCE
             AND PANEL-SPECIFIC SERIAL CORRELATION
 
DEPENDANT VARIABLE: acled
INDEPENDANT VARIABLES:  main_lprice_mines
 
SPATIAL CORRELATION KERNAL CUTOFF: 500 KM
(NOTE: LINEAR BARTLETT WINDOW USED FOR SPATIAL KERNAL)
SERIAL CORRELATION KERNAL CUTOFF: 100000 PERIODS
-----------------------------------------------------------------------------------
            acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
main_lprice_mines |   .0716129   .0198858     3.60   0.000     .0326372    .1105886
-----------------------------------------------------------------------------------
D:\Travail\Dropbox\mining_conflict
(est2 stored)
 
OLS REGRESSION
 
SE CORRECTED FOR CROSS-SECTIONAL SPATIAL DEPENDANCE
             AND PANEL-SPECIFIC SERIAL CORRELATION
 
DEPENDANT VARIABLE: acled
INDEPENDANT VARIABLES:  main_lprice_mines
 
SPATIAL CORRELATION KERNAL CUTOFF: 500 KM
(NOTE: LINEAR BARTLETT WINDOW USED FOR SPATIAL KERNAL)
SERIAL CORRELATION KERNAL CUTOFF: 100000 PERIODS
-----------------------------------------------------------------------------------
            acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
main_lprice_mines |   .0657972    .020123     3.27   0.001     .0263565     .105238
-----------------------------------------------------------------------------------
D:\Travail\Dropbox\mining_conflict
(est3 stored)
 
OLS REGRESSION
 
SE CORRECTED FOR CROSS-SECTIONAL SPATIAL DEPENDANCE
             AND PANEL-SPECIFIC SERIAL CORRELATION
 
DEPENDANT VARIABLE: acled
INDEPENDANT VARIABLES:  main_lprice_mines
 
SPATIAL CORRELATION KERNAL CUTOFF: 500 KM
(NOTE: LINEAR BARTLETT WINDOW USED FOR SPATIAL KERNAL)
SERIAL CORRELATION KERNAL CUTOFF: 100000 PERIODS
-----------------------------------------------------------------------------------
            acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
main_lprice_mines |   .0763944   .0253554     3.01   0.003     .0266983    .1260905
-----------------------------------------------------------------------------------
D:\Travail\Dropbox\mining_conflict
(est4 stored)
 
OLS REGRESSION
 
SE CORRECTED FOR CROSS-SECTIONAL SPATIAL DEPENDANCE
             AND PANEL-SPECIFIC SERIAL CORRELATION
 
DEPENDANT VARIABLE: acled
INDEPENDANT VARIABLES:  main_lprice_mines
 
SPATIAL CORRELATION KERNAL CUTOFF: 500 KM
(NOTE: LINEAR BARTLETT WINDOW USED FOR SPATIAL KERNAL)
SERIAL CORRELATION KERNAL CUTOFF: 100000 PERIODS
-----------------------------------------------------------------------------------
            acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
main_lprice_mines |   .0818062   .0223697     3.66   0.000     .0379621    .1256503
-----------------------------------------------------------------------------------
D:\Travail\Dropbox\mining_conflict
(est5 stored)
 
OLS REGRESSION
 
SE CORRECTED FOR CROSS-SECTIONAL SPATIAL DEPENDANCE
             AND PANEL-SPECIFIC SERIAL CORRELATION
 
DEPENDANT VARIABLE: acled
INDEPENDANT VARIABLES:  main_lprice_mines
 
SPATIAL CORRELATION KERNAL CUTOFF: 500 KM
(NOTE: LINEAR BARTLETT WINDOW USED FOR SPATIAL KERNAL)
SERIAL CORRELATION KERNAL CUTOFF: 100000 PERIODS
-----------------------------------------------------------------------------------
            acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
main_lprice_mines |   .0710477   .0202392     3.51   0.000     .0313793    .1107161
-----------------------------------------------------------------------------------
D:\Travail\Dropbox\mining_conflict
(est6 stored)
 
OLS REGRESSION
 
SE CORRECTED FOR CROSS-SECTIONAL SPATIAL DEPENDANCE
             AND PANEL-SPECIFIC SERIAL CORRELATION
 
DEPENDANT VARIABLE: acled
INDEPENDANT VARIABLES:  main_lprice_mines
 
SPATIAL CORRELATION KERNAL CUTOFF: 500 KM
(NOTE: LINEAR BARTLETT WINDOW USED FOR SPATIAL KERNAL)
SERIAL CORRELATION KERNAL CUTOFF: 100000 PERIODS
-----------------------------------------------------------------------------------
            acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
main_lprice_mines |   .0642972   .0199151     3.23   0.001     .0252639    .1033305
-----------------------------------------------------------------------------------
D:\Travail\Dropbox\mining_conflict
(est7 stored)
 
OLS REGRESSION
 
SE CORRECTED FOR CROSS-SECTIONAL SPATIAL DEPENDANCE
             AND PANEL-SPECIFIC SERIAL CORRELATION
 
DEPENDANT VARIABLE: acled
INDEPENDANT VARIABLES:  main_lprice_mines
 
SPATIAL CORRELATION KERNAL CUTOFF: 500 KM
(NOTE: LINEAR BARTLETT WINDOW USED FOR SPATIAL KERNAL)
SERIAL CORRELATION KERNAL CUTOFF: 100000 PERIODS
-----------------------------------------------------------------------------------
            acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
main_lprice_mines |   .0727594   .0208614     3.49   0.000     .0318715    .1136473
-----------------------------------------------------------------------------------
D:\Travail\Dropbox\mining_conflict
(est8 stored)
 
OLS REGRESSION
 
SE CORRECTED FOR CROSS-SECTIONAL SPATIAL DEPENDANCE
             AND PANEL-SPECIFIC SERIAL CORRELATION
 
DEPENDANT VARIABLE: acled
INDEPENDANT VARIABLES:  main_lprice_mines
 
SPATIAL CORRELATION KERNAL CUTOFF: 500 KM
(NOTE: LINEAR BARTLETT WINDOW USED FOR SPATIAL KERNAL)
SERIAL CORRELATION KERNAL CUTOFF: 100000 PERIODS
-----------------------------------------------------------------------------------
            acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
main_lprice_mines |   .0693344   .0201951     3.43   0.001     .0297524    .1089164
-----------------------------------------------------------------------------------
D:\Travail\Dropbox\mining_conflict
(est9 stored)
 
OLS REGRESSION
 
SE CORRECTED FOR CROSS-SECTIONAL SPATIAL DEPENDANCE
             AND PANEL-SPECIFIC SERIAL CORRELATION
 
DEPENDANT VARIABLE: acled
INDEPENDANT VARIABLES:  main_lprice_mines
 
SPATIAL CORRELATION KERNAL CUTOFF: 500 KM
(NOTE: LINEAR BARTLETT WINDOW USED FOR SPATIAL KERNAL)
SERIAL CORRELATION KERNAL CUTOFF: 100000 PERIODS
-----------------------------------------------------------------------------------
            acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
main_lprice_mines |   .0723621    .020092     3.60   0.000     .0329821    .1117421
-----------------------------------------------------------------------------------
D:\Travail\Dropbox\mining_conflict
(est10 stored)
 
OLS REGRESSION
 
SE CORRECTED FOR CROSS-SECTIONAL SPATIAL DEPENDANCE
             AND PANEL-SPECIFIC SERIAL CORRELATION
 
DEPENDANT VARIABLE: acled
INDEPENDANT VARIABLES:  main_lprice_mines
 
SPATIAL CORRELATION KERNAL CUTOFF: 500 KM
(NOTE: LINEAR BARTLETT WINDOW USED FOR SPATIAL KERNAL)
SERIAL CORRELATION KERNAL CUTOFF: 100000 PERIODS
-----------------------------------------------------------------------------------
            acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
main_lprice_mines |   .0735342   .0202945     3.62   0.000     .0337574    .1133111
-----------------------------------------------------------------------------------
D:\Travail\Dropbox\mining_conflict
(est11 stored)
 
OLS REGRESSION
 
SE CORRECTED FOR CROSS-SECTIONAL SPATIAL DEPENDANCE
             AND PANEL-SPECIFIC SERIAL CORRELATION
 
DEPENDANT VARIABLE: acled
INDEPENDANT VARIABLES:  main_lprice_mines
 
SPATIAL CORRELATION KERNAL CUTOFF: 500 KM
(NOTE: LINEAR BARTLETT WINDOW USED FOR SPATIAL KERNAL)
SERIAL CORRELATION KERNAL CUTOFF: 100000 PERIODS
-----------------------------------------------------------------------------------
            acled |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
main_lprice_mines |   .0697055   .0204458     3.41   0.001     .0296322    .1097788
-----------------------------------------------------------------------------------
D:\Travail\Dropbox\mining_conflict
(est12 stored)

. 
. set linesize 250

. esttab, mtitles drop() b(%5.3f) se(%5.3f) compress r2 starlevels(c 0.1 b 0.05 a 0.01)  se 

----------------------------------------------------------------------------------------------------------------------------------------------
                 (1)        (2)        (3)        (4)        (5)        (6)        (7)        (8)        (9)       (10)       (11)       (12) 
            aluminum       coal     copper       gold       iron       lead     nickel  phosphate   platinum     silver        tin       zinc 
----------------------------------------------------------------------------------------------------------------------------------------------
main_lpr~s     0.073a     0.072a     0.066a     0.076a     0.082a     0.071a     0.064a     0.073a     0.069a     0.072a     0.074a     0.070a
             (0.020)    (0.020)    (0.020)    (0.025)    (0.022)    (0.020)    (0.020)    (0.021)    (0.020)    (0.020)    (0.020)    (0.020) 
----------------------------------------------------------------------------------------------------------------------------------------------
N             142268     142296     142142     141764     142184     142282     142240     142198     142226     142282     142268     142240 
R-sq           0.000      0.000      0.000      0.000      0.000      0.000      0.000      0.000      0.000      0.000      0.000      0.000 
----------------------------------------------------------------------------------------------------------------------------------------------
Standard errors in parentheses
c p<0.1, b p<0.05, a p<0.01

. esttab, mtitles drop() b(%5.3f) se(%5.3f) r2  starlevels({$^c$} 0.1 {$^b$} 0.05 {$^a$} 0.01) se tex label  title() 

{
\def\sym#1{\ifmmode^{#1}\else\(^{#1}\)\fi}
\begin{tabular}{l*{12}{c}}
\hline\hline
                    &\multicolumn{1}{c}{(1)}&\multicolumn{1}{c}{(2)}&\multicolumn{1}{c}{(3)}&\multicolumn{1}{c}{(4)}&\multicolumn{1}{c}{(5)}&\multicolumn{1}{c}{(6)}&\multicolumn{1}{c}{(7)}&\multicolumn{1}{c}{(8)}&\multicolumn{1}{c}{(9)}&\multicolumn{
> 1}{c}{(10)}&\multicolumn{1}{c}{(11)}&\multicolumn{1}{c}{(12)}\\
                    &\multicolumn{1}{c}{aluminum}&\multicolumn{1}{c}{coal}&\multicolumn{1}{c}{copper}&\multicolumn{1}{c}{gold}&\multicolumn{1}{c}{iron}&\multicolumn{1}{c}{lead}&\multicolumn{1}{c}{nickel}&\multicolumn{1}{c}{phosphate}&\multicolumn{1}{
> c}{platinum}&\multicolumn{1}{c}{silver}&\multicolumn{1}{c}{tin}&\multicolumn{1}{c}{zinc}\\
\hline
$\ln$ price $\times$ mines $>0$&       0.073{$^a$}&       0.072{$^a$}&       0.066{$^a$}&       0.076{$^a$}&       0.082{$^a$}&       0.071{$^a$}&       0.064{$^a$}&       0.073{$^a$}&       0.069{$^a$}&       0.072{$^a$}&       0.074{$^a$}&       0.
> 070{$^a$}\\
                    &     (0.020)      &     (0.020)      &     (0.020)      &     (0.025)      &     (0.022)      &     (0.020)      &     (0.020)      &     (0.021)      &     (0.020)      &     (0.020)      &     (0.020)      &     (0.020)      \\
\hline
Observations        &      142268      &      142296      &      142142      &      141764      &      142184      &      142282      &      142240      &      142198      &      142226      &      142282      &      142268      &      142240      \\
\(R^{2}\)           &       0.000      &       0.000      &       0.000      &       0.000      &       0.000      &       0.000      &       0.000      &       0.000      &       0.000      &       0.000      &       0.000      &       0.000      \\
\hline\hline
\multicolumn{13}{l}{\footnotesize Standard errors in parentheses}\\
\multicolumn{13}{l}{\footnotesize {$^c$} p<0.1, {$^b$} p<0.05, {$^a$} p<0.01}\\
\end{tabular}
}

. eststo clear

. 
. log close
      name:  <unnamed>
       log:  D:\Travail\Dropbox\mining_conflict\Data_Code_BCRT_AER\results\Table_A13.log
  log type:  text
 closed on:  14 Dec 2016, 11:53:14
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
